Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: Note that you can play physically with pieces of paper or wood at first to get the grasp on this problem. This is even one of the activities that I use in my CS-IRL (computer science in real life) project to introduce the concept of algorithm to absolute beginners that wonder about our science. More information at http://www.loria.fr/~quinson/Mediation/SMN/ (in French).
pt_br: Observe que você pode brincar primeiro fisicamente com pedaços de papel ou madeira para ter a ideia do problema. Esta é inclusive uma das atividades que eu uso no meu projeto CS-IRL (computer science in real life - ciência da computação na vida real) para introduzir o conceito de algoritmo para completos iniciantes que querem saber da nossa ciência. Mais informações em http://www.loria.fr/~quinson/Mediation/SMN/ (em francês).

source: I don't get it. I need some help.
pt_br: Não compreendi. preciso de ajuda.

source: You should try to first move the largest pancake to the bottom, and then the largest but one pancake on top of it, and then the one just smaller on top, and so on.
pt_br: Você deve tentar primeiro mover a maior panqueca para o fundo, e então a segunda maior para cima dela, e depois a menor para o topo e assim por diante.

source: The first tip was not enough. I need another one.
pt_br: A primeira dica não foi suficiente. Preciso de outra.

source: So first, you need to move the largest pancake at the bottom of the stack.
pt_br: Logo, em primeiro lugar você precisa mover a maior panqueca para o fundo da pilha.

source: Can you imagine a situation in which you can easily bring this damn large pancake to the bottom?
pt_br: Você pode imaginar uma situação onde você possa facilmente trazer esta panqueca super-grande para o fundo?

source: How could you reach this situation from the current one?
pt_br: Como você pode atingir esta situação a partir da atual?

source: This problem is similar to the previous: you have to sort the pancakes, the smallest at the top and the biggest at the bottom, except you can only flip them to sort.
pt_br: Este problema é similar ao anterior: você tem que ordenar as panquecas, a menor no topo e a maior embaixo, mas você só pode virar elas para ordená-las.

source: The purpose here is to sort them using the bubble algorithm, where one pancake is moved to the bottom until it encounters a bigger one. In graphical representations, it looks like a bubble takes the element and move them through the pile. This is where its name comes from.
pt_br: O objetivo aqui é ordená-los usando o algoritmo da bolha (bubble), onde uma panqueca é movida para o fundo até encontrar uma maior que ela. Em representações gráficas, parece que uma bolha ocupa o lugar do elemento e move ele através da pilha. É daí que saiu o nome do algoritmo.

source: Now, using pancakes makes it a little more difficult to write, because you have to find a way to swap only two pancakes at a time.
pt_br: Agora, usando panquecas torna as coisas um pouco mais difíceis de escrever, pois você tem que encontrar uma forma de alternar apenas duas panquecas por vez.

source: The bubble algorithm consists in browsing the whole pile from top to bottom, and making a comparision between two pancakes. Each time the top pancake is bigger than the one below, you have to swap them, then compare the bigger pancake you just swapped with one below, and so on. You have to browse through the entire pile until no swap has occurred, in which case the pile is sorted.
pt_br: O Algoritmo da bolha consiste em navegar a pilha completa de cima para baixo, e fazendo uma comparação entre duas panquecas. Cada vez que a panqueca de cima é maior que a de baixo, você tem que alterná-las, então comparar a panqueca maior que você acabou de alternar com a de baixo dela, e por aí vai. Você tem que navegar através de toda a pilha até que nenhuma troca ocorra, e neste caso, a pilha estará ordenada.

source: If you don't understand the basic bubble sorting algorithm, you should try the exercises within the “Sorting algorithms” lesson. If you do, but can't figure a way to swap only two pancakes at a time, think of a situation where only two pancakes are swapped at a time, and find a way to reach that situation.
pt_br: Se você não entende o algoritmo básico bubble sort, tente os exercícios da lição Algoritmos de Ordenação. Se você consegue, mas não imagina uma forma de alternar apenas duas panquecas por vez, pense na situação onde apenas duas panquecas são alternadas por vez, e encontre uma forma de chegar nesta situação.

source: Burned Pancakes
pt_br: Panquecas queimadas

source: Hard blow for the chef! The pancakes got burnt on one side! There is no way he can deliver a stack of pancakes with visibly burnt pancakes! You've got to help him ensuring that no pancake is upside-down while sorting his stack.
pt_br: Hard blow for the chef! As panquecas queimaram de um lado! Não há forma de entregar uma pilha de panquecas com paquecas visivelmente queimadas! Você tem que ajudá-lo a ter certeza de que nenhuma panqueca está de cabeça pra baixo enquanto ordena esta pilha.

source: Faster Pancake Sorting
pt_br: Ondenação de Panqueca Rápida

source: Unlike others sorting problem, the expensive operation is not the comparison of values, but the flipping of pancakes. In this exercise, we will explore another algorithm that attempt to reduce the amount of stack flipping. The funny side is that this algorithm was first introduced by Bill Gates, before invented Windows.
pt_br: Ao contrário de outros problemas de ordenação, a operação cara não é a comparação de valores, mas virar as panquecas. Neste exercício, vamos explorar outro algoritmo que tenta reduzir a quantidade de viradas da pilha. O engraçado é que este algoritmo mostrado primeiro por Bill Gates, antes de inventar o Windows.

source: The basic idea is to grow sequences of sorted pancakes, not necessarily starting from the bottom. We say that a sequence of ordered pancakes constitute a <b>block</b> while a pancake that is not part of a block is said to be <b>free</b>. The algorithm then considers the topmost pancake (of radius <code>t</code>) and search for the <code>t+1</code> or <code>t-1</code> pancakes (the considered neighbor is noted <code>t+o</code>). Eight cases may happen:
pt_br: A ideia básica é aumentar as sequências de panquecas ordenadas, não necessariamente começando do fundo. Dizemos que uma sequência de panquecas ordenadas constitui um <b>bloco</b> enquanto uma panqueca que não é parte de um bloco é dita <b>livre</b>. O algoritmo então considera o panqueca mais de cima (de raio <code>t</code>) e busca pelas panquecas <code>t+1</code> ou <code>t-1</code> (a vizinhança considerada é <code>t+o</code>). Oito casos podem acontecer:

source: <b>Case a</b>: Both <code>t</code> and <code>t+o</code> are free. They are then merged in one flip.
pt_br: <b>Caso a</b>: tanto <code>t</code> quanto <code>t+o</code> são livres. elas são então juntadas em uma virada.

source: <b>Case b</b>: <code>t</code> is free, and <code>t+o</code> is the first of a block. They are merged in one flip.
pt_br: <b>Caso b</b>: <code>t</code> é livre, e <code>t+o</code> é o primeiro de um bloco. Eles são juntados em uma virada.

source: <b>Case c</b>: <code>t</code> is free but both <code>t-1</code> and <code>t+1</code> are the last elements of blocks. Both blocks and <code>t</code> are merged all together in 4 flips. Beware, if either <code>t-1</code> or <code>t+1</code> does not exist (because <code>t</code> is 0 or max), only two flips are mandated.
pt_br: <b>Caso c</b>: <code>t</code> é livre mas tanto <code>t-1</code> quanto <code>t+1</code> são últimos elementos de blocos. Os blocos e <code>t</code> são mesclados juntos em 4 viradas. Cuidado, se <code>t-1</code> ou <code>t+1</code> não existir (pois <code>t</code> é 0 ou max), apenas duas viradas são obrigatórias.

source: <b>Case d</b>: <code>t</code> is in a block but <code>t+o</code> is free. They are merged in one flip.
pt_br: <b>Caso d</b>: <code>t</code> está num bloco mas <code>t+o</code> é livre. Eles são mesclados em uma virada.

source: <b>Case e</b>: <code>t</code> is in a block and <code>t+o</code> is the first element of a block. They are merged in one flip.
pt_br: <b>Caso e</b>: <code>t</code> está num bloco e <code>t+o</code> é o primeiro elemento de um bloco. Eles são mesclados em uma virada.

source: <b>Case f</b>: <code>t</code> is in a block and <code>t+o</code> is the last element of another block. They are merged in 3 flips as follows.
pt_br: <b>Caso f</b>: <code>t</code> está em um bloco e <code>t+o</code> é o último elemento de outro bloco. Eles são mesclados em 3 viradas como segue.

source: <b>Case g</b>: <code>t</code> is in a block of length k+1 (the last element is <code>t+ko</code>), <code>t+(k+1)o</code> is either free or the last element of another block. Both blocks are merged in 2 flips:
pt_br: <b>Caso g</b>: <code>t</code> está em um bloco de comprimento k+1 (o último elemento é <code>t+ko</code>), <code>t+(k+1)o</code> é tanto livre ou o último elemento é outro bloco. Ambos os blocos são mesclados em 2 viradas:

source: <b>Case h</b>: <code>t</code> is in a block of length k+1 (the last element is <code>t+ko</code>), <code>t+(k+1)o</code> is the first element of another block (the difference with case g is that <code>t+(k+1)o</code> is now the <i>first</i> element of its block). Both blocks are merged in 2 flips:
pt_br: <b>Caso h</b>: <code>t</code> está num bloco de comprimento k+1 (o último elemento é <code>t+ko</code>), <code>t+(k+1)o</code> é o primeiro elemento de outro bloco (a diferença com o caso g é que <code>t+(k+1)o</code> é agora o <i>primeiro</i> elemento de seu bloco). Ambos os blocos são mesclados em 2 viradas:

source: <b>Case i</b>: <code>t</code> is in a block of length <code>n</code> (this block contains all pancakes). If <code>t</code> is not 1, the whole stack is fliped. The algorithm then stops.
pt_br: <b>Caso i</b>: <code>t</code> está num bloco de comprimento <code>n</code> (este bloco contém todas as panquecas). Se <code>t</code> não for 1, a pilha toda destá virada. O algoritmo então pára.

source: Each iteration increases the size of the blocks, so the algorithm eventually halts in all cases. A finer analysis would show that it takes at most <code>(5n+5)/3</code> steps to sort the stack. That's better than the naïve algorithm, that requires 2n-3 steps.
pt_br: Cada iteração aumenta o tamanho dos blocos, então o algoritmo eventualmente pára em todos os casos. Uma análise mais aprofundada mostrará que leva no máximo <code>(5n+5)/3</code> passos para ordenar a pilha. O que é melhor que o algoritmo simplório, que precisa de 2n-3 passos.

source: Your turn
pt_br: Sua vez

source: You now have almost enough information to implement this algorithm on your own. We just have to remove the last remaining ambiguities to ensure that you implement exactly the same algorithm that the correction. If several cases apply to your situation, then you should use the first given one. For example, if both cases a and b apply (e.g., with <code>t-1</code> on case <b>a</b> and <code>t+1</code> on case <b>b</b>), then you should apply the flips of case <b>a</b>. If a given case applies for both <code>t+1</code> and <code>t-1</code>, then you should apply it to <code>t+1</code>.
pt_br: Você agora tem quase toda a informação necessária para implementar este algoritmo por si só. Temos apenas que remover as últimas ambiquidades para garantir que você implemente exatamente o mesmo algoritmo que a correção. Se vários casos se aplicam a sua situação, então você deve usar o primeiro que foi dado. Por exemplo, se tanto o caso a quanto o caso b se se aplicam (e.g., com <code>t-1</code> no <b>a</b> e <code>t+1</code> no caso <b>b</b>), então você deve aplicar as viradas do caso <b>a</b>. Se um dado caso se aplica tanto para <code>t+1</code> quanto para <code>t-1</code>, então você deve aplicá-lo a <code>t+1</code>.

source: Note that it is somehow harder than the other exercises we did so far, so don't be surprised if you need more time to achieve this. But do not give up hope, you can do it!
pt_br: Observe que este é de certa forma mais difícil que os outros exercícios que fizemos até agora, logo não se surpreenda se você precisar de mais tempo para terminar. Mas não desista, você pode conseguir!

source: Well, I need some help to start.
pt_br: Bem, eu preciso de alguma ajuda para começar.

source: First write some helper functions such as <code>isFirst()</code> or <code>isFree()</code>. This will simplify your main algorithm afterward, that can be written very similarly to the explication above with a bunch of if conditions. Factorizing code this way often helps making your code more readable.
pt_br: Primeiro escreva algumas funções auxiliares tais como <code>isFirst()</code> ou <code>isFree()</code>. Isto vai simplificar seu algoritmo principal, que vai poder ser escrito de forma muito similar à explicação acima com um conjunto de condições if. Fatorizar o código desta forma às vezes ajuda a tornar seu código mais legível.

source: My code keeps failing and I don't know how to debug it.
pt_br: Meu código continua falhando e eu não sei como depurar ele.

source: To debug one world after the other and avoid that the messages of all worlds get intermixed, you can write your debug function only if the method <code>isSelected()</code> returns true. It will be so only for the entity that is currently selected in the graphical interface, that is probably the world you are currently debugging. This will help breaking the difficulty in parts by debugging the situation one after the other.
pt_br: Para depurar um mundo depois do outro e evitar que as mensagens de todos os mundos fiquem misturadas, você pode escrever sua função de depuração apenas se o método <code>selecionado()</code> retorna verdadeiro. Isto acontecerá apenas para a entidade que estiver selecionada na interface gráfica, que é provavelmente o mundo que você está depurando no momento. Isto vai ajudar dividindo a dificuldade em partes e depurando a situção uma após a outra.

source: In particular, it may help to print textually the state of the world each time you enter the main loop.
pt_br: Em particular, escrever textualmente o estado do mundo cada vez que você entrar no loop principal pode ajudar.

source: The Gates' algorithm that we saw in the previous exercise quickly sort a stack of unburned pancakes by increasing the size of the blocks of sorted pancakes. This is much faster that the naive algorithm which moves at each step the largest pancake to the bottom of still unsorted pancakes. Gates' algorithm manages to sort a stack of <i>n</i> pancakes in less than <i>(5n + 5)/3</i> steps in the worst case, while the naive algorithm requires at most <i>2n</i> steps. Gates is thus about one third faster in the worst case.
pt_br: O algoritmo de Gates que vimos no exercício anterior ordena rapidamente uma pilha de panquecas que não estão queimadas aumentando o tamanho dos blocos de panquecas já ordenadas. Isto é muito mais rápido que o algoritmo que move em cada passo a panqueca maior para o fundo das panquecas ainda não ordenadas. O algoritmo de Gates ordena uma pilha de <i>n</i> panquecas em menos que <i>(5n + 5)/3</i> passos no pior caso, enquanto que o algoritmo simplório precisa de no máximo <i>2n</i> passos. Gates é então cerca de 3 vezes mais rápido no pior caso.

source: In this exercise, we will explore an adaptation of the same idea to burnt pancakes. This was first published by David X. Cohen and Manuel Blum. David Cohen co-founded a few years later the Futurama TV show full of mathematical jokes. Definitively, interesting people studied that little pancake problem...
pt_br: Neste exercício, vamos explorar uma adaptação da mesma ideia das panquecas queimadas. Isto foi publicado primeiramente por David X. Cohen e Manuel Blum. David Cohen co-fundou uns anos depois a série de TV Futurama, cheia de piadas matemáticas. Definitivamente, pessoas interessantes estudaram este singelo problema da panqueca...

source: The Cohen's algorithm is slightly easier than the Gates' one since it distinguishes less cases:
pt_br: O algoritmo de Cohen é um pouco mais fácil que o algoritmo de Gates já que ele distingue menos casos:

source: <b>Case 1:</b> At least one pancake is rightside up in the stack. Let <i>p</i> be the largest such pancake. Note that <i>p + 1</i> must therefore be upside down, unless <i>p = n</i> (in which case there is no <i>p + 1</i> pancake).
pt_br: <b>Caso 1:</b> pelo menos uma panqueca está de cabeça para cima na pilha. Seja <i>p</i> a maior destas panquecas. Observe que <i>p + 1</i> deve portanto estar de cabeça para baixo, a menos que <i>p = n</i> (e neste caso não existe a panqueca <i>p + 1</i>).

source: <b>Case 1.a:</b> <i>p+1</i> is lower in the stack than <i>p</i>.
pt_br: <b>Caso 1.a:</b> <i>p+1</i> é menor que <i>p</i> na pilha.

source: <b>Case 1.b:</b> <i>p+1</i> is higher in the stack than <i>p</i>.
pt_br: <b>Caso 1.b:</b> <i>p+1</i> é maior que <i>p</i> na pilha.

source: <b>Case 1.c:</b> There is no <i>p+1</i> because <i>p</i> is the largest pancake in stack, that is because <i>p = n</i>. If pancake <i>p</i> is already in position, there is nothing to do. If not, you can move it to the bottom of the stack in 2 flips:
pt_br: <b>Caso 1.c:</b> Não existe <i>p+1</i> pois <i>p</i> é a maior panqueca da pilha, isto por que <i>p = n</i>. Se a panqueca <i>p</i> já estiver na posição, não há nada a fazer. Se não, você pode movê-la para o fundo da pilha em duas viradas:

source: <b>The trick is that the pancake <i>p</i> should never be considered again.</b> Otherwise, you will consider that pancake again and again since it's rightside up, and since that's the largest pancake. To leave that pancake alone, you should keep track of the stack size that is still to be sorted. Any traversal of the stack must then only consider these pancakes, leaving alone the ones that are already in position at the bottom of the stack.
pt_br: <b>O truque é que a panqueca <i>p</i> nunca deve ser considerada de novo.</b> caso contrário, você vai considerar ela de novo e de novo pois ela está de cabeça pra cima, e já que é a maior panqueca. Para desconsiderar ela, você deve lembrar da tamanho da pilha que ainda está para ser ordenada. Qualquer travessia da pilha deve então considerar apenas estas panquecas, não mexendo nas que já estão posicionadas no fundo da pilha.

source: <b>Case 2:</b> All pancakes are downside. Again, we distinguish two sub-cases.
pt_br: <b>Caso 2:</b> Todas as panquecas estão de cabeça para baixo. De novo, distinguimos dois sub-casos.

source: <b>Case 2.a:</b> There is at least one <i>p</i> for which <i>p+1</i> is higher than <i>p</i> (if there is several such <i>p</i>, take the largest one).
pt_br: <b>Caso 2.a:</b> Existe pelo menos um <i>p</i> para o qual <i>p+1</i> é maior que <i>p</i> (se existem vários destes <i>p</i>, pegue o maior).

source: <b>Case 2.b:</b> Any pancake <i>p</i> is lower than pancake <i>p+1</i>. In that case, we must have that setting:
pt_br: <b>Caso 2.b:</b> Qualquer panqueca <i>p</i> é menor que a panqueca <i>p+1</i>. Neste caso, devemos ter a seguinte configuração:

source: As you can see, we achieve one join in 2 flips in the cases 1 or 2.a. Since we need to achieve n joins to sort the stack, we can sort the stack in <i>2n</i> steps if case 2.b does not occurs.
pt_br: Como você pode ver, alcançamos um "join" em duas viradas nos casos 1 ou 2.a. Já que nós precisamos alcançar n junções para ordenar a pilha, podemos ordenar a pilha em <i>2n</i> passos se o caso 2.b não ocorrer.

source: That case 2.b requires a very different handling as it is obviously not possible to achieve a join in only 2 flips. But fortunately, we can leverage the very specific setting of the stack in that case to provide the following algorithm. It sorts a stack in that exact configuration after exactly <i>2n</i> steps.
pt_br: Este caso 2.b necessita um tratamento particular já que é obviamente impossível juntar duas panquecas em apenas duas viradas. Mas por sorte, uma única configuração bem específica da pilha cai neste caso da figura. Podemos então utilizar o algoritmo seguinte, conhecido por tirar vantagem desta configuração. Este algoritmo ordena toda a pilha em exatamente <i>2n</i> passos.

source: Repeat n times Flip the whole stack of n pancakes Flip the top (n-1) pancakes
pt_br: Repita n vezes vire a pilha toda de n panquecas Vire as (n-1) panquecas mais de cima

source: It may sound somehow magic, but it actually works, as depicted on an example below.
pt_br: Pode parecer mágica, mas funciona de verdade, como é mostrado no exemplo abaixo.

source: So, all in all, the Cohen algorithm manages to sort the stack of burnt pancakes in <i>2n</i> steps in all cases. Quite a win over the naive algorithm for burnt pancakes that requires <i>3n</i> steps.
pt_br: Portanto, em todo caso, o algoritmo de Cohen trata de ordenar a pilha de panquecas queimadas em <i>2n</i> passos em todos os casos. Uma vitória sobre o algoritmo simplório para panquecas queimadas que precisa de <i>3n</i> passos.

source: I cannot get it right.
pt_br: Não entendi direito.

source: Don't worry. This exercise is very difficult, so it's ok if it does not work right away for you. Add some relevant logging to your code to understand where it stop performing correctly. Make sure to use the method <code>isSelected()</code> so that your logs only appears in the currently displayed world. In particular, it may help to print textually the state of the world each time you enter the main loop.
pt_br: Não se preocupe. Este exercício é muito difícil, então tudo bem se você não conseguir de primeira. Adicione alguns logs relevantes ao seu código para entender onde ele parou de funcionar corretamente. Certifique-se de usar o método <code>selecionado()</code> de forma que seus logs apenas apareçam no mundo que estiver sendo exibido no momento. Em particular, pode ajudar se você imprimir textualmente o estado do mundo cada vez que você adentrar no loop principal.

source: The Rainbow Baseball Game
pt_br: O jogo do basebal multicores

source: This activity is inspired from the orange game, from the "Computer Science Unplugged" activities repository. It was however heavily since then, first for the CSIRL (my repository of <i>free</i> unplugged activities to introduce computer science, available at http://www.loria.fr/~quinson/Mediation/SMN/) and now for PLM.
pt_br: Esta atividade é inspirada do jogo orange, do repositório de atividades "Computer Science Unplugged". Ela foi entretanto profundamente alterada, primeiro para o CSIRL (meu repositório de atividades unplugged <i>livres</i> para introduzir a ciência da computação, disponível em http://www.loria.fr/~quinson/Mediation/SMN/) e agora para o PLM.

source: In the literature, the generalized form of this problem is known as the pebble motion problem (the bases can be connected by any kind of graph, and the affinity of pebbles with bases may be different). Another variant of this problem is the well known 15-puzzle, with one player per base, and a two dimensional square grid. Much more information about these problems can be found on wikipedia, as usual.
pt_br: Na literatura, a forma geral deste problema é conhecida como o "Pebble motion problem" (as bases podem ser conectadas por qualquer tipo de grafo, e a afinidade das "pebbles" com as bases pode ser diferente). Outra variante deste problema é o famoso jogo do 15, com um jogador por base, e um tabuleiro quadrado bidimensional. Mais informações sobre estes problemas podem ser encontradas na wikipédia em inglês, como sempre.

source: How do you know that the naive algorithm won't loop on that initial situation?
pt_br: Como você sabe que o algoritmo simplório não vai entrar em loop nesta situação inicial?
