Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: [!java|scala]An array[/!][!python]A list[/!] is an ordered sequence of variables that go together. It is somehow similar to a shelve where each level can store a separate value. Each variable of the sequence is identified by its position, and can store a specific value. [!java|scala]All cells of the array must store values of the same type because arrays are homogeneous in [!thelang]. It is possible to trick this restriction by using the datatype <code>[!java]Object[/!][!scala]Any[/!]</code> that can contain [!java]almost[/!] any other datatype. [!java]Primitive types such as the ones we saw so far (int, boolean, double, char, etc) cannot be stored in an Object variable, but their objectified counter-part (Integer, Boolean, Double, Char, Boolean, etc) can.[/!] It is however a good practice to make the type of an array as specific as possible, i.e., if you plan to store some integers in your array, make it an array of integers, not of [!java]Object[/!][!scala]Any[/!].[/!] [!python]Lists can even mix values of differing types, such as integer values in some cells and colors in other cells.[/!]
pt_br: [!java|scala]Uma array[/!][!python]Uma list[/!] é uma sequência ordenada de variáveis que ficam juntas. é similar a uma estante onde em cada prateleira se coloca um valor separado. Cada variável da sequência é identificada por sua posição, e pode armazenar um valor específico. [!java|scala]todas as células da array devem armazenar valores do mesmo tipo por que arrays são homogêneas em [!thelang]. É possível burlar esta restrição usando tipos de dados <code>[!java]Object[/!][!scala]Any[/!]</code> que contenham [!java]praticamente[/!] qualquer outro tipo de dados. [!java]Tipos primitivos como aqueles que vimos anteriormente (int, boolean, double, char, etc) não podem ser armazenados numa variável Object, mas suas contrapartidas objetificadas (Integer, Boolean, Double, Char, Boolean, etc) podem.[/!] Entretanto, é boa prática fazer o tipo de uma array o mais específico possível, i.e., se você planeja armazenar alguns inteiros na sua array, faça dela uma array de inteiros, não de [!java]Object[/!][!scala]Any[/!].[/!] [!python]Lists podematé mesmo misturar valores de diferentes tipos, como valores inteiros em algumas células e cores em outras células.[/!]

source: T is the [!java|scala]array[/!][!python]list[/!]'s name, [!java|python]T[0][/!][!scala]T(0)[/!] is the name of the first cell, [!java|python]T[1][/!][!scala]T(1)[/!] the name of the second cell, [!java|python]T[2][/!][!scala]T(2)[/!] the third one, etc. And yes, the first cell is numbered [!java|python]T[0][/!][!scala]T(0)[/!] while the last one of [!java|scala]an array[/!][!python]a list[/!] of size N is [!java|python]T[N-1][/!][!scala]T(N-1)[/!]. It may seem funny to count starting from 0 and not from 1 as usual, but some historical reasons make it unavoidable here.
pt_br: T é o nome da [!java|scala]array[/!][!python]list[/!], [!java|python]T[0][/!][!scala]T(0)[/!] é o nome da primeira célula, [!java|python]T[1][/!][!scala]T(1)[/!] é o nome da segunda célula, [!java|python]T[2][/!][!scala]T(2)[/!] da terceira e etc. E sim, a primeira célula é numerada [!java|python]T[0][/!][!scala]T(0)[/!] e a última de uma [!java|scala]array[/!][!python]list[/!] de tamanho N é [!java|python]T[N-1][/!][!scala]T(N-1)[/!]. Pode parecer estranho contar a partir de 0 e não de 1 como normalmente, mas por motivos históricos isto agora é inevitável.

source: Basic usage
pt_br: Uso básico

source: We can use an integer variable <i>i</i> to access with [!java|python]T[i][/!][!scala]T(i)[/!] to the cells: when the value of <i>i</i> is 0, then [!java|python]T[i][/!][!scala]T(i)[/!] accesses [!java|python]T[0][/!][!scala]T(0)[/!]; when the value of <i>i</i> is 10, then [!java|python]T[i][/!][!scala]T(i)[/!] accesses [!java|python]T[10][/!][!scala]T(10)[/!]. <i>i</i> is said to be the <b>index</b> in T. <code>[!java|python]T[i][/!][!scala]T(i)[/!]</code> can be used just like any variable. We can set a new value:
pt_br: Podemos usar uma variável inteira <i>i</i> para acessar com [!java|python]T[i][/!][!scala]T(i)[/!] as células: quando o valor de <i>i</i> é 0, [!java|python]T[i][/!][!scala]T(i)[/!] acessa [!java|python]T[0][/!][!scala]T(0)[/!]; quando o valor de <i>i</i> é 10, [!java|python]T[i][/!][!scala]T(i)[/!] acessa [!java|python]T[10][/!][!scala]T(10)[/!]. Sizemos que <i>i</i> é o <b>índice</b> em T. <code>[!java|python]T[i][/!][!scala]T(i)[/!]</code> pode ser usada simplesmente como qualquer variável. Podemos configurar um novo valor:

source: We can retrieve and use its value:
pt_br: Podemos recuperar e usar seu valor:

source: We can test this value:
pt_br: Podemos testar este valor:

source: if ([!java|python]T[i][/!][!scala]T(i)[/!] > 0) [!scala|java]{[/!][!python]:[/!] [!java|scala]//[/!][!python]#[/!] instructions... [!java|scala]}[/!]
pt_br: if ([!java|python]T[i][/!][!scala]T(i)[/!] > 0) [!scala|java]{[/!][!python]:[/!] [!java|scala]//[/!][!python]#[/!] instruções... [!java|scala]}[/!]

source: It is very easy to traverse the whole [!scala|java]array[/!][!python]list[/!], for example to initialize each cells.
pt_br: É muito fácil percorrer toda a [!scala|java]array[/!][!python]list[/!], por exemplo para iniciar as células.

source: [!java|scala]The notation <code>T.length</code> retrieves the length of the array T,[/!] [!python]The function <code>len()</code> retrieves the length of the list T,[/!] allowing to build a classical for loop easily. [!python]Actually, the <code>len()</code> function is much more generic and can be used to retrieve the length of many objects. Applied to strings for example, it returns the amount of chars in this string.[/!] [!scala]Don't forget to start at <code>0</code> and stop at <code>T.length-1</code> instead of <code>1</code> to <code>T.length</code> however.[/!]
pt_br: [!java|scala]A notação <code>T.length</code> recupera o comprimento (length) da array T,[/!] [!python]A função <code>len()</code> recupera o comprimento da lista T,[/!] permitindo que se construa um loop clássico facilmente. [!python]Na verdade, a função <code>len()</code> é muito mais genérica e pode ser usada para recuperar o comprimento de muitos objetos. Aplicada numa string, por exemplo, ela retorna a quantidade de caracteres na string.[/!] [!scala]Não esqueça de começar em <code>0</code> e terminar em <code>T.length-1</code> ao invés de ir de <code>1</code> até <code>T.length</code>.[/!]

source: If you just want to iterate over the values of T without keeping track of their index, you can simply write:
pt_br: Se você quer simplesmente iterar nos valores de T sem controlar o índice, pode simplesmente escrever:

source: [!java]for (int i: T) {[/!][!scala]for (i &lt;- T) {[/!][!python]for i in T:[/!] action()[!java];[/!] [!java|scala]}[/!]
pt_br: [!java]for (int i: T) {[/!][!scala]for (i &lt;- T) {[/!][!python]for i in T:[/!] ação()[!java];[/!] [!java|scala]}[/!]

source: [!java]This construct is called an <i>extended loop</i> in Java. The variable <i>i</i> takes all values of the set located to the right of the colon (:), one after the other.[/!] [!python|scala]This is actually very similar to the previous construct. Simply, <code>[!python]range(n)[/!][!scala]i to j[/!]</code> returns a set of integers over which the for construct iterates. Actually, [!thelang] offers much more elegant ways to traverse [!python]lists[/!][!scala]arrays[/!] and other data collections, but this should be the topic of a specific set of exercises (that are still to be written in PLM).[/!]
pt_br: [!java]Esta construção é chamada um <i>loop extendido</i> em Java. A variável <i>i</i> assume todos os valores do conjunto localizado a direita do dois-pontos (:), um depois do outro.[/!] [!python|scala]Isto é na verdade muito similar à construção anterior. Simplesmente, <code>[!python]range(n)[/!][!scala]i to j[/!]</code> retorna um conjunto de inteiros sobre os quais o loop for itera. Na verdade, [!thelang] oferece formas muito mais elegantes de percorrer [!python]lists[/!][!scala]arrays[/!] e outras coleções de dados, mas isto fica para um conjunto específico de exercícios (que ainda será escrito no PLM).[/!]

source: Declaring [!python]a list[/!][!java|scala]an array[/!]
pt_br: Declarando uma [!python]list[/!][!java|scala]array[/!]

source: If you know beforehand the content of your list, you can affect these values all together. Just put them between square braces and separated by commas as follows:
pt_br: Se você sabe antecipadamente o conteúdo da sua lista, você pode atribuir os valores todos juntos. Coloque eles simplesmente entre colchetes e separados por vírgulas como segue:

source: L = [1, 3, 5, 7, 9] <span class="comment"># L is now an array of 5 values, all of them being integers</span>
pt_br: L = [1, 3, 5, 7, 9] <span class="comment"># L agora é uma array de 5 valores, todos eles inteiros</span>

source: Otherwise, you probably want to create an empty list and then append each values separately to the list:
pt_br: Por outro lado, você provavelmente vai querer criar uma lista vazia e então anexar os valores separadamente a ela:

source: L2 = [] <span class="comment"># L2 is now an empty list</span> L2.append(1) L2.append(3) L2.append(5) L2.append(7) L2.append(9) <span class="comment"># Its content is now the same as L previously</span>
pt_br: L2 = [] <span class="comment"># neste momento, L2 é uma lista vazia</span> L2.append(1) L2.append(3) L2.append(5) L2.append(7) L2.append(9) <span class="comment"># E agora seu conteúdo é igual ao de L, vista antes</span>

source: To declare a variable named <b>T</b> that can store an array of integers, one should write:
pt_br: Para declarar uma variável chamada <b>T</b> que pode guardar uma array de inteiros, você deve escrever:

source: [!java]<code>int</code> means that the elements of the array are of type integer; <code>[]</code> means that we are speaking of an array and <code>T</code> is the name of the variable. For historical reasons, this can also be written as <code>int T[]</code> (with the [] after the variable name), but this is less readable and should probably be avoided.[/!] [!scala]The <code>[Int]</code> notation specializes the Array type (that is generic), specifying that each cell of this array is an integer. An array of booleans would simply by written <code>Array[Boolean]</code>.[/!]
pt_br: [!java]<code>int</code> significa que os elementos da array são do tipo inteiro; <code>[]</code> significa que estamos falando de uma array e <code>T</code> é o nome da variável. Por motivos históricos, também pode ser escrito como <code>int T[]</code> (com o [] depois do nome da variável), mas como assim é menos legível é melhor você evitar esta forma.[/!] [!scala]A notação <code>[Int]</code> especializa o tipo Array (que é genérico), especificando que cada célula desta array é um inteiro. Um array de booleanos deve ser escrito simplesmente como <code>Array[Boolean]</code>.[/!]

source: Allocating an array
pt_br: Alocando uma array

source: Declaring a variable <code>T</code> that stores an array only reserve the <b>name</b> <code>T</code> for later use, but not the memory area to store the cells. The array is not initialized yet: it does not have any value. What would <code>[!java]T[4][/!][!scala]T(4)[/!]</code> mean if we didn't say that the array is 5 cells long?
pt_br: Declarar uma variável <code>T</code> que armazena uma array apenas reserva o <b>nome</b> <code>T</code> para uso futuro, mas não reserva a área de memória para armazenar as células. A array ainda não está inicializada: ela não tem qualquer valor. O que significa <code>[!java]T[4][/!][!scala]T(4)[/!]</code> se ainda não dissemos que a array tem 5 células?

source: First and foremost, we have to give a value to <code>T</code>:
pt_br: Primeiramente, temos que dar um valor a <code>T</code>:

source: <code>new</code> means that we want to create something, and <code>[!java]int[10][/!][!scala]Array[Int](10)[/!]</code> means that it is an array of 10 integer values. In return, an array of 10 integer cells is created in memory, and the <code>T</code> variable <b>references</b> this array.
pt_br: <code>new</code> (novo) significa que nós queremos criar algo, e <code>[!java]int[10][/!][!scala]Array[Int](10)[/!]</code> significa que é uma array de 10 valores inteiros. Como resultado, uma array de 10 células para valores inteiros é criada na memória, e a variável <code>T</code> <b>faz referência</b> a esta array.

source: The size of an array is fixed and cannot be changed after the creation of the array. The size of a <code>T</code> array can be retrieve by consulting the variable <code>T.length</code>.
pt_br: O tamanho de uma array é fixo e não pode ser mudado depois da criação da array. O tamanho de uma array <code>T</code> pode ser recuperado ao se consultar a variável <code>T.length</code>.

source: While allocating, you can specify the size with a variable: <code>[!java]int[] T = new int[i];[/!][!scala]var T = new Array[Int](i);[/!]</code> In this case, the array's size will be set to the value of <code>i</code> <i>when <code>new</code> gets called</i>. The size of the array still cannot be modified: even if the variable <code>i</code> changes afterward, the size remains to the value given when it was allocated. [!java]Also, it is forbidden to write something like <code>int T[10];</code> when declaring the variable. You are required to use the <code>new</code> instruction to allocate it, as in <code>int[] T = new int[10];</code> [/!]
pt_br: Na hora da alocação, você pode especificar o tamanho com uma variável: <code>[!java]int[] T = new int[i];[/!][!scala]var T = new Array[Int](i);[/!]</code> Neste caso, o tamanho da array será ajustado para o valor de <code>i</code> <i>quando <code>new</code> for chamado</i>. O tamanho da array ainda não pode ser modificado: mesmo se a variável <code>i</code> mudar depois disto, o tamanho permanece o do valor dado no momento da alocação. [!java]Além disto, é proibido escrever algo como <code>int T[10];</code> no momento de declarar a variável. Você deve usar a instrução <code>new</code> para alocar o array, como em <code>int[] T = new int[10];</code> [/!]

source: Declaration and initialization
pt_br: Declaração e inicialização

source: If you know beforehand the content of your array, you can declare, allocate and initialize it in one shoot:
pt_br: Se você sabe previamente o conteúdo da sua array, você pode declarar, alocar e inicializar ela tudo de uma vez:

source: To know the size of the array to allocate, the compiler counts the provided values. This code is equivalent to:
pt_br: Para saber o tamanho da array para alocar, o compilador conta os valores dados. Este código é equivalente a:

source: It is also equivalent to:
pt_br: também é equivalente a:

source: [!python]Lists[/!][!scala|java]Arrays[/!] and method parameters
pt_br: [!python]Lists[/!][!scala|java]Arrays[/!] e parâmetros de métodos

source: It is perfectly OK to pass [!python]a list[/!][!java|scala]an array[/!] to a method as a parameter. This method can then use this parameter as if it were defined locally:
pt_br: Não tem nenhum problema passar uma [!python]list[/!][!java|scala]array[/!] para um método como parâmetro. Este método pode então usar este parâmetro como se ele fosse definido localmente:

source: On the caller side, that also very simple:
pt_br: No lado de quem invoca também é bastante simples:

source: [!java]int[] tab = new int[10];[/!][!scala]var tab = new Array[Int] (10)[/!][!python]tab = [1, 3, 5, 7, 9][/!] [!java|scala]<span class="comment">// Values initialization omitted</span> [/!]if (has42First(tab))[!java|scala] {[/!][!python]:[/!] <span class="comment">[!java|scala]//[/!][!python]#[/!] do something</span> [!java|scala]}[/!]
pt_br: [!java]int[] tab = new int[10];[/!][!scala]var tab = new Array[Int] (10)[/!][!python]tab = [1, 3, 5, 7, 9][/!] [!java|scala]<span class="comment">// inicialização de valores omitida</span> [/!]if (has42First(tab))[!java|scala] {[/!][!python]:[/!] <span class="comment">[!java|scala]//[/!][!python]#[/!] faz algo</span> [!java|scala]}[/!]

source: If you want to allocate and initialize the array in one shoot, that's a bit more complicated as the compiler has to know the type of the parameter you are creating. For that, use the following (ugly) construct:
pt_br: Se você quer alocar e inicializar o array de uma vez só, é um pouco mais complicado pois o compilador terá que saber o tipo do parâmetro que você está criando. Para isto, use a seguinte construção (feia):

source: if (has42First( new int[] {1, 3, 5, 7, 9} ) { <span class="comment">// do something</span> }
pt_br: if (has42First( new int[] {1, 3, 5, 7, 9} ) { <span class="comment">// faz algo</span> }

source: Methods can also return [!java|scala]arrays[/!][!python]lists[/!] as result without any complication. Here is a method that returns [!java|scala]an array[/!][!python]a list[/!] of the requested size, filled with 42s.
pt_br: Métodos também podem retornar [!java|scala]arrays[/!][!python]lists[/!] como resultado sem nenhuma complicação. Aqui está um método que retorna uma [!java|scala]array[/!][!python]list[/!] do tamanho pedido, preenchido com 42s.

source: Goal of this exercise
pt_br: Objetivo deste exercício

source: At least! After this long explanation, we can come back to the exercise.
pt_br: Finalmente! Depois desta longa explicação, podemos voltar ao exercício.

source: Your mission is rather simple actually. Your code should save the color pattern observed on the first row into [!java|scala]an array[/!][!python]a list[/!]. [!python]The easiest is to create an empty list, and then <code>append()</code> the colors one after the others as you read them (with <code>getGroundColor()</code>).[/!] [!java|scala]For that, you should declare and allocate an array of <code>Color</code>. Beware, there is several worlds, of differing size; use <code>getWorldHeight()</code> to retrieve the size of the current world. Once the array allocated, fill it by reading the ground color in each locations (with <code>getGroundColor()</code>).[/!]
pt_br: Sua missão é bastante simples na verdade. Seu código deve guardar o padrão de cores observado na primeira linha numa [!java|scala]array[/!][!python]list[/!]. [!python]O mais fácil é criar uma lista vazia, e então usar <code>append()</code>para adicionar as cores uma por uma à medida em que você for lendo elas (com <code>getCorDoChão()</code>).[/!] [!java|scala]Para isto, você deve declarar e alocar uma array de <code>Cor</code>. Mas atencção, existem vários mundos, de diferentes tamanhos; use <code>getAlturaDoMundo()</code> para recuperar o tamanho do mundo atual. Uma que a array esteja alocada, preencha ela lendo a cor do chão em cada um dos pontos (com <code>getCorDoChão()</code>).[/!]

source: Once you managed to read and save the pattern on the first row, you have to reapply the pattern on every rows, for example by executing <code>getWorldHeight()</code> times a method written specifically for this.
pt_br: Uma vez que você conseguiu ler e gravar o padrão na primeira linha, você tem que reaplicar o padrão nas outras linhas, por exemplo executando <code>getAlturaDoMundo()</code> vezes um método escrito especificamente para isto.

source: [!java|scala]Arrays[/!][!python]Lists[/!], Knotting and Modulos
pt_br: [!java|scala]Arrays[/!][!python]Lists[/!], Nós e Módulos

source: This exercise is similar to the previous one: you have to reproduce the color pattern of the first cell into the other ones.
pt_br: Este exercício é similar ao anterior: você tem que reproduzir o padrão de cores da primeira célula nas outras.

source: The first difference is that the world is bordered of walls: you thus have to slightly modify your trajectory to ensure that the buggle does not crash into a wall. The simpler for that is to handle the first cell out of the <code>for</code> loop and do only <code>getWorldHeight()-1</code> steps in the loop.
pt_br: A primeira diferença é que o mundo é cercado de muros: você portanto tem que modificar levemente sua trajetória para garantir que o buggle não bata num muro. O jeito mais simples é manipular a primeira célula fora do loop <code>for</code> e fazer apenas <code>getAlturaDoMundo()-1</code> passos no loop.

source: The other difference is that the offset to apply between columns is not fixed, but written on the first cell of each column. To get the info as an integer, we can use:
pt_br: A outra diferença é que o deslocamento para aplicar entre as colunas não é fixo, mas está escrito na primeira célula de cada coluna. Para obter a informação como um inteiro, podemos usar:

source: [!java]int offset = Integer.parseInt(readMessage())[/!][!python]offset = int( readMessage() )[/!][!scala]val offset = readMessage().toInt[/!]
pt_br: [!java]int deslocamento = Integer.parseInt(readMessage())[/!][!python]deslocamento = int( readMessage() )[/!][!scala]val deslocamento = readMessage().toInt[/!]

source: <code>readMessage()</code> gets the message on the ground as a [!java|scala]String[/!][!python]string[/!], while <code>[!java]Integer.parseInt(str)[/!][!scala]str.toInt[/!][!python]int(str)[/!]</code> transforms the string <code>str</code> into an integer by <i>reading</i> it.
pt_br: <code>readMessage()</code> obtém a mensagem no chão como uma [!java|scala]String[/!][!python]string[/!], enquanto <code>[!java]Integer.parseInt(str)[/!][!scala]str.toInt[/!][!python]int(str)[/!]</code> transforma a string <code>str</code> em um inteiro ao <i>ler</i> ela.

source: Then, to pick the right color, the easier is to use the <code>%</code> (modulo) operator. For example, <code>(i + 5) % size</code> allows to retrieve the <code>i</code>th cell of an array of size <code>size</code> with an offset of <code>5</code>.
pt_br: Então, para pegar a cor certa, o mais fácil é usar o operador <code>%</code> (operador módulo). Por exemplo, <code>(i + 5) % tam</code> serve para recuperar a <code>i</code>-ésima célula de uma array de tamanho <code>tam</code> com um deslocamento de <code>5</code>.

source: You're up.
pt_br: Agora é com você.

source: Searching for a given value
pt_br: Buscando por um dado valor

source: The goal of this exercise is to search the cell of a given value, and return its position.
pt_br: O objetivo deste exercício é buscar a célula de um dado valor, e retornar sua posição.

source: To that extend, you should fill the method <code>indexOf()</code>, which parameters are the array to explore, and the value to search. If the value <code>lookingFor</code> is not in the array <code>tab</code>, the method should return -1.
pt_br: Para isto, você deve preencher o método <code>indexOf()</code>, cujos parâmetros são a array a ser explorada, e o valor a ser buscado. Se o valor <code>lookingFor</code> não está na array <code>tab</code>, o método deve retornar -1.

source: The idea of the algorithm is to sweep over the whole array, checking the value of each cell. If it's the searched value, you should return the index of the cell currently checked.
pt_br: A ideia do algoritmo é varrer toda a array, verificando o valor de cada célula. Se for o valor procurado, você deve retornar o índice da célula que está sendo verificada.

source: Remember that indices begin at 0 and not at 1. So, if there is 3 cells, their indices will be 0, 1 and 2. There would not be any cell numbered 3.
pt_br: Lembre que os índices começam com 0 e não com 1. Logo, se houverem 3 células, seus índices serão 0, 1 e 2. Não vai haver nenhuma célula numerada com 3.
