Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: The starter hint was not enough
pt_br: A dica de principiante não foi suficiente

source: If someone could split the (n-1) pairs of disks beforehand, could you split the remaining pair?
pt_br: Se alguém puder dividir os (n-1) pares de discos previamente, você poderia dividir o par restante?

source: You need to be more explicit
pt_br: Você precisa ser mais explícito

source: First split the first (n-1) pairs of disks from the interleaved stack into a white tower and a black tower (calling recursively your main function).
pt_br: Primeiro divida os primeiros (n-1) pares de discos da pilha intercalada em uma torre branca e uma torre preta (chamando recursivamente sua função principal).

source: Then move the large white disk on its target pole.
pt_br: Então mova o disco branco grande para sua vara objetivo.

source: Then move the (n-1) smaller white disks on top of the large one.
pt_br: Então mova os (n-1) discos brancos menores para o topo do maior.

source: Then move the large black disk on its target pole.
pt_br: Então mova o disco preto grande para sua vara objetivo.

source: Then move the smaller black disks in position.
pt_br: Então mova os discos pretos pequenos para a posição.

source: Again, our previous solution is working, but it is far from being optimal. When moving the towers, we use the algorithm for 3 pegs even if we have 4 pegs. Of course, movements to the last peg are restricted since it contains the other stack, but we can always store the smallest disk on top of the other stack before moving our stack.
pt_br: Novamente, nossas soluções anteriores funcionam, mas estão longe de serem ótimas. Quando movemos as torres, usamos o algoritmo de 3 varas mesmo quando temos 4 varas. Obviamente, movimentos para a última vara são restritos pois ela contém a outra pilha, mas podemos sempre armazenar o menor disco no topo da outra pilha antes de mover nossa pilha.

source: For that, we need to devise a new function <code>hanoi_fast(height, src, free, full, dst)</code> that moves the stack from <code>src</code> to <code>dst</code> using <code>free</code>, but storing the smallest disk onto <code>full</code> beforehand.
pt_br: Para isto, nós precisamos criar uma nova função <code>hanoi_fast(height, src, free, full, dst)</code> que move a pilha de <code>src</code> para <code>dst</code> usando <code>free</code>, mas armazenando o menor disco em <code>full</code> antes.

source: I'm lost
pt_br: Estou perdido

source: The <code>hanoi_fast(height, src, free, full, dst)</code> function is not recursive. It moves the first disk and then call the regular <code>hanoi()</code> function.
pt_br: A função <code>hanoi_fast(height, src, free, full, dst)</code> não é recursiva. Ela move o primeiro disco e então chama a função regular <code>hanoi()</code>.

source: This change greatly improve the performance, as you can see below. Of course, this trick could also be used for the interleaved algorithm, leading as expected to the exact same performance.
pt_br: Esta mudança melhora enormemente a eficiência, como você pode ver abaixo. Obviamente, este truque também pode ser usado para o algoritmo intercalado, levando, como esperado, a exatamente a mesma eficiência.

source: 46 moves
pt_br: 46 movimentos

source: 82 moves
pt_br: 82 movimentos

source: 150 moves
pt_br: 150 movimentos

source: As a conclusion, most of us are satisfied with a working solution and we easily overlook possibilities to improve the problem decomposition. <b>You</b> should not do that ;)
pt_br: Como uma conclusão, a maioria das pessoas se satisfaz com uma solução que funcione e rapidamente ignora possibilidades para melhorar a decomposição do problema. <b>Você</b> não deve fazer isto ;)

source: This is a classical variation over the Towers of Hanoi where some moves are forbidden. Specifically, disks cannot move directly between the left-most and the right-most pegs. The middle peg must be involved in every moves.
pt_br: Esta é uma variação clássica das Torres de Hanoi onde alguns movimentos são proibidos. Especificamente, os disco não podem ser movidos diretamente da vara mais à esquerda para a vara mais a direita. A vara do meio deve ser envolvida em cada movimento.

source: Beside of that extra complexity, the problem remains unchanged: you are requested to move the whole stack of disks from one extremity peg to the other one. You can only move one disk at a time, and a bigger disk cannot be placed over a smaller one.
pt_br: Apesar desta complexidade, o problema permanece o mesmo: você tem que mover toda a pilha de discos da vara numa extremidade para a vara na outra extremidade. Você só pode mover um disco por vez, e um disco não pode ficar sobre outro menor.

source: As with the classical version, it is much easier to produce a recursive solution, and you are absolutely able to devise this solution if you think hard enough about it.
pt_br: Como na versão clássica, é muito fácil produzir uma solução recursiva, e você é totalmente capaz de "devise" esta solução se você pensar com atenção nela.

source: I tried, but I don't get it
pt_br: Tentei, mas não consegui

source: The standard recursive algorithm for classical Hanoi is of complexity <i>2^n-1</i> where the standard recursive algorithm for this variation is of complexity <i>3^n-1</i>.
pt_br: O algortimo recursivo padrão para as torres de Hanoi clássicas é de complexidade <i>2^n-1</i> enquanto que o algoritmo recursivo padrão para esta variação é de complexidade <i>3^n-1</i>.

source: That first tip was not enough
pt_br: A primeira dica não foi suficiente

source: The standard recursive algorithm for classical Hanoi involves two recursive calls sandwiching one movement of the largest disk, the standard recursive algorithm for Linear Hanoi involves three recursive calls sandwiched around two movements of the same disk.
pt_br: A algoritmo recursivo padrão para as torres de Hanoi clássicas envolve duas chamadas recursivas sanduichando um movimento do disco maior, O algoritmo recursivo padrão para Hanoi Linear envolve três chamadas recursivas sanduichando dois movimentos do mesmo disco.

source: Linear Twin Towers of Hanoi
pt_br: Torres gêmeas de Hanoi Lineares

source: This is a mix between both the Split and Interleaved problems, and the linear problem. We are given two stacks of disks, on three pegs. We are expected to swap the stacks' position while respecting the classical Hanoi movement restrictions (one disk at a time, and no large disk over smaller disks) and the linear movement restriction (no direct exchange between the left-most and right-most pegs).
pt_br: Esta é uma mistura entre os problemas "Split", Intercalado e linear. Temos duas pilhas de discos, em três varas. Devemos trocar a posição das pilhas respeitando as restrições clássicas de movimento (um disco por vez, disco grande não pode ficar sobre disco pequeno) e a restrição do movimento linear (proibido mudança diretamente da vara mais à esquerda para a vara mais à direita).

source: You will use three recursive functions:
pt_br: Você vai usar três funções recursivas:

source: <b>moveDouble(k,from, to)</b>: moves an interleaved stack of k pairs of disks, without changing the relative positions of disks of the same size. As in the Split Hanoi problem, an interleaved stack alternates white and black disks of each sizes. This function is not completely new: you wrote a version with 4 pegs (but using only 3 of them) for the first version of the Split Hanoi problem.
pt_br: <b>moveDouble(k,from, to)</b>: move uma pilha intercalada de k pares de discos, sem mudar as posições relativas dos discos de mesmo tamanho. Como no problema de hanoi "Split", uma pilha intercalada alterna discos brancos e pretos de cada tamanho. Esta função não é completamente nova: você escreveu uma versão com 4 varas (mas usando apenas 3 delas) para a primeira versão do problema de hanoi "split".

source: <b>gather(k)</b>: from the initial split situation, build on peg #2 an interleaved stack of k pairs of disks. You may parametrize your function so that it can be used to gather the disk on any peg passed as parameter, but in practice, your function will only be used to gather on the last peg.
pt_br: <b>gather(k)</b>: da situação inicial do caso "separado", constroi na vara #2 uma pilha intercalada de k pares de discos. Você pode parametrizar sua função de forma que ela possa ser usada para obter o disco de qualquer vara passado como parâmetro, mas na prática, sua função vai apenas ser usada para obter na última vara.

source: <b>scatter(k)</b>: from a situation where k pairs of disks are interleaved on peg #0, split it down by moving the white disks to peg #1 and black ones to peg #2.
pt_br: <b>scatter(k)</b>: de uma situação onde k pares de discos são intercalados na vara #0, separe eles movendo os discos brancos para a vara #1 e os pretos para a vara #2.

source: In <code>gather()</code>, the recursive call comes before two calls to <code>moveDouble()</code> while in <code>scatter()</code>, the calls to <code>moveDouble()</code> come before the recursive call. The main function that you should write is not recursive, but simply gather almost all disks, moves directly the remaining disks, and then scatters back the small disks.
pt_br: Em <code>gather()</code>, a chamada recursiva vem antes das duas chamadas a <code>moveDouble()</code> enquanto em <code>scatter()</code>, as chamadas para <code>moveDouble()</code> vem depois da chamada recursiva. A função principal que você deve escrever não é recursiva, mas simplesmente obtem quase todos os discos, move os discos restantes diretamente, e então espalha ("scatters") de volta os discos menores.

source: The linearity naturally induces some extra complexity as you have to decompose every move between pegs 0 and 2. I am still confident in your ability to overcome the challenge :)
pt_br: A linearidade naturalmente induz alguma complexidade extra pois você tem que decompor cada movimento entre as varas 0 e 2. Eu ainda estou confiante na sua capacidade de vencer este desafio :)

source: Note that the requested algorithm was proved optimal for that problem, so you don't need to fiddle the performance this time.
pt_br: Observe que foi provado que o algoritmo requerido é ótimo para este problema, então você não precisa "fiddle" a performance desta vez.

source: Tricolor Hanoi: stack move
pt_br: Hanoi de tricolor: movimentação de pilhas

source: In this set of exercises, we will devise an algorithm for the Tricolor Hanoi problem. There will be 3 stacks on 3 pegs, each stack of a differing color, and the problem is to exchange the stacks' positions under the classical move rules (one disk at a time, and no bigger disk over smaller disk).
pt_br: Neste conjunto de exercícios, vamos "devise" um algoritmo para o problema de Hanoi Tricolor. vão existir 3 pilhas em 3 varas, cada pilha de uma cor diferente, e o problema é alternar a posição das pilhas seguindos as regras clássicas do movimento (um disco por vez, disco grande não pode ficar sobre disco pequeno).

source: As in previous exercises, our solution will use three functions:
pt_br: Como nos exercícios anteriores, nossa solução vai usar três funções:

source: <code>move3(n, src, mid, dst)</code>: moves a stack of interleaved disks, ie a stack of (n*3) disks of alternating colors from peg <code>src</code> to peg <code>dst</code>.
pt_br: <code>move3(n, src, mid, dst)</code>: move uma pilha de discos intercalados, ie uma pilha de (n*3) discos de cores alternadas de uma vara <code>src</code> para uma vara <code>dst</code>.

source: <code>gather()</code>: builds an interleaved stack from the regular split ones.
pt_br: <code>gather()</code>: constrói uma pilha intercalada a partir de três pilhas "split".

source: <code>scatter()</code>: splits an interleaved stack into several regular ones.
pt_br: <code>scatter()</code>: separa uma pilha intercalada em três pilhas normais.

source: The goal of this first exercise in the series is to devise the <code>move3()</code> function. This starter task should not block you for too long, actually. It is ok if your function changes the order of the bottom triplet of disks, but it must preserve the order of the other triplets.
pt_br: O objetivo deste primeiro exercício na série é "devise" a função <code>move3()</code>. Esta tarefa inicial não deve segurar você muito, na verdade. Tudo bem se sua função muda a ordem do trio de discos mais no fundo, mas ela deve preservar a ordem dos outros trios.

source: It is now time to write the second function required by the Tricolor Hanoi problem. <code>gather()</code> builds an interleaved stack from the regular split ones. This function takes four arguments, the last one being the target peg where the interleaved stack must be assembled. As you can see in the examples, the colors of must be in the same order for each triplet of disks.
pt_br: Agora é a hora de escrever a segunda função necessária para o problema de Hanoi Tricolor. <code>gather()</code> constroi uma pilha intercalada a partir de pilhas "split". Esta função recebe quatro argumentos, o último sendo a vara destino onde a pilha intercalada deve ser montada. Como você pode ver nos exemplos, as cores devem estar na mesma ordem para cada trio de discos.

source: That function actually uses the <code>move3()</code> that you wrote just before. Simply copy/paste your code over to reuse it. If you're lost, please refer to the Interleaved Hanoi exercise. Gathering 3 stacks on 3 pegs is rather similar to gathering 2 stacks on 4 pegs. You can find that exercise <a href="plm://lessons.recursion.hanoi/InterleavedHanoi">here</a>.
pt_br: Esta função na verdade usa o <code>move3()</code> que você escreveu agora a pouco. Simplesmente copie-e-cole seu código e reuse ele. Se estiver perdido, favor olhe o exercício Hanoi Intercalada. Obter 3 pilhas em 3 varas é muito similar a obter 2 pilhas em 4 varas. Você pode encontrar este exercício <a href="plm://lessons.recursion.hanoi/InterleavedHanoi">aqui</a>.

source: Tricolor Hanoi: the Final
pt_br: Hanoi Tricolor: o Final

source: We are almost ready to write the whole tricolor algorithm. We just need the <code>scatter()</code> function, very inspired from the first one that we wrote for the <a href="plm://lessons.recursion.hanoi/SplitHanoi1">Split Hanoi problem</a>. Assuming that your interleaved stack is placed on the <code>mid</code> peg, spread the disks over all pegs. Make sure to use <code>move3()</code> an even amount of time at each recursive level to ensure that the bottom disks are in the correct order.
pt_br: Estamos quase prontos para escrever o algoritmo tricolor. Precisamos apenas da função <code>scatter()</code>, bastante inspirada na primeira que escrevemos para o <a href="plm://lessons.recursion.hanoi/SplitHanoi1">problema de Hanoi Separado</a>. Assumindo que sua pilha intercalada esteja na vara do <code>meio</code>, espalhe os discos por todas as varas. Certifique-se de usar <code>move3()</code> uma quantidade par de vezes em cada nível recursivo para garantir que os discos de baixo estejam na ordem correta.

source: As you can see, the initial situation is not the one expected by <code>scatter()</code>. You first have to apply <code>gather()</code> and <code>move3()</code> (twice to get the bottom triplet in the right order). These few steps plus the new <code>scatter()</code> function are enough to entirely solve the Tricolor Hanoi problem.
pt_br: Como você pode ver, a situação inicial não é a esperada por <code>scatter()</code>. Primeiro você tem que aplicar <code>gather()</code> e <code>move3()</code> (duas vezes para colocar o trio do fundo na ordem correta). Estes poucos passos mais a nova função <code>scatter()</code> são o suficiente para resolver inteiramente o problema de Hanoi Tricolor.

source: Cyclic Towers of Hanoi
pt_br: Torres de Hanoi cíclicas

source: This variation of the Towers of Hanoi is very similar to the regular problem: you are given one stack of disks and three pegs, and you cannot move a larger disk over a smaller one. The change is that you can only move disks clockwise: 0->1 or 1->2 or 2->0, but never in the other direction.
pt_br: Esta variação das torres de Hanoi é muito similar ao problema normal: você recebe uma pilha de discos e três varas, e você não pode mover um disco maior sobre um menor. A diferença é que você só pode mover discos no sentido horário: 0->1 ou 1->2 ou 2->0, mas nunca na outra direção.

source: Obviously, the movements are not symmetric anymore. Moves from A to B are now very different from moves to B to A. As a result, you need two recursive functions depending on whether you are moving the stack clockwise or counterclockwise.
pt_br: Obviamente, os movimentos não são simétricos de forma alguma. Movimentos de A para B são agora muito diferentes de movimentos de B para A. Como resultado, você precisa de duas funções recursivas dependendo de você estar movendo a pilha no sentido horário ou anti-horário.

source: That being said, the problem decomposition is very similar to the classical Hanoi. The twist is that each function call the other one, constituting a nice example of mutual recursion.
pt_br: Dito isto, a decomposição do problema é muito similar ao Hanoi clássico. A diferença é que cada função chama a outra, constituindo um bom exemplo de recursão mútua.

source: Iterative Towers of Hanoi
pt_br: Torres de Hanoi Iterativas

source: In this last exercise of the series, we will implement an iterative algorithm for the base problem of the Towers of Hanoi (one stack, 3 pegs, no extra movement restriction).
pt_br: Neste último exercício da série, vamos implementar um algoritmo iterativo para o problema básico das Torres de hanoi (uma pilha, 3 varas, sem restrição extra de movimento).

source: This algorithm is actually very simple: On odd moves, the smallest disk is moved in a given direction (either increasing 0-&gt;1-&gt;2-&gt;0 or decreasing 2-&lt;1-&lt;0-&lt;2) while on even moves, the only possible move that does not imply the smallest disk is made. You stop as soon as the stack is rebuilt on another location.
pt_br: Este algoritmo é na verdade bastante simples: em movimentos ímpares, o disco menor é movido numa dada direção (tanto aumentando 0-&gt;1-&gt;2-&gt;0 ou diminuindo 2-&lt;1-&lt;0-&lt;2) enquanto em movimentos pares, o único movimento possível que não usa o disco menor é feito. Você pára assim que a pilha é reconstruída em outra localização.

source: The function that you now need to write takes two parameters: the initial position of the smallest disk (i.e., the peg initially containing the stack) and a boolean indicating whether the smallest disk should move in the increasing order or not.
pt_br: A função que você precisa escrever agora tem dois parâmetros: a posição inicial do disco menor (i.e., a vara inicialmente contendo a pilha) e um booleano indicando se o disco menor deve mover na ordem de aumento ou não.

source: The simplicity of this algorithm is actually almost deceiving. One could wonder on the interest of the recursive algorithms when such a simple iterative algorithm exists. My personal feeling is that this solution is nice to execute, but almost impossible to devise in the first place (I even suspect that the authors built this iterative solution from observations of the recursive execution)...
pt_br: A simplicidade deste algoritmo é na verdade enganosa. Podemos nos perguntar sobre o interesse em algoritmos recursivos quando algoritmos iterativos tão simples existem. Minha impressão é que esta solução é boa de executar, mas quase impossível de se descobrir a princípio (eu suspeito, inclusive, que os autores construíram esta solução iterativa da observação da execução da solução recursiva)...

source: An interesting question is whether such simple iterative algorithms exist for the other variation of the problem. Some were given in the literature (e.g. for the cyclic variation). I would happily integrate your solutions to the PLM, especially if you can hint (without spoiling) the solution to guide the next ones.
pt_br: Uma questão interessante é se tais algoritmos simples existem para a outra variante do problema. Alguns estão na literatura (e.g. para a variante cíclica). Eu integraria alegramente suas soluções no PLM, especialmente se você puder dar uma dica (sem estragar a surpresa) da solução para guiar as outras pessoas.

source: This world implements the ultra-classical Hanoi problem. You are asked to move the disk pile from the stick where they are to the target stick (given as second parameter in the world's name -- number 1 for the default world). There is some extra constraint: you can only move one disk at a time, and you cannot move a big disk over a smaller one.
pt_br: Este mundo implementa o problema ultra-clássico das torres de hanoi. Você deve mover a pilha de discos da pilha onde eles estão para outra pilha (dado um segundo parâmetro no nome do mundo -- número 1 para o mundo padrão). Existem algumas restrições extras: você pode mover apenas um disco por vez, e não pode colocar um disco sobre um menor.

source: Only 4 functions are provided:
pt_br: Apenas 4 funções são fornecidas:

source: [!java|c]void [/!]move([!java|c]int [/!]src, [!java|c]int [/!]dst)
pt_br: [!java|c]void [/!]mover([!java|c]int [/!]src, [!java|c]int [/!]dst)

source: Moves one disk from the stick <code>src</code> onto the stick <code>dst</code>. If you try to do an invalid move (like laying a disk over a smaller one), an IllegalArgumentException is thrown.
pt_br: Move um disco de uma vara <code>src</code> para a vara <code>dst</code>. Se você tentar fazer um movimento inválido (como colocar um disco sobre outro menor), uma IllegalArgumentException é levantada.

source: [!java|c]int [/!]getSlotSize([!java|c]int [/!]slot)[!scala]:Int[/!]
pt_br: [!java|c]int [/!]getTamanhoSlot([!java|c]int [/!]slot)[!scala]:Int[/!]

source: Returns the amount of disks placed on the specified slot. This is mainly used to initialize the recursion and set the amount of recursive call to execute.
pt_br: Retorna a quantidade de discos colocados num ponto específico. É usado principalmente para inicializar a recursão e ajustar a quantidade de chamadas recursivas para executar.

source: Returns the radius of the top-most disk of the specified slot.
pt_br: Retorna o raio do disco no topo da vara especificada.

source: Labyrinths
pt_br: Labirintos

source: This lesson proposes several exercises about labyrinths in the buggle world.
pt_br: Esta lição propõe vários exercícios sobre labirintos no mundo dos buggles.

source: The crazy mouse
pt_br: O rato doido

source: The day of your buggle starts badly. Out of luck, it got trapped into a maze. Help it finding its path out of there.
pt_br: O dia do seu buggle começou ruim. Sem sorte, ele ficou preso num labirinto. Ajude ele a encontrar o caminho para a saída.

source: The exit is represented by a baggle and you need to pick this baggle in order to exit the maze.
pt_br: A saída é representada por um baggle e você precisa pegar este baggle para sair do labirinto.

source: Since the maze is so small, we can write the dumbest possible algorithm to do so. It relies on randomness and proves quite inefficient.
pt_br: Como o labirinto é muito pequeno, vamos escrever o algoritmo mais bobo possível. Ele é aleatório e vai se mostrar bem ineficiente.
