Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: Well, we simply tested all possible situations to see when this algorithm loops and when it finds the correct solution. We found that it works for all situations where no player is at home (there is 84 such situations for 4 bases, once you take the symmetries into account). It obviously works for some situations that do not respect this criteria (such as all situations it encounters from one of those 84 boards to the final state), but that's another story. Having such a criteria allows us to generate pseudo-random initial situations for the first exercise for which the algorithm we propose is guarenteed to work.
pt_br: Bem, nós simplemente testamos todas as situações possíveis para ver quando este algoritmo entra em loop e quando ele acha a solução correta. Nós verificamos que ele funciona em todas as situaçoes onde nenhum jogador está em sua casa (existem 84 situações destas para 4 bases, levando em conta as simetrias). Ele obviamente funciona para algumas situações que não respeitam este critério (such as all situations it encounters from one of those 84 boards to the final state), mas isto é outra história. Dado tal critério podemos gerar situaões iniciais pseudo-aleatórias para o primeiro exercício para o qual o algoritmo que propomos com certeza funciona.

source: We also explored bigger instances of the problem, and unfortunately, we have no such criteria for them. With 5 bases, the algorithm wrongly loops for 24 of the 1824 possible boards where no player is home (that's 1.31%). With 6 bases, it fails on 1251 of the 58860 such boards (2.12%). With 7 bases, it fails for 84444 out of 2633940 (that's 3.2%). I am still looking for a criteria ensuring that the algorithm won't loop. If you discover one, please report it. Ideally, it would be simple to enforce manually so that we can use it during our unplugged activities.
pt_br: Também exploramos instâncias maiores do problema, e infelizmente, não temos tal critério para elas. Com 5 bases, o algoritmo entra em loop de forma errada para 24 dos 1824 possíveis tabuleiros onde nenhum jogador está na sua casa (que dá 1.31%). Com 6 bases, ele falha em 1251 dos 58860 tabuleiros (2.12%). Com 7 bases, ele falha para 84444 dos 2633940 (3.2%). Ainda estou procurando um critério que garanta que o algoritmo não vai entrar em loop. Se você descobrir um, por favor avise. Idealmente, deve ser simples garantir manualmente de forma que possamos usá-lo durante nossas atividades "unplugged".

source: Other graphical representations could be proposed, such as a linear one (for the existing exercises) or other ones (such as a grid or a tree, if an exercise on this kind of graph proves interesting).
pt_br: Outras representações gráficas podem ser propostas, tais como uma linear (para os exercícios existentes) ou outros (como um grid ou uma árvore, se um exercício neste tipo de grafo se mostrar interessante).

source: Other exercises on other algorithms on this variant, or on other variants such as the 15-puzzle.
pt_br: Outros exercícios em outros algoritmos desta variante, ou em outras variantes como o jogo do 15.

source: Rainbow baseball
pt_br: basebal multicores

source: This is another funny variation on the sorting problem, adapting the main sorting algorithms on an unusual context.
pt_br: Este é outra variação divertida do problema da ordenação, adaptando os pricipais algoritmos de ordenação num contexto inusitado.

source: The colors are represented by integers, between <code>0</code> and <code>amount of bases -1</code>. The hole is represented by the special value <code>-1</code>. The color of each base is its rank. So base <code>1</code> is of color <code>1</code>. In the graphical interface, the base <code>0</code> is the dark blue one while the base <code>1</code> is the fuscia one.
pt_br: As cores são representadas por inteiros, entre <code>0</code> e <code>quantidade de bases -1</code>. O espaço vazio é representado por um valor especial <code>-1</code>. A cor de cada base é seu rank. Logo, a base <code>1</code> é de cor <code>1</code>. Na interface gráfica, a base <code>0</code> é a azul escura enquanto que a base <code>1</code> é a fuscia.

source: Once every players on the field are in their home base, the hole should be in the last base, that is of rank <code>getBasesAmount()-1</code>.
pt_br: Uma vez que todos os jogadores no campo estejam em suas bases, o espaço vazio deve estar na última base, ou seja, a de rank <code>getBasesAmount()-1</code>.

source: Functions to retrieve the world's dimensions
pt_br: FFunções para recuperar as dimensões do mundo

source: [!java|c]int [/!]getBasesAmount() [!scala]:Int[/!]
pt_br: [!java|c]int [/!]getQuantidadeDeBases() [!scala]:Int[/!]

source: Returns the amount of bases on this field.
pt_br: Retorna a quantidade de bases neste campo.

source: [!java|c]int [/!]getPositionsAmount() [!scala]:Int[/!]
pt_br: [!java|c]int [/!]getQuantidadeDePosições() [!scala]:Int[/!]

source: Returns the amount of player's positions per base on this field.
pt_br: Retorna a quantidade de posições de jogadores por base neste campo.

source: Functions to retrieve the world's state
pt_br: Funções para recuperar o estado do mundo

source: Returns the base in which the hole is located.
pt_br: Retorna a base na qual o espaço vazio está localizado.

source: Returns the hole position within its base
pt_br: Retorna a posição do espaço vazio na sua base

source: [!java|c]int [/!]getPlayerColor([!java|c]int [/!]base[!scala]:Int[/!], [!java|c]int [/!]position[!scala]:Int[/!]) [!scala]:Int[/!]
pt_br: [!java|c]int [/!]getCorDoJogador([!java|c]int [/!]base[!scala]:Int[/!], [!java|c]int [/!]posição[!scala]:Int[/!]) [!scala]:Int[/!]

source: Returns the color of the player at a given location.
pt_br: Retorna a cor do jogador numa dada posição.

source: Returns whether all players of the field are at home.
pt_br: Retorna se todos os jogadores em campo estão em seus "home".

source: [!java]boolean [/!][!c]int [/!]isBaseSorted([!java|c]int [/!]base) [!scala]:Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]baseEstáOrdenada([!java|c]int [/!]base) [!scala]:Boolean[/!]

source: Returns whether all players of a given base are at home.
pt_br: Retorna se todos os jogadores de uma dada base estão em "home".

source: Functions to change the world
pt_br: Funções para mudar o mundo

source: [!java|c]void [/!]move([!java|c]int [/!]base[!scala]:Int[/!], [!java|c]int [/!]position[!scala]:Int[/!])
pt_br: [!java|c]void [/!]mover([!java|c]int [/!]base[!scala]:Int[/!], [!java|c]int [/!]posição[!scala]:Int[/!])

source: Moves a given player into the hole. This throws an IllegalArgumentException if the specified player is not near the hole (at most one base away).
pt_br: Move um dado jogador para um espaço vazio. Vai levantar uma IllegalArgumentException se o jogador especificado não estiver próximo do espaço vazio (no máximo a uma base de distância).

source: Naive Rainbow Baseball
pt_br: Basebal do arco-íris simples

source: Today, the buggles decided to play a baseball game, but they are rather out of luck, actually. First, kinda forgot the rules, and ... well ... they cannot find the ball and bats again. So they decided to "adapt a bit" the rules. As the are no ball, the buggles can only running around the field, what they do happily: for a while, all attending buggle run at full speed in all directions around the field.
pt_br: Hoje os buggles decidiram jogar um jogo de basebal, mas eles estão sem muita sorte, na verdade. Primeiro, eles esqueceram as regras, e... bem... eles não acharam as bolas e tacos de novo. Então eles decidiram adaptar um pouco as regras. Como eles não são bolas, tudo que podem fazer é correr ao redor do campo, o que fazem felizes da vida: Por um período, todos os buggles correram na máxima velocidade em todas as direções pelo campo.

source: But after a few collisions, they decide to invent new rules to organize a bit the game: They make one team per base and two players per team. One of the teams has only one player so that its base has an empty location. Then, the players are dispatched randomly around the bases, and the game for them is to reach their home base. The whole game stops when all players are home. There is no winning team: either all players win, or they all lose. Actually, this game is very different from the original baseball. The only rule that remains is that you can only run around the field, from one base to the next one, without crossing middle of the field.
pt_br: Mas depois de algumas colisões eles decidiram inventar novas regras para organizar o jogo um pouco: eles fizeram um time por base e dois jogadores por time. Um dos times tem apenas um jogador de forma que sua base tem uma vaga. Então, os jogadores são despachados aleatoriamente entre as bases, e o jogo para eles é encontrar sua base de origem. O jogo como um todo pára quando todos os jogadores estão em suas bases de origem. Não existe um time vencedor: ou todo mundo ganha ou todo mundo perde. Na verdade, este jogo é muito diferente do basebal original. A única regra que sobrou é que você só pode correr ao redor do campo, de uma base para a próxima, sem cruzar o meio do campo.

source: Now, they are asking you to help them deciding who and when should move so that each player returns to its base. Only one buggle can move at each round, from its position to the empty spot. The maximal distance that a buggle can cover in one round is of one base.
pt_br: Agora, eles estão pedindo a você que ajude eles a decidir quem deve se mover de forma que cada jogador retorne à sua base de origem. Apenas um buggle pode se mover por rodada, de sua posição para um espaço vazio. A distância máxima que um buggle pode percorrer em uma rodada é de uma base.

source: So, at each round, the empty spot is on one base (say <code>B</code>), and you should decide which buggle enters that empty spot. There is four candidates (two from base <code>B-1</code> and two from base <code>B+1</code>). Actually, there is a fifth candidate since the buggle that is on the same base than the empty spot can change its position, but that's not really helping.
pt_br: Logo, em cada turno, o espaço vazio fica em uma base (digamos <code>B</code>), e você deve decidir que buggle vai entrar neste espaço vazio. Existem quatro candidatos (dois de base <code>B-1</code> e dois da base <code>B+1</code>). Na verdade, existe um quinto candidato pois o buggle que está na mesma base que o espaço vazio pode mudar de posição, mas isto não ajuda muito.

source: The Naïve algorithm
pt_br: O algoritmo simplório

source: In this exercise, we will first explore a very simple algorithm. To decide which of the four candidate buggles should enter the empty spot, we first restrict ourselves and decide that buggles can only turn clockwise. Then, from the two remaining candidates, we pick the one that has the largest distance to cover to reach its base (turning clockwise). Click on the demo button: this works rather well in practice.
pt_br: Neste exercício, vamos primeiramente explorar um algoritmo muito simples. Para decidir qual dos quatro buggles candidatos deve entrar no espaço vazio, vamos primeiro nos restringir e decidir que os buggles só podem andar no sentido horário. Então, dos dois candidatos restantes, pegamos o que tem a maior distância a percorrer para alcançar sua base (no sentido horário). Clique no botão demo: isto funciona melhor na prática.

source: It's hard to find a simpler algorithm for this problem: While it's not sorted, search for the base containing the candidate buggles: if the hole is in base <code>B</code>, it's the base <code>B+1</code>, modulo the amount of bases. Then, compute the distance that each buggle of that base still has to run to reach its base (0 if it's already home). Once you found the buggle that should enter the empty spot, just use the <code>move</code> method on it, and iterate.
pt_br: É difícil encontrar um algoritmo simples para este problema: Como não está ordenado, busque pela base contendo os buggles candidatos: se o vazio estiver na base <code>B</code>, será a base <code>B+1</code>, módulo a quantidade de bases. Então, calcule a distância que cada buggle daquela base ainda tem que andar para atingir sua própria base (0 se já estiver na própria base). Uma vez que você encontra o buggle que deve entrar no vazio, simplesmente use o método <code>move</code> nele, e itere.

source: The main difficulty should be to get the few equations right: determining the base next to the hole should be easy, but determining the distance that a player has to cover may reveal a bit more challenging. Don't hesitate to draw pictures on a paper to cover all possible cases. It should not be that difficult either: there is not that many cases after all.
pt_br: A principal dificuldade deve ser obter corretamente as poucas equações: determinar a base próxima do espaço vazio deve ser fácil, mas determinar a distância que um jogador tem que cobrir pode se revelar um pouco desafiadora. Não hesite em desenhar esboços num papel para cobrir todas as possibilidades. Não vai ser tão difícil no final das contas: não existem tantos casos assim.

source: The previous algorithm is very pleasant: it's rather simple and rather fast to implement, but unfortunately, it is also rather wrong! In some cases, it never stops, which is obviously bad. If you don't believe it, just copy paste your previous code, and hit the run button. The first world of this exercise is one of these unfortunate situations that drives our previous algorithm crazy.
pt_br: O algoritmo anterior é muito agradável: ele é muito simples e muito rápido de implementar, mas infelizmente, ele é também bastante errado! Em alguns casos, ele nunca pára, o que é obviamente ruim. Se você não acredita, simplesmente copie e cole seu código anterior, e aperte no botão Rodar. O primeiro mundo deste exercício é uma destas situações infelizes que que deixam endoidam o algoritmo anterior.

source: So we have to find another algorithm, preferably one that works in all cases.
pt_br: Portanto temos que encontrar outro algoritmo, preferencialmente um que funcione em todos os casos.

source: For that, the best solution is to start from a well known algorithm instead of trying to invent a new one from scratch as we just did. When you think a bit about this problem, this can is very similar to a sorting problem: Just make sure that the players are sorted by their colors and you're set. And while we are at it, let's generalize the game to allow more that 4 bases.
pt_br: Para isto, a melhor solução é começar de um algoritmo bem conhecido ao invés de tentar inventar um novo do zero como nós fizemos. Quando você pensa um pouco sobre este problema, ele pode ser muito similar a um problema de ordenação: apenas se certifique de que todos os jogadores estão ordenados por suas cores. E enquanto fazemos isto, vamos generalizar o jogo para poder ter mais de 4 bases.

source: Let's adapt the selection sort to our situation. The big lines of the algorithm is then "for each base, select the players that should occupy this base and make sure that they come to their position". This way, we will grow an sorted area where all players are already sorted (and never changed) while the unsorted area shrinks.
pt_br: Vamos adaptar o selection sort para nossa situação. As linhas grandes do algoritmo se tornam "para cada base, selecione os jogadores que devem ocupar esta base e garanta que eles venham para as suas posições". Desta forma, vamos aumentar uma área ordenada onde todos os jogadores já estão ordenados (e nunca deixam de estar) enquanto a área não-ordenada se reduz.

source: Selecting the player should be no problem; Do not hesitate to define some methods such as <code>findPlayer()</code> or <code>findPlayerBase()</code>. This will ensure that your code remains understandable.
pt_br: Selecionar o jogador não deve ser um problema; Não hesite para definir alguns métodos como <code>findPlayer()</code> ou <code>findPlayerBase()</code>. Isto vai garantir que seu código permaneça entendível.

source: The most problematic aspect is to move the selected players into position. For that, you have to move the hole to the position where the player is, and then move both the player and the hole to the base that is next to the player's goal (probably in a loop), and finally put the player in the right position of its target base.
pt_br: O aspecto mais problemático é mover os jogadores selecionados para suas posições. Para isto, você tem que mover o espaço vazio para a posição onde o jogador está, e então mover ambos os jogadores e o espaço vazio para a base que estiver próxima do objetivo do jogador (provavelmente com um loop), e finalmente colocar o jogador na posição correta de sua base favorita.

source: As often in programming, the devil is in the details: there is a bunch of corner cases that you should detect and deal with correctly, such as the cases where the player is already in the base (but not in the position that you would like), or when the hole is on the right of the player (probably when you sort the first base). But you will find and hunt these while debugging your code.
pt_br: Como é comum em programação, o diabo esconde-se nos detalhes: existe um conjunto de casos particulares que você deve detectar e lidar corretamente, como os casos onde o jogador já está na base (mas não na posição que você gostaria), ou quando o buraco está à direita do jogador (provavelmente quando você ordena a primeira base). Mas você vai caçar tais coisas enquanto depurar seu código.

source: The good point of adapting the selection sort to the baseball problem is that we know that it works (provided that our adaptation is correct). That's much better than the first naive algorithm, that was unable to converge to the solution in some situations. But actually, the selection sort is not perfect either as it requires a lot of swaps: we have to bring the hole to the selected player and then both the player and hole in position, and more. We can do better.
pt_br: O aspecto bom de adaptar o selection sort para o problema do basebal é que nós sabemos que isto funciona (desde que nossa adaptação esteja correta). O que é muito melhor que o nosso primeiro e simplório algoritmo, que é incapaz de convergir para a solução em algumas situações. Mas na verdade, o selection sort também não é perfeito pois ele requer muitas trocas: nós temos que trazer o espaço vazio para e jogador selecionado e então levar o jogador e o espaço vazio para a posição, e mais. Podemos fazer melhor.

source: For example, each player can run quite a long way from its initial position to its target solution. Instead, it may be more interesting to split the field in two parts: one on the left where all players are sorted relatively to each others, and one on the right where the players are still at their initial positions. Then, at each iteration, we take the player at the border between the sorted and unsorted areas (that is, the left-most player of the unsorted area) and move it to the left (within the sorted area) until it reaches its position (that is, until the position where it's bigger that its left neighbor). This would at least reduce the travel of players to the sorted area as we use the first one on the border.
pt_br: Por exemplo, cada jogador pode correr por uma longa distância de sua posição inicial para o objetivo. Portanto, pode ser mais interessante dividir o campo em duas partes: uma à esquerda onde todos os jogadores estejam ordenados relativamente uns aos outros, e outra a direita onde os jogadores ainda estejam em suas posições iniciais. Então, em cada iteração, pegaremos o jogador na fronteira entre as áreas ordenada e não-ordenada (ou sejam o jogador mais a esquerda da parte não-ordenada) e moveremos ele para a esquerda (dentro da parte ordenada) até que ele alcance sua posição (ou seja, até a posição onde ele seja maior que seu vizinho da esquerda). Isto pode, pelo menos, reduzir o trajeto dos jogadores para a área ordenada já que usamos o mais perto da fronteira.

source: Actually, that's exactly what an insertion sort would do: maintain a sorted area on the left, and put iteratively the player on the border to its position within the sorted area. This is good, as we know that our algorithm is not inherently flawed since we adapt a well known one.
pt_br: Na verdade, é exatamente isto que o insertion sort deve fazer: manter uma área ordenada na esquerda, e colocar iterativamente o jogador na fronteira com esta posição dentro da área ordenada. Isto é bom, já que nós sabemos que nosso algoritmo não é inerentemente "flawed" pois nós adaptamos um algoritmo bem conhecido.

source: The easiest to adapt the insertion sort to the baseball problem is to consider all positions as adjacent and forget about bases. For that, we define the methods <code>getColor[!c]Insert[/!](pos)</code>, <code>move[!c]Insert[/!](pos)</code> and <code>getHole[!c]Insert[/!]()</code> that all use a unique integer to designate a given position. These functions simply convert between the way to specify a position and then call the usual functions to interact with the world. If you have an <code>index</code> and want to convert it into a <code>base,pos</code>, then <code>base=index/2</code> and <code>pos=index%2</code>. To compute the reverse, <code>index=base*2+pos</code> (this works because <code>getPositionsAmount()</code> always returns 2).
pt_br: A forma mais fácil de adaptar o insertion sort ao problema do basebal é considerar todas as posições como adjacentes e esquecer sobre as bases. Para isto, definimos os métodos <code>getColor[!c]Insert[/!](pos)</code>, <code>move[!c]Insert[/!](pos)</code> e <code>getHole[!c]Insert[/!]()</code> que usam, todos, um único inteiro para designar uma dada posição. Estas funções simplesmente convertem a forma de especificar uma posição para em seguida chamar as funções usuais para interagir com o mundo. Se você tem um <code>index</code> e quer converter ele em <code>base,pos</code>, para então em <code>base=index/2</code> e <code>pos=index%2</code>. Para calcular o reverso, <code>index=base*2+pos</code> (isto funciona pois <code>getPositionsAmount()</code> sempre retorna 2).

source: For the algorithm itself, you should first move the hole to the position 1. The position 0 is considered to be the sorted area (of size 1 for now) while the area above 2 is the unsorted area. Then comes an iteration to sort each element of the unsorted area. Since this iteration is a bit complex, you should think of its loop invariant, that is, the condition that is true before and after the loop and which explains that the loop fulfills its goal. Here, the loop invariant is twofold: First, the hole is between the sorted area and the unsorted area, and then, the every elements of the sorted area are ... well sorted relatively to their neighbors.
pt_br: Para o algoritmo em si, você deve primeiro mover o espaço vazio para a posição 1. A posição 0 é considerada como a área ordenada (de tamanho 1 por enquanto) enquanto que a área acima de 2 é a área não-ordenada. Então fazemos uma iteração para ordenar cada elemento da área não-ordenada. Já que esta iteração é um pouco complexa, você deve pensar em seu invariante do loop, ou seja, a condição que é verdadeira antes e depois do loop e que explica que o loop satisfaz seu objetivo. Aqui, o o invariante do loop é duplo: Primeiro, o espaço vazio está entre a área ordenada e a não-ordenada is between the sorted area and the unsorted area, and then, the every elements of the sorted area are ... well sorted relatively to their neighbors.
