Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: This world was invented by Lyn Turbak, at Wellesley College. It is full of Buggles, little animals understanding simple orders, and offers numerous possibilities of interaction with the world: taking or dropping objects, paint the ground, hit walls, etc.
pt_br: Este mundo foi inventado por Lyn Turbak, na Wellesley College. Ele é cheio de Buggles, pequenos animais que entendem ordens simples, e oferece numerosas possiblidades de interação com o mundo: pegar e soltas objetos, pintar o chão, bater em paredes, etc.

source: Methods understood by buggles
pt_br: Métodos que os buggles entendem

source: <b>Moving</b>
pt_br: <b>Se movendo</b>

source: (See also the note on exceptions, below)
pt_br: (Veja também a nota sobre exceções, abaixo)

source: <b>Turn left
pt_br: <b>Virar à esquerda

source: Turn right
pt_br: Virar à direita

source: Turn back
pt_br: Dar meia volta

source: Moving forward
pt_br: Mover para a frente

source: Moving back</b>
pt_br: Mover para trás</b>

source: [!java|c]void [/!]left()
pt_br: [!java|c]void [/!]esquerda()

source: [!java|c]void [/!]right()
pt_br: [!java|c]void [/!]direita()

source: [!java|c]void [/!]back()
pt_br: [!java|c]void [/!]voltar()

source: [!java|c]void [/!][!python|java|scala]forward()[/!][!c]stepForward()[/!] or [!java|c]void [/!]forward([!java|c]int [/!]steps[!scala]:Int[/!])
pt_br: [!java|c]void [/!][!python|java|scala]avançar()[/!][!c]avançarUmPasso()[/!] ou [!java|c]void [/!]avançar([!java|c]int [/!]passos[!scala]:Int[/!])

source: [!java|c]void [/!][!python|java|scala]backward()[/!][!c]stepBackward()[/!] or [!java]void [/!]backward([!java|c]int [/!]steps[!scala]:Int[/!])
pt_br: [!java|c]void [/!][!python|java|scala]recuar()[/!][!c]recuarUmPasso()[/!] ou [!java]void [/!]recuar([!java|c]int [/!]passos[!scala]:Int[/!])

source: <b>Get X coordinate
pt_br: <b>Obter coordenada X

source: Get Y coordinate
pt_br: Obter coordenada Y

source: Set X coordinate
pt_br: Ajustar coordenada X

source: Set Y coordinate
pt_br: Ajustar coordenada Y

source: Set position</b>
pt_br: Ajustar posição</b>

source: Note that the point (0,0) is on the top left corner, as it is often the case in Computer Science.
pt_br: Observe que o ponto (0,0) está no canto superior esquerdo, o que é comum em ciência da computação.

source: <b>Information on the buggle</b>
pt_br: <b>Informações sobre o buggle</b>

source: <b>Get the color of the body
pt_br: <b>Obter a cor do corpo

source: Set the color of the body</b>
pt_br: Ajustar a cor do corpo</b>

source: [!java|c]Color [/!]getBodyColor()[!scala]:Color[/!]
pt_br: [!java|c]Color [/!]getCorDoCorpo()[!scala]:Cor[/!]

source: [!java|c]void [/!]setBodyColor([!java|c]Color [/!]c[!scala]:Color[/!])
pt_br: [!java|c]void [/!]setCorDoCorpo([!java|c]Cor [/!]c[!scala]:Cor[/!])

source: <b>Look for a wall forward
pt_br: <b>Procura por uma parede à frente

source: Look for a wall backward</b>
pt_br: Procura por uma parede atrás</b>

source: [!java]boolean [/!][!c]int [/!]isFacingWall()[!scala]:Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]estáDeFrenteParaParede()[!scala]:Boolean[/!]

source: [!java]boolean [/!][!c]int [/!]isBackingWall()[!scala]:Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]estáDeCostasParaParede()[!scala]:Boolean[/!]

source: <b>Get heading
pt_br: <b>Obter direção

source: Set heading</b>
pt_br: Ajustar direção</b>

source: valid directions are:
pt_br: direções válidas são:

source: [!java|c]Direction [/!]getDirection()[!scala]:Direction[/!]
pt_br: [!java|c]Direção [/!]getDireção()[!scala]:Direção[/!]

source: [!java|c]void [/!]setDirection([!java|c]Direction [/!]dir[!scala]:Direction[/!])
pt_br: [!java|c]void [/!]ajustaDireção([!java|c]Direção [/!]dir[!scala]:Direção[/!])

source: [!scala|java|python]Direction.[/!]NORTH, [!scala|java|python]Direction.[/!]EAST, [!scala|java|python]Direction.[/!]SOUTH and [!scala|java|python]Direction.[/!]WEST
pt_br: [!scala|java|python]Direção.[/!]NORTE, [!scala|java|python]Direção.[/!]LESTE, [!scala|java|python]Direção.[/!]SUL e [!scala|java|python]Direção.[/!]OESTE

source: Check whether the buggle is currently <b>selected in the interface</b>
pt_br: Verifica se o buggle está atualmente <b>selecionado na interface</b>

source: [!java]boolean [/!][!c]int [/!]isSelected()[!scala]:Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]estáSelecionado()[!scala]:Boolean[/!]

source: <b>About the brush</b>
pt_br: <b>Sobre o pincel</b>

source: <b>Brush down
pt_br: <b>Abaixar pincel

source: Brush up
pt_br: Levantar pincel

source: Get brush position</b>
pt_br: Pegar a posição do pincel

source: [!java|c]void [/!]brushUp()
pt_br: [!java|c]void [/!]levantarPincel()

source: [!java|c]void [/!]brushDown()
pt_br: [!java|c]void [/!]abaixarPincel()

source: [!java]boolean [/!][!c]int [/!]isBrushDown()[!scala]:Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]pincelEstáAbaixado()[!scala]:Boolean[/!]

source: <b>Change the brush color
pt_br: <b>Muda a cor do pincel

source: Get the color of the brush</b>
pt_br: Obtém a cor do pincel</b>

source: [!java|c]void [/!]setBrushColor([!java|c]Color [/!]c[!scala]:Color[/!])
pt_br: [!java|c]void [/!]setCorDoPincel([!java|c]Color [/!]c[!scala]:Color[/!])

source: [!java|c]Color [/!]getBrushColor()[!scala]:Color[/!]
pt_br: [!java|c]Color [/!]getCorDoPincel()[!scala]:Color[/!]

source: <b>Interacting with the world</b>
pt_br: <b>Interagindo com o mundo</b>

source: <b>Get the color of the ground</b>
pt_br: <b>Obtém a cor do chão</b>

source: [!java|c]Color [/!]getGroundColor()[!scala]:Color[/!]
pt_br: [!java|c]Color [/!]getCorDoChão()[!scala]:Color[/!]

source: <b>Look for a baggle on the ground
pt_br: <b>Procura por um "baggle" no chão

source: Look for a baggle in bag
pt_br: Procura por um "baggle" na bolsa

source: Pickup a baggle
pt_br: Pega um "baggle"

source: Drop a baggle</b>
pt_br: Solta um "baggle"</b>

source: (see the note on exceptions)
pt_br: (veja a nota sobre exceções)

source: [!java]boolean [/!][!c]int [/!]isOverBaggle()[!scala]:Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]estáSobreBaggle()[!scala]:Boolean[/!]

source: [!java]boolean [/!][!c]int [/!]isCarryingBaggle()[!scala]:Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]estáCarregandoBaggle()[!scala]:Boolean[/!]

source: [!java]void [/!]pickupBaggle()
pt_br: [!java]void [/!]pegarBaggle()

source: [!java]void [/!]dropBaggle()
pt_br: [!java]void [/!]soltarBaggle()

source: <b>Look for a message
pt_br: <b>Procura por uma mensagem

source: Add a message
pt_br: Adiciona uma mensagem

source: Read the message
pt_br: Lê a mensagem

source: Erase the message</b>
pt_br: Apaga a mensagem</b>

source: [!java]boolean [/!][!c]int [/!]isOverMessage()[!scala]:Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]estáSobreMensagem()[!scala]:Boolean[/!]

source: [!java]void [/!]writeMessage([!java]String [/!][!c]char* [/!]msg[!scala]:String[/!])
pt_br: [!java]void [/!]escreverMensagem([!java]String [/!][!c]char* [/!]msg[!scala]:String[/!])

source: [!java]String [/!][!c]char* [/!]readMessage()[!scala]:String[/!]
pt_br: [!java]String [/!][!c]char* [/!]lerMensagem()[!scala]:String[/!]

source: [!java]void [/!]clearMessage()
pt_br: [!java]void [/!]limparMensagem()

source: Valid colors
pt_br: Cores válidas

source: Name
pt_br: Nome

source: Color
pt_br: Cor

source: [!scala|java|python]Color.[/!]black
pt_br: [!scala|java|python]Cor.[/!]black

source: [!scala|java|python]Color.[/!]blue
pt_br: [!scala|java|python]Cor.[/!]azul

source: [!scala|java|python]Color.[/!]cyan
pt_br: [!scala|java|python]Cor.[/!]ciano

source: [!scala|java|python]Color.[/!]darkGray
pt_br: [!scala|java|python]Cor.[/!]cinzaEscuro

source: [!scala|java|python]Color.[/!]gray
pt_br: [!scala|java|python]Cor.[/!]cinza

source: [!scala|java|python]Color.[/!]green
pt_br: [!scala|java|python]Cor.[/!]verde

source: [!scala|java|python]Color.[/!]lightGray
pt_br: [!scala|java|python]Cor.[/!]cinzaClaro

source: [!scala|java|python]Color.[/!]magenta
pt_br: [!scala|java|python]Cor.[/!]magenta

source: [!scala|java|python]Color.[/!]orange
pt_br: [!scala|java|python]Cor.[/!]laranja

source: [!scala|java|python]Color.[/!]pink
pt_br: [!scala|java|python]Cor.[/!]rosa

source: [!scala|java|python]Color.[/!]red
pt_br: [!scala|java|python]Cor.[/!]vermelho

source: [!scala|java|python]Color.[/!]white
pt_br: [!scala|java|python]Cor.[/!]branco

source: [!scala|java|python]Color.[/!]yellow
pt_br: [!scala|java|python]Cor.[/!]amarelo

source: Note on exceptions
pt_br: Nota sobre exceções

source: Regular buggles throw a BuggleWallException exception if you ask them to traverse a wall. They throw a NoBaggleUnderBuggleException exception if you ask them to pickup a baggle from an empty cell, or a AlreadyHaveBaggleException exception if they already carry a baggle. Trying to drop a baggle on a cell already containing one throws an AlreadyHaveBaggleException exception. Dropping a baggle when you have none throws a DontHaveBaggleException.
pt_br: Buggles normais lançam uma exceção BuggleWallException se você pede para eles atravessarem uma parede. Eles lançam uma exceção NoBaggleUnderBuggleException se você pede para eles pegarem um "baggle" de uma célula vazia, ou uma exceção AlreadyHaveBaggleException se eles já carregam um "baggle". Tentar soltar um "baggle" numa célula que já contém outro lança uma exceção AlreadyHaveBaggleException. Soltar um "baggle" quando você não tem nenhum lança uma DontHaveBaggleException.

source: SimpleBuggles (ie, the one used in first exercises) display an error message on problem so that you don't need to know what an exception is.
pt_br: SimpleBuggles (ie, aqueles usados nos primeiros exercícios) exibem uma mensagem de erro num problema de forma que você não precise saber o que é uma exceção.

source: This world is a simplistic testing environment largely inspired from the http://codingbat.com invented by Nick Parlente.
pt_br: Este mundo é um ambiente de testes simplista largamente inspirado no http://codingbat.com criado por Nick Parlente.

source: The typical exercises are very short ones, aiming at improving the tactical programming abilities of the students. That is to say that you will be presented a quite long list of very little exercises about rather simple things. The idea is to train you on these issues until they become automatic to you.
pt_br: Os exercícios são bem curtos, e têm como objetivo melhorar as habilidades de programação tática dos estudantes. Isto significa que você irá ser apresentado a uma longa lista de pequenos exercícios sobre coisas simples. A ideia é treinar estes aspectos simples até que eles fiquem automáticos para você.

source: In contrary to the other worlds, the BatWorld does not provide any fancy abstraction nor visualization. You have to fill a function, which gets called for a bunch of parameter sets, and that's it.
pt_br: Ao contrário dos outros mundos, o "BatWorld" não fornece qualquer abstração ou visualização legal. Você tem simplesmente que preencher uma função, que é chamada com um conjunto de parâmetros, e é isto.

source: For more information, you should refer to the CodingBat.com documentation, which contains for example a very useful documentation on boolean operators: http://codingbat.com/doc/ifboolean.html
pt_br: Para mais informações, você deve consultar a documentação do CodingBat.com, que contém por exemplo uma documentação sobre operadores booleanos bem útil: http://codingbat.com/doc/ifboolean.html

source: First steps
pt_br: Primeiros passos

source: This first lesson will lead your first steps in programming. It is intended for beginners. List of seen notions per exercise:
pt_br: A primeira lição vai te guiar pelos primeiros passos em programação. Ela é feita para iniciantes. Lista de noções vistas por exercício:

source: Instructions
pt_br: Instruções

source: Comments
pt_br: Comentários

source: Conditionals/ Expressions
pt_br: Condicionais/ Expressões

source: While loops
pt_br: Loops while (enquanto)

source: Variables
pt_br: Variáveis

source: For loops
pt_br: Loops for

source: Do/While loops
pt_br: loops Do/While (faça/enquanto)

source: Methods
pt_br: Métodos

source: Welcome in the Buggles' World
pt_br: Bem-vindo ao mundo dos Buggles

source: Java Instructions
pt_br: Instruções Java

source: Writing more complex programs
pt_br: Escrevendo programas mais complexos

source: Conditional instructions
pt_br: Instruções condicionais

source: Baggle Seeking
pt_br: Procurando Baggles

source: Storing and manipulating data
pt_br: Armazenando e manipulando dados

source: Do .. while loops
pt_br: Loops Do .. while (faça .. enquanto)

source: Building methodically
pt_br: Construindo metodicamente

source: Methods returning a result
pt_br: Métodos retornando um resultado

source: Methods with parameters
pt_br: Métodos com perâmetros

source: Methodically drawing
pt_br: desenhando metodicamente

source: Methodically drawing (only bigger)
pt_br: Desenhando metodicamente (apenas grande)

source: Drawing bigger and bigger
pt_br: Desenhando maior e maior

source: Even more pattern to draw
pt_br: Mais padrões para desenhar

source: Slug Hunting
pt_br: Caça à lesma

source: Slug Tracking
pt_br: Rastreando a lesma

source: Snake World
pt_br: Mundo das cobras

source: Knitting and Arrays
pt_br: tricô e Arrays

source: Knitting, Arrays and modulos
pt_br: tricô, arrays e módulos

source: Traversal by column
pt_br: Percorrer pelas colunas

source: Traversal by line
pt_br: Percorrer pelas linhas

source: Zig-zag traversal
pt_br: Percorrer em zig-zag

source: Diagonal Traversal
pt_br: Percorrer na diagonal

source: Meaning of the symbols
pt_br: Significado dos símbolos

source: Introducing the concept
pt_br: Introduzindo o conceito

source: Working on the concept
pt_br: Trabalhando o conceito

source: Concept assumed mastered
pt_br: Conceito tido como dominado

source: Concept not mandated by the exercise
pt_br: Conceito não é obrigatório para o exercício

source: What will I learn?
pt_br: O que irei aprender?

source: You will learn the very basics of programming. At least, you will be presented the most important concepts, allowing you to read most simple algorithms. You will not be able to write or read full programs because you will still not know about objects, but you will master what is called "Tactical programming", meaning that you will master the syntax enough to not have any issue with it, allowing you to focus on the fundamental problems of what you want to solve instead of struggling with syntactic difficulties.
pt_br: Você irá aprender o básico de programação. pelo menos, você irá ser apresentado aos mais importantes conceitos, permitindo que você leia a maioria dos algoritmos simples. Você não será capaz de escrever ou ler programas completos por que você ainda não saberá nada sobre objetos, mas você irá dominar o que é chamado de "programação tática", ou seja, você vai dominar a sintaxe o suficiente para não ter qualquer problema com ela, permitindo que você foque nos problemas funcamentais que você quer resolver ao invés de se debater com dificuldades de sintaxe.

source: This first lesson will lead your first steps in programming. It is intended for beginners.
pt_br: Esta primeira lição vai guiar você pelos primeiros passos em programação. Ela foi feita para iniciantes.

source: If you are not sure, go for this lesson that will teach you the bases of programming.
pt_br: Se você está perdido, venha para esta lição que ela irá te ensinar as bases da programação.

source: You just started the Programmer's Learning Machine. This is a Learning Management System aiming at teaching the art of computer programming through interactive exercises. It is constituted by a set of exercises grouped by lessons, allowing you to practice at your own pace. Currently, the environment is configured to be programmed in the [!thelang/] programming language, but you can change it from the Language menu if you want, or by clicking on the [!thelang/] icon at the right of the status bar below.
pt_br: Você acaba de iniciar o Programmer's Learning Machine (ou Máquina de Aprendizado do Programador). Este é um sistema de gestão de aprendizagem para ensinar a arte da programação de computadores através de exercícios interativos. É formado por um conjunto de exercícios agrupados por lições, para que você possa aprender no seu tempo. No momento, o ambiente está configurado para ser programado na linguagem de programação [!thelang/], mas você pode mudar isto no menu de Idioma/linguagem se você quiser, ou clicando no ícone [!thelang/] na direita da barra de status.

source: In this first lesson, the buggles will lead your first steps in programming.
pt_br: Nesta primeira lição, os buggles vão guiar seus primeiros passos na programação.

source: The <i>buggles</i>? What is this??
pt_br: Os <i>buggles</i>? O que é isso??

source: The buggles are little animals obeying any order you may give them. In each exercise, you have to provide them with the right instructions so that the world turns into the objective of the exercise. For example in this exercise, you should instruct your buggle to move forward once. You can see that by checking the difference between the <i>World</i> view and the <i>Objective</i> one. Depending on the exercise (and your settings in the Language menu), your code must be written in either C, Java, Python or Scala.
pt_br: Os buggles são pequenos animais que obedecem a qualquer ordem que você dá a eles. Em cada exercício, você tem que fornecer a eles as instruções corretas para que o mundo se torne o objetivo do exercício. Por exemplo, neste exercício você deve instruir seu buggle a avançar um passo. Você pode ver isto verificando a diferença entre a visão <i>Mundo</i> e a visão <i>Objetivo</i>. Dependendo das lições (e suas configurações no menu Idioma/linguagem), seu código deve ser escrito em C, Java, Python ou Scala.

source: Working environment
pt_br: Ambiente de trabalho

source: Before going any further, get familiar with the working environment. Have a look at the several elements composing the main window, move your mouse over them to show the tooltip, and experiment with the elements to see what they do. The white area below is the console: this is where errors and messages get displayed.
pt_br: Antes de seguir adiante, se acostume com o ambiente de trabalho. Dê uma olhada nos vários elementos que compõe a janela principal, mova seu mouse sobre eles para ver as dicas, e experimente os elementos para ver o que eles fazem. A área branca abaixo é o console: é onde erros e mensagens aparecem.

source: If your code contains errors (and code always do at some point), the computer will display error messages in the console. You obviously have to fix the errors to pass the exercises. The messages that get displayed may sound scary at first glance, but don't panic. The compiler is only somehow limited in its communication abilities, but he's not mean. If you look closer, the solution to solve your issue is written in the middle of those cryptic messages. You will see, with a bit of habit, we get used to it.
pt_br: Se seu código tem erros (e qualquer código sempre vai ter em algum momento), o computador vai exibir mensagens de erro no console. Você obviamente terá que consertar os erros para passar nos exercícios. As mensagens que são mostradas podem soar assustadoras à primeira vista, mas não entre em pânico. O compilador é meio limitado nas suas capacidades de comunicação, mas ele não faz de má-vontade. Se você olhar de perto, a solução para o problema está escrita no meio daquelas mensagens complicadas. Você vai notar que com um pouco de hábito a gente se acostuma.

source: What am I supposed to do?
pt_br: O que eu devo fazer?

source: It's time to write your first program. Simply ask your buggle to move one step forward using the Source Code pane. For that, simply write the following code (clicking on the interactive controls is not enough: You have to write the code after experimenting interactively).
pt_br: É chegada a hora de construir seu primeiro programa. Simplesmente peça a seu buggle para dar um passo para frente usando o painel SourceCode (Código Fonte). Para isto, simplesmente escreva o seguinte código (clicar nos controles iterativos não é o suficiente: você tem que escrever o código e depois experimentar interativamente).

source: [!java|scala|python]forward()[!java];[/!][/!][!c]stepForward();[/!]
pt_br: [!java|scala|python]avançar()[!java];[/!][/!][!c]avançarUmPasso();[/!]

source: Do not forget the final <code>;</code> which tells the compiler that the instruction is over (yes, computers are so dumb that they cannot <i>guess</i> obvious stuff like this).
pt_br: Não esqueça do <code>;</code> final que diz ao compilador que a instrução está encerrada (sim, o computador é tão bocó que ele não consegue <i>adivinhar</i> coisas óbvias como isto).

source: Once done, click on run. You can proceed to next exercise once it works.
pt_br: Uma vez feito, clique em rodar. Você pode seguir para o próximo exercício assim que este funcionar.

source: Congratulations! You just wrote your first program! You got the idea now: programming is nothing more than giving simple instructions to the computer that blindly apply them. The main difficulty is to explain stuff to something as stupid as a computer...
pt_br: Parabéns! Você acaba de escrever seu primeiro programa! Você agora captou a ideia: programar nada mais é que dar instruções simples para o computador, que as realiza cegamente. A maior dificuldade é explicar tudo para algo tão idiota quanto um computador...

source: Programs are mainly suites of method calls, which are no more than a list of simple orders given to the machine. It is very similar to a recipe stating <i>Melt the chocolate pieces, add sugar, cool the mix and serve</i>. In your programs, such built instructions are called functions or methods, and you should add parenthesis to invoke them:
pt_br: Programas são principalmente conjuntos de chamadas de métodos, que são nada mais que listas de ordens simples dadas à máquina. É muito semelhante a uma receita dizendo <i>Derreta os pedaços de chocolate, adicione açucar, mexa e sirva</i>. Em seus programas, tais instruções são chamadas funções ou métodos, e você deve acrescentar parêntesis para invocá-las:

source: nameOfTheMethod()
pt_br: nomeDoMétodo()

source: [!thelang] wants to have the instructions separated by semi-columns (;)[!python|scala] or by new lines[/!]. The previous example would thus be written in the following way[!python|scala] (you can also add semi-columns at the end of the lines, but this is not mandatory)[/!].
pt_br: [!thelang] precisa das instruções separadas por ponto-e-vírgula (;)[!python|scala] ou por quebra de linhas[/!]. O exemplo anterior poderia ter sido escrito da seguinte forma[!python|scala] (você também pode adicionar ponto-e-vírgula no final das linhas, mas isto não é obrigatório)[/!].

source: meltTheChocolatePieces()[!java|c];[/!] addSugar()[!java|c];[/!] coolMix()[!java|c];[/!] serve()[!java|c];[/!]
pt_br: derretaOsPedaçosDeChocolate()[!java|c];[/!] adicioneAçucar()[!java|c];[/!] mexa()[!java|c];[/!] sirva()[!java|c];[/!]

source: It could also be written in the following way, but it's generally considered as a bad practice to group several instructions on the same line since it greatly hinders the readability.
pt_br: Também pode ser escrito da seguinte forma, mas geralmente isto é considerado como uma prática ruim para agrupar várias instruções na mesma linha já que prejudica muito a legibilidade.

source: meltTheChocolatePieces(); addSugar(); coolMix(); serve()
pt_br: derretaOsPedaçosDeChocolate(); adicioneAçucar(); mexa(); sirva()
