Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: Then, the loop body to sort an element should first descend the hole and the elements within the sorted area until the element is larger than the element before in the sorted area (2 moves per position to travel), and then move the hole back to its position between the sorted and unsorted areas (1 move per position).
pt_br: Então, o corpo do loop para ordenar um elemento deve primeiro empurrar para baixo o espaço vazio e os elementos dentro da área ordenada até que o elemento seja maior que o elemento que está depois na área ordenada (2 movimentos por posição para se mover), e então mover o espaço vazio de volta para sua posição entre as áreas ordenadas e não-ordenadas (1 movimento por posição).

source: Once you insert the last element within the sorted area, your whole set is sorted and you're done. I preserve the surprise of the border cases that will require some little adjustments to your algorithm to make it work properly :)
pt_br: Uma vez que você insira o último elemento dentro da área ordenada, seu conjunto como um todo estará ordenado e você terá terminado. Vou deixar como surpresa os casos da fronteira que vão precisar de alguns pequenos ajustes no seu algoritmo para funcionar corretamente :)

source: Crap, we adapted the insertion sort because our selection sort required too much moves to get the selected players to their position, but the insertion sort requires an inordinate amount of changes to get the border elements to their position within the sorted area without mixing the already sorted elements. At the end of the day, our selection variant was more efficient with at most <code>3*amountOfBase</code> moves to sort one element (1 to get the hole alongside with the player, and 2 to get the hole+player in position) while our insertion variant requires at most <code>3*amountOfPlayers</code> to sort one element (2 to descend the hole and player in position, 1 to get the hole back to its position). That's twice as bad as there is two players per base. It may be possible to improve the insertion sort by moving by more than one element when descending, but it seems uneasy (at least, while not mixing the already sorted elements) and it would probably only ensure that our insertion variant becomes as efficient as our selection variant, not dramatically better.
pt_br: Putz, nós adaptamos o insertion sort por que o selection sort precisava de muitos movimentos para colocar os jogadores selecionados em suas posições, mas o insertion sort necessita de uma quantidade estúpida de mudanças para alcançar os elementos de fronteira para suas posições dentro da área ordenada sem bagunçar os elementos já ordenados. No final, nossa variante "selection" era mais eficiente com pelo menos <code>3*amountOfBase</code> movimentos para ordenar um elemento (1 para alcançar o espaço vazio ao lado do jogador, e 2 para colocar o espaço vazio e o jogador em posição) enquanto nossa variante "insertion" precisa de no máximo <code>3*amountOfPlayers</code> para ordenar um elemento (2 para descer o espaço vazio e o jogador na posição, 1 para trazer o espaço vazio de volta para sua posição). Isto é duas vezes pior que ter dois jogadores por base. Pode ser possível melhorar o insertion sort movendo mais de um elemento enquanto desce, mas parece difícil (pelo menos, fazendo sem misturar os elementos já ordenados) e provavelmente isto apenas vai garantir que nossa variante "insertion" se torne tão eficiente quanto nossa variante "selection", não dramaticamente melhor.

source: If we cannot make the sort faster, we can make it easier. If you think about it, it seems rather natural to adapt the bubble sort to this problem: the hole becomes the bubble that moves up and down, sorting a bit the array during each traversal. The big lines are simply: "while it's not sorted, move the hole down to base 0 (moving the biggest player of each base at each step) and then back to the maximal base (moving the smallest player of each base)". After a while, <code>isSorted()</code> will return true and your algorithm will stop.
pt_br: Se não pudermos tornar o ordenamento mais rápido, podemos torná-lo mais fácil. Se pensar a respeito, parece natural adaptar a ordenção bolha para este problema: o buraco se torna a bolha que se move para cima e para baixo, ordenando um pouco o array a cada passagem. As linhas grandes são simples: "enquanto (while) não estiver ordenado, mova o buraco para baixo até a base 0 (movendo o maior jogador de cada base em cada passo) e então de volta à base maximal (movendo o menor jogador de cada base)". depois de um tempo, <code>estáOrdenado()</code> vai retornar verdadeiro e seu algoritmo vai parar.

source: This is so easy that we introduce another variant of the problem, with more than two players per base. But actually, that shouldn't block you very long, should it?
pt_br: Isto é tão fácil que vamos introduzir outra variante do problema, com mais de dois jogadores por base. Mas isto não vai te segurar por muito tempo, né?

source: Surprisingly, the bubble sort variant requires ways less moves than the other variants. This is astonishing because usually, the bubble sort performs much worse than the others sorts, but it comes from the very good match between its big lines and the baseball universe. It actually happens rather often that a pleasantly written algorithm performs very decently. But this is not an universal rule either, as demonstrated by the naive algorithm of the first exercise, that was nice, simple and wrong ;)
pt_br: Surpreendentemente, a variante bubble sort precisa de menos movimentos que as outras variantes. Isto é fantástico, por que normalmente, o bubble sort é muito pior que os outros algoritmos, mas isto é graças à boa combinação entre suas linhas grandes e o universo do basebal. E na verdade acontece bastante de um algoritmo escrito de forma agradável rodar de forma bem decente. Mas isto não é uma regra universal, como foi demontrado pelo algoritmo simplório do primeiro exercício, que era legal, simples e errado ;)

source: The universe of turtles
pt_br: O universo das tartarugas

source: This is an adaptation of LOGO for the Programmer's Learning Machine.
pt_br: Esta é uma adaptação do LOGO para o Programmer's Learning Machine.

source: It is directly inspired from the work of the mathematician Seymour Papert in the 60's. Inspired from the swiss psycholog Jean Piaget, he came up with a learning method called LOGO to teach programming to young childs. The world is full of turtles which leave a painting where they go and which respond to simple orders.
pt_br: É diretamente inspirado no trabalho do matemático Seymour Papert nos anos 60. Inspirado no psicólogo suíço Jean Piaget, ele apresentou um método de ensino chamado LOGO para ensinar programação para crianças pequenas. O mundo é cheio de tartarugas que deixam um rastro de tinta por onde passam e que obedecem a comandos simples.

source: Functions to move the turtle
pt_br: Funções para mover a tartaruga

source: [!java|c]void [/!]forward([!java|c]double [/!]steps[!scala]:Double[/!]) [!java|c]void [/!]backward([!java|c]double [/!]steps[!scala]:Double[/!])
pt_br: [!java|c]void [/!]avançar([!java|c]double [/!]passos[!scala]:Double[/!]) [!java|c]void [/!]recuar([!java|c]double [/!]passos[!scala]:Double[/!])

source: Moves forward or backward of the requested amount of steps.
pt_br: Move para frente e para trás na quantidade de passos pedidos.

source: [!java|c]void [/!]right([!java|c]double [/!]angle[!scala]:Double[/!]) [!java|c]void [/!]left([!java|c]double [/!]angle[!scala]:Double[/!])
pt_br: [!java|c]void [/!]direita([!java|c]double [/!]ângulo[!scala]:Double[/!]) [!java|c]void [/!]esquerda([!java|c]double [/!]ângulo[!scala]:Double[/!])

source: Turns left or right of the given angle (in degrees).
pt_br: Vira à esquerda ou à direita um dado ângulo (em graus).

source: Returns the current position of the turtle. Note that the point (0,0) is on the top left corner, as it is often the case in Computer Science.
pt_br: Retorna a posição atual da tartaruga. Observe que o ponto (0,0) está no canto superior esquerdo, como é comum na ciência da computação.

source: Teleports the turtle to a new position (without leaving any trace).
pt_br: Teletransporta a tartaruga para uma nova posição (sem deixar rastros).

source: [!java|c]void [/!]moveTo([!java|c]double [/!]x[!scala]:Double[/!], [!java|c]double [/!]y[!scala]:Double[/!])
pt_br: [!java|c]void [/!]moverPara([!java|c]double [/!]x[!scala]:Double[/!], [!java|c]double [/!]y[!scala]:Double[/!])

source: Moves the turtle to a new position.
pt_br: Move a tartaruga para uma nova posição.

source: [!java|c]void [/!]circle([!java|c]double [/!]radius[!scala]:Double[/!])
pt_br: [!java|c]void [/!]círculo([!java|c]double [/!]raio[!scala]:Double[/!])

source: Draw a circle of the specified radius centered on the turtle.
pt_br: Desenha um círculo de raio especificado com o centro na tartaruga.

source: [!java|c]void [/!]hide()
pt_br: [!java|c]void [/!]esconder()

source: Hides the turtle.
pt_br: Esconde a tartaruga.

source: [!java|c]void [/!]show()
pt_br: [!java|c]void [/!]mostrar()

source: Shows the turtle back.
pt_br: Mostra novamente a tartaruga.

source: [!java]boolean [/!][!c]int [/!]isVisible()[!scala]:Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]éVisível()[!scala]:Boolean[/!]

source: Returns whether the turtle is currently visible.
pt_br: Retorna se a tartaruga é visível ou não.

source: [!java|c]void [/!]clear()
pt_br: [!java|c]void [/!]limpar()

source: Removes any trail on the sheet.
pt_br: Remove todos os rastros do papel.

source: Returns the current heading of the turtle (in degrees).
pt_br: Retorna a direção atual da tartaruga (em graus).

source: [!java|c]void [/!]setHeading([!java|c]double [/!]angle[!scala]:Double[/!])
pt_br: [!java|c]void [/!]setDireção([!java|c]double [/!]ângulo[!scala]:Double[/!])

source: Sets a new heading to the turtle (in degrees).
pt_br: Ajusta uma nova direção para a tartaruga (em graus).

source: Functions about the pen
pt_br: Funções da caneta

source: [!java|c]void [/!]penUp()
pt_br: [!java|c]void [/!]levantarCaneta()

source: Moves the pen up (turtles have pens, not brushes as buggles). The turtle will not leave any trace during its subsequent moves.
pt_br: Levanta a caneta (tartarugas têm canetas, não pinceis, como os buggles). A tartaruga não vai deixar nenhum rastro durante seus passos seguintes.

source: [!java|c]void [/!]penDown()
pt_br: [!java|c]void [/!]abaixarCaneta()

source: Moves the pen down. The turtle will leave a trace during its subsequent moves.
pt_br: Abaixa a caneta. A tartaruga vai deixar um rastro nos próximos movimentos.

source: [!java]boolean [/!][!c]int [/!]isPenDown()[!scala]:Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]canetaEstáAbaixada()[!scala]:Boolean[/!]

source: Returns the current pen position as a boolean.
pt_br: Retorna a posição atual da caneta como um booleano.

source: [!java|c]Color [/!]getColor()[!scala]:Color[/!]
pt_br: [!java|c]Cor [/!]getCor()[!scala]:Cor[/!]

source: Returns the current pen color.
pt_br: Retorna a cor atual da caneta.

source: [!java|c]void [/!]setColor([!java|c]Color [/!]color[!scala]:Color[/!])
pt_br: [!java|c]void [/!]setCor([!java|c]Cor [/!]cor[!scala]:Cor[/!])

source: Changes the pen color.
pt_br: Muda a cor da caneta.

source: Other functions
pt_br: Outras funções

source: Returns whether the current turtle is selected in the graphical interface.
pt_br: Retorna se a tartaruga atual está selecionada na interface gráfica.

source: Since its inception in the 60's, the LOGO turtle fascinates by its ability to draw nice figures on computer. This lesson allows you to explore some of the classical figures, and draw your own.
pt_br: Desde sua concepção nos anos 60, a tartaruga do LOGO fascinou por sua habilidade de desenhar belas figuras no computador. Este lição permite que você explore algumas das figuras clássicas, e desenhe as suas próprias.

source: The language's syntax is absolutely not presented, but if you know a bit of it or if someone tells you, you can take these exercises even if you are an absolute beginner in programming.
pt_br: A sintaxe da linguagem é não vai ser apresentada, mas se você conhece um pouco ou se alguém te mostrar, você pode tentar estes exercícios mesmo sendo um completo iniciante em programação.

source: Please send us your best contributions so that they get added to this gallery to inspire the next ones.
pt_br: Por favor nos mande suas melhores contribuições para que sejam adicionadas a esta galeria para inspirar os próximos usuários.

source: Other exercises should be added. A whole lot of exercises are available from <a href="http://neoparaiso.com/logo/#sect4">http://neoparaiso.com/logo/#sect4</a> or from <a href="http://billkerr2.blogspot.fr/2009/08/40-maths-shapes-challenges.html.">http://billkerr2.blogspot.fr/2009/08/40-maths-shapes-challenges.html</a>.
pt_br: Outros exercícios devem ser adicionados. Um conjunto completo de exercícios está disponível em <a href="http://neoparaiso.com/logo/#sect4">http://neoparaiso.com/logo/#sect4</a> ou em <a href="http://billkerr2.blogspot.fr/2009/08/40-maths-shapes-challenges.html.">http://billkerr2.blogspot.fr/2009/08/40-maths-shapes-challenges.html</a>.

source: Missing: the built-ins arc() and arcTo(), that draw an arc, either w/o moving or by moving to the end of the arc.
pt_br: Faltando: os built-ins arc() e arcTo(), que desenham um arco, tanto movendo ou sem mover para o final do arco.

source: Draw beautiful figures with the Logo turtle, and learn programming while playing.
pt_br: Desenhe belas figuras com a tartaruga do Logo, e aprenda a programar enquanto brinca.

source: You should know the basic syntax of the programming language you will choose, but no exhaustive programming practice is required to take this lesson.
pt_br: Você deve saber a sintaxe básica da linguagem de programação que escolher, mas técnicas avançadas de programação não são necessárias para fazer esta lição.

source: This world allows you to experiment with the recursive lists, as they were first introduced in Lisp. It is very similar to the BatWorld, but you are supposed to write recursive functions working on [!python|java]recursive strings. Since [!thelang] does not provide such a construct natively, the ConsWorld defines recursive lists of type <code>RecList</code>.[/!] [!scala]lists of integers (<code>List[Int]</code>).[/!]
pt_br: Este mundo permite que você experimente com listas recursivas, pois ele foi introduzido primeiro em Lisp. É muito similar ao BatWorld, mas você deve escrever funções recursivas que funcionem em [!python|java]strings recursivas. pois [!thelang] não fornece tal contrução nativamente, o ConsWorld define listas recursivas do tipo <code>RecList</code>.[/!] [!scala]listas de inteiros (<code>List[Int]</code>).[/!]

source: Any given such list is either the empty list (noted <code>[!scala]Nil[/!][!java]null[/!][!python]None[/!]</code>), or an integer followed by a list. If a list is not empty, you can retrieve its first integer with <code>list.head</code> and the list containing its other parameters with <code>list.tail</code>. Of course, the empty list has no head nor the tail, so trying to access these elements will result in an (unpleasant) error message.
pt_br: Qualquer lista dada é ou a lista vazia (noted <code>[!scala]Nil[/!][!java]null[/!][!python]None[/!]</code>), ou um inteiro seguido de uma lista. Se uma lista não é vazia, você pode recuperar seu primeiro inteiro com <code>list.head</code> e a lista contendo os demais parâmetros com <code>list.tail</code>. Obviamente, a lista vazia não tem head nem tail, portanto, tentar acessar estes elementos vai resultar numa mensagem de erro (desagradável).

source: To build your own list, you need to concatenate a head and a tail as follows: [!java|python]<code>cons(head, tail)</code>[/!] [!scala]<code>head::tail</code> Note that <code>::</code> is a generic operator in Scala to build lists.[/!]
pt_br: Para construir sua própria lista, você precisa concatenar um head e um tail como segue: [!java|python]<code>cons(head, tail)</code>[/!] [!scala]<code>head::tail</code> Observe que <code>::</code> é um operador genérico em Scala para construir listas.[/!]

source: So, in summary, you can solve every exercises of this lesson with the following constructs.
pt_br: Logo, resumindo, você pode resolver cada exercício desta lição com as seguintes construções.

source: <b>The empty list:</b>
pt_br: <b>A lista vazia:</b>

source: <b>Get the first element of <code>l</code></b>
pt_br: <b>Obtém o primeiro elemento de <code>l</code></b>

source: <b>Get the rest of the list</b>, when the first element is removed:
pt_br: <b>Obtém o resto da lista</b>, quando o primeiro elemento é removido:

source: <b>Build a list</b> from a <code>value</code> and a <code>list</code>: [!java|python]
pt_br: <b>Constrói uma lista</b> a partir de um <code>valor</code> e uma <code>lista</code>: [!java|python]

source: Recursive Lists
pt_br: Listas Recursivas

source: This lesson contains a bunch of classical exercises on recursive lists. It is certainly not the most pleasant lesson to do, but I think that it is the easiest of the PLM lessons dealing with recursion.
pt_br: Esta lição contém um monte de exercícios clássicos com listas recursivas. Ele com certeza não é a lição mais agradável para fazer, mas das lições do PLM que lidam com recursão, eu acho esta a mais fácil.

source: New exercises could be proposed, such as http://webloria.loria.fr/~quinson/Teaching/TOP/02-td-recursivite-enonce.pdf If you know some others, please report them as an issue.
pt_br: Novos exercícios podem ser propostos, como http://webloria.loria.fr/~quinson/Teaching/TOP/02-td-recursivite-enonce.pdf Se você conhecer outros, favor abra uma "issue" para relatar.

source: It would be interesting to check the asymptotic complexity of the student's code, but that does not sound easy to do. In Python and Java (where we provide a hand-made RecList class), we could count the amount of cons per exercise, but it won't be easy to relate this to the right BatTest. For Scala, it sounds even more difficult as we use the classical :: operators of the language. That will be difficult to override to add a counting mechanism. Another solution would be to ensure that the call stack does not pass a given threshold, but that sounds very difficult too. Any idea is welcome.
pt_br: Pode ser interessante verificar a complexidade assintótica do código do estudante, mas isto não parece fácil de fazer. Em Python e Java (onde fornecemos uma classe RecList feita à mão), podemos contar a quantidade de cons por exercício, mas não é fácil relacionar isto ao BatTest correto. Para Scala, parece ainda mais difícil pois usamos os operadores :: clássicos da linguagem. Vai ser difícil fazer uma sobreposição ("override") para adicionar um mecanismod e contagem. Outra solução seria garantir que a pilha de chamadas não passe de um dado limiar, mas parece muito difícil de fazer também. Quaisquer ideias são bem-vindas.

source: Length
pt_br: Comprimento

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return its length[!scala] (without using its <code>size</code> method, of course)[/!]. [!java|python]
pt_br: Dada uma [!scala]Lista[Int][/!][!java|python]lista recursiva[/!], retorna seu comprimento[!scala] (sem usar o seu método <code>size</code>, claro)[/!]. [!java|python]

source: [!python]Be careful, you are not supposed to use the Python lists, but the specific type defined in this exercise. [/!] Please refer to the world's documentation for more information about recursive lists.
pt_br: [!python]Cuidado, você não pode usar listas de Python, mas sim o tipo específico definido neste exercício. [/!] favor ver a documentação do mundo para mais informações a respeito de listas recursivas.

source: Your solution should be linear in time.
pt_br: Sua solução deve ser linear no tempo.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an integer, return true if the given integer is one of the elements of the list, or false if it cannot be found.
pt_br: Dada uma [!scala]List[Int][/!][!java|python]recursive list[/!] e um inteiro, retorna verdadeiro se o dado inteiro é um dos elementos desta lista, ou falso se ele não for encontrado.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an integer, return the amount of occurrences of the given integer in the list. If the integer is not a member of the list, the function should thus return 0.
pt_br: Dada uma [!scala]List[Int][/!][!java|python]recursive list[/!] e um inteiro, retorna a quantidade de ocorrências de um dado inteiro na lista. Se o inteiro não for um membro da lista, a função deve retornar 0.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return its last element. You can assume that the list is not empty.
pt_br: Dada uma [!scala]List[Int][/!][!java|python]recursive list[/!], retorna seu último elemento. Você pode assumir que a lista não é vazia.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return the smallest of its values. You will probably need an extra function, even if you can assume that the list is not empty.
pt_br: Dada uma [!scala]List[Int][/!][!java|python]recursive list[/!], retorna o menor dos seus valores. Você vai precisar provavelmente de uma função extra, mesmo se você puder assumir que a lista é não vazia.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return whether its elements form an increasing sequence (i.e., if the elements are sorted from the smallest to the largest one).
pt_br: Dada uma [!scala]List[Int][/!][!java|python]recursive list[/!], retorna se seus elementos estão em ordem crescente (i.e., se os elementos são ordenados do menor para o maior).

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return the list containing every elements but the last one. You can assume that the list is not empty.
pt_br: Dada uma [!scala]List[Int][/!][!java|python]recursive list[/!], retorna a lista contendo todos os elementos exceto o último. Você pode assumir que a lista é não vazia.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return a new list containing all elements of your parameter incremented by one.
pt_br: Dada uma [!scala]List[Int][/!][!java|python]recursive list[/!], retorne uma nova lista contendo todos os elementos de seu parâmetro incrementados de um.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] <code>L</code>and an integer, return a new list containing all elements of <code>L</code> that are not equal to the value received as parameter.
pt_br: Dada uma [!scala]List[Int][/!][!java|python]recursive list[/!] <code>L</code> e um inteiro, retorna uma nova lista contendo todos os elementos de <code>L</code> que não são iguais ao valor recebido como parâmetro.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an integer <code>N</code>, return the <code>N</code>th element of the list.
pt_br: Dada uma [!scala]List[Int][/!][!java|python]recursive list[/!] e um inteiro <code>N</code>, retorna o <code>N</code>-ésimo (<code>N</code>th) elemento da lista.

source: You can assume that the list is long enough, i.e. that there is at least <code>N</code> elements. Your solution should be linear in time.
pt_br: Você pode assumir que a lista é longa o suficiente, i.e. que existe pelo menos <code>N</code> elementos. Sua solução deve ser linear no tempo.
