Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: You must define two functions: <code>[!java]void [/!]initialize()</code> and <code>[!java]void [/!]step()</code>. <code>initialize()</code> is called once just after you press "Run". You can use it to chose some flat zone. As before, <code>step()</code> is called every 0.1 second and is used for adjusting the lander's thrust and angle. As in the first exercise the lander's thrust is adjusted via <code>[!java]void [/!]setDesiredThrust([!java]int [/!]desiredThrust[!scala]:Integer[/!])</code>. But you can also control its angle via <code>[!java]void [/!]setDesiredAngle([!java]double [/!]desiredAngle[!scala]:Double[/!])</code>. An angle of 0° denotes a vertical position where the "head" of the lander points up. This is the angle you must land with. A positive angle denotes a left-leaning lander, a negative angle a right-leaning one. You cannot lean more than by ±90°, and the angle can vary by at most ±5° in one step.
pt_br: Você precisa definir duas funções: <code>[!java]void [/!]initialize()</code> e <code>[!java]void [/!]step()</code>. <code>initialize()</code> é chamada uma única vez depois de você apertar "Rodar". Você pode usar isto para escolher alguma área plana. Como antes, <code>step()</code> é chamado a cada 0.1 segundos e é usada para ajustar a potência e ângulo do módulo. Como no primeiro exercício, a potência do módulo é ajustada através de <code>[!java]void [/!]setDesiredThrust([!java]int [/!]desiredThrust[!scala]:Integer[/!])</code>. Mas você também pode controlar seu ângulo através de <code>[!java]void [/!]setDesiredAngle([!java]double [/!]desiredAngle[!scala]:Double[/!])</code>. Um ângulo de 0° denota uma posição vertical onde a "cabeça" do módulo aponta para cima. Este é o ângulo com o qual você deve pousar. Um ângulo positivo denota um módulo inclinado para a esquerda, um ângulo negativo um inclinado para a direita. Você não pode inclinar mais que ±90°, e o ângulo pode mudar por no máximo ±5° em cada passo.

source: As in the previous exercise, <code>[!java]List&lt;Point&gt; [/!]getGround()[!scala]:List[Point][/!]</code> returns the vertices of the ground's profile from left to right. Please refer to the documentation (Help/About this world) for a reference manual of your lunar lander.
pt_br: Como no exercício anterior, <code>[!java]List&lt;Point&gt; [/!]getGround()[!scala]:List[Point][/!]</code> retorna os vértices do perfil do solo da esquerda para a direita. Favor consulte a documentação (Ajuda/Sobre este mundo) para um manual de referência do módulo lunar.

source: As before, your program must safely land the lander in all the situations encountered so far in addition to this new one.
pt_br: Como antes, seu programa deve pousar com segurança o módulo em todas as situações encontradas além desta nova.

source: Good luck, try not to crash!
pt_br: Boa sorte, tente não cair!

source: The PLM Main Window
pt_br: A Janela Principal do PLM

source: The PLM working environment should be self-explanatory, in particular with the tool tips appearing when your mouse is over the elements. Here is a little explanation of the components in case you fail to understand something. The main window is made of 5 main components:
pt_br: O ambiente de trabalho do PLM é auto-explicativo, principalmente com as dicas que aparecem quando o mouse passa sobre elementos. Aqui está uma breve explicação dos componentes caso você não entenda algo. A janela principal é composta de 5 componentes principais:

source: <b>The menu:</b> Placed on top of the window, it gives you access to some advanced commands such as exiting the program, and some other that we will detail later.
pt_br: <b>O menu:</b> Colocado na parte de cima da janela, ele dá a você acesso a alguns comandos avançados, como sair do programa, e alguns outros que falaremos mais tarde.

source: <b>The tool bar:</b> Placed just below the menu, it gives you access to the four main commands:
pt_br: <b>A barra de ferramentas:</b> Colocada logo abaixo do menu, ela te dá acesso aos quatro comandos principais:

source: The <b>Start</b> button, which begins the compilation and execution of the code you may have typed in the editor. At the end of the execution, it verifies whether you reach the situation constituting the objective of the exercise or not. If yes, you gain access to the next exercise using the <b>Exercise</b> menu. If not, you need to rework your code.
pt_br: O botão <b>início</b>, que começa a compilação e a execução do código que você digitou no editor. No final da execução, ele verifica se você alcançou uma situação que constitui o objetivo do exercício ou não. Se sim, você ganha acesso ao próximo exercício usando o menu <b>Exercício</b>. Se não, você vai precisar refazer seu código.

source: The <b>Stop</b> button allows you to interupt the execution of your code, what may reveal useful if you encounter an <i>infinite loop</i>.
pt_br: O botão <b>Parar</b> sempre serve para interromper a execução de seu código, o que pode ser útil se você entrar num <i>loop infinito</i>.

source: The <b>Reset</b> button can be used to reset the world into its initial state.
pt_br: O botão <b>Reset</b> pode ser usado para reconfigurar o mundo para o estado inicial.

source: The <b>Demo</b> button shows you the execution of the expected solution. During its execution, you may want to switch the seen world to see the different expected solutions.
pt_br: O botão <b>Demo</b> mostra a execução da solução esperada. Durante sua execução, você pode alternar o mundo visto para ver as diferentes soluções esperadas.

source: Please note that there is often several ways of achieving the awaited solution, and that the one presented during the demo is not more or less correct than the others. You are completely free to not follow strictly the process shown by the demo, as long as your final solution matches the exercise expectations.
pt_br: Note que às vezes existem várias maneiras de alcançar a solução esperada, e que aquela apresentada durante a demonstração não é mais ou menos certa que as outras. Você é completamente livre para não seguir estritamente o processo mostrado pela demonstração, desde que sua solução final atinja o que exercício pede.

source: <b>Mission and editor tabs:</b> this is were you read this very text. This area contains several tabs to which you can access by clicking on their name on the top left. The first tab (which is always named <b>Mission</b>) contains a presentation of the current exercise. To solve an exercise, you need to write your code in the other tabs. For example, you can now clic on the <b>Source Code</b> tab to see the actual source. If it is empty, that's because you did not write any code yet.
pt_br: <b>Abas de missão e editor:</b> é onde você está lendo este texto. Esta área contém várias abas as quais você pode acessar clicando em seu nome no canto superior esquerdo. A primeira aba (que sempre se chama <b>Missão</b>) contém uma apresentação do exercício atual. Para resolver um exercício, você precisa escrever seu código nas outras abas. Por exemplo, você pode agora clicar na aba <b>Código Fonte</b> para ver o código real. Se estiver vazia, é por que você ainda não escreveu nenhum código.

source: <b>The console:</b> Placed under the tabs, this is where any messages of the application will appear. This area is initially empty and white.
pt_br: <b>O console:</b> localizado abaixo das abas, é onde aparece qualquer mensagem da aplicação. Esta área inicialmente é vazia e branca.

source: <b>World view</b> Placed on the right of the tabs, it is constituted of five elements:
pt_br: <b>Visão do mundo</b> localizada à direita das abas, é constituída de cinco elementos:

source: A scrolling menu allows to choose the world. Indeed, the program you write may be executed in several worlds to test it in differing conditions. This menu allows you to choose the world you want to see. Note that this scrolling menu is hidden if there is only one world in your exercise.
pt_br: Um menu rolante serve para escolher o mundo. Na verdade, o programa que você escreveu pode ser executado em vários mundos para testar ele em diferentes condições. Este menu é para você escolher o mundo que você quer ver. Observe que este menu rolante fica oculto se houver apenas um mundo no seu exercício.

source: A slider placed right bellow allows to choose the animation speed of the world. More precisely, it allows to choose the delay (in milliseconds) that the buggles must wait after each action to allow you to see what they are doing.
pt_br: Um "slider" colocado logo abaixo serve para escolher a velocidade da animação do mundo. Mais precisamente, permite escolher o atraso (em milisegundos) que os buggles devem esperar depois de cada ação para permitir que você veja o que eles estão fazendo.

source: A tab <b>World</b> represents the view of the world currently selected (from the scrolling menu). This view is thus constitued of a grid forming the several cells of the world, as well as several <i>buggles</i> awaiting for your orders.
pt_br: Uma aba <b>Mundo</b> representa a visão de mundo atualmente selecionada (de menu rolante). Esta visão é então constituída de uma grade formando várias células do mundo, assim como vários "<i>buggles</i>" esperando suas ordens.

source: An <b>Objective</b> tab displaying the world as it must be by the end of the exercise.
pt_br: Uma aba <b>Objetivo</b> mostrando o mundo como deveria ser no final do exercício.

source: <b>The interactive controls</b>. Placed under the world view, these buttons allows you to interactively control the buggles. This way, you can try to <i>manually</i> bring your buggle to the scenario objective before writting the needed code in the editor.
pt_br: <b>Os controles interativos</b>. Localizados abaixo da Visão do mundo, estes botões servem para controlar interativamente os buggles. Desta forma, você pode tentar trazer <i>manualmente</i> seu buggle para o objetivo do cenário antes de escrever o código necessário no editor.

source: A scrolling menu allows to select the buggle you want to control.
pt_br: Um menu rolante serve para selecionar o "buggle" que você quer controlar.

source: The <b>Forward</b> button let your buggle do one step forward.
pt_br: O botão <b>Avançar</b> faz seu "buggle" dar um passo à frente.

source: The <b>Backward</b> button let it do one step backward.
pt_br: O botão <b>Recuar</b> faz ele dar um passo para trás.

source: The <b>Turn left</b> button ask your buggle to turn of 90° to its left.
pt_br: O botão <b>Virar à esquerda</b> manda seu "buggle" virar 90° à esquerda.

source: The <b>Turn right</b> button asks the buggle to turn to the right (isn't this amazing?).
pt_br: O botão <b>Virar à direita</b> manda seu o "buggle" virar à direita (surpreendente, né?).

source: The <b>Mark</b> button requests your buggle to leave a mark behind it when it goes.
pt_br: O botão <b>Marcar</b> pede que o seu "buggle" deixe uma marca atrás dele depois que sair.
