Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: Turn left and move one step forward
pt_br: Vire a esquerda e mova um passo a frente

source: Left
pt_br: Esquerda

source: Turn back (U-turn) and move one step forward
pt_br: Vire para trás (meia-volta) e mova um passo a frente

source: Inverse
pt_br: Inversa

source: Move one step forward
pt_br: Mova um passo a frente

source: First letter of the alphabet
pt_br: Primeira letra do alfabeto

source: Move two steps forward
pt_br: Mova dois passos a frente

source: Second letter of the alphabet
pt_br: Segunda letra do alfabeto

source: Move three steps forward
pt_br: Mova três passos a frente

source: Third letter of the alphabet
pt_br: Terceira letra do alfabeto

source: Move one step backward
pt_br: Mova um passo para trás

source: One letter before the end of the alphabet
pt_br: última letra do alfabeto

source: Move two steps backward
pt_br: Mova dois passos para trás

source: Two letters before the end of the alphabet
pt_br: penúltima letra do alfabeto

source: Move three steps backward
pt_br: Mova três passos para trás

source: Three letters before the end of the alphabet
pt_br: Antepenúltima letra do alfabeto

source: <i>(anything else)</i>
pt_br: <i>(qualquer outra coisa)</i>

source: Stop dancing.
pt_br: Parar de dançar.

source: Indications
pt_br: Indicações

source: This exercise may seem a bit complex at the first glance, but it comes down to summarizing the information of the table in a sequence of conditionals.
pt_br: Este exercício pode parecer um pouco complexo à primeira vista, mas ele vem para resumir a informação na tabela numa sequência de condicionais.

source: You have to keep dancing as long as there is some dancing steps to do, i.e., as long as we are in a cell which content is described in the table. The easier for that is to use a boolean variable (<code>finished</code>) as termination condition to a <code>while</code> loop. It should be initialized to <code>[!c]0[/!][!java|scala]false[/!][!python]False[/!]</code>, and switched to <code>[!c]1[/!][!java|scala]true[/!][!python]True[/!]</code> as soon as the buggle find a cell with a value not described in the table. Thus, the loop will stop and the program will terminate.
pt_br: Você tem que se manter dançando enquanto houverem passos de dança para fazer, i.e., enquanto estivermos numa célula cujo conteúdo esteja contido na tabela. a forma mais fácil de fazer isto é usando uma variável booleana (<code>terminou</code>) como condição de término para o loop <code>while</code>. Ela deve ser iniciada como <code>[!c]0[/!][!java|scala]false[/!][!python]False[/!]</code>, e trocada para <code>[!c]1[/!][!java|scala]true[/!][!python]True[/!]</code> assim que o buggle encontre uma célula com um valor não descrito na tabela. Assim, o loop pára e o programa termina.

source: Another subtlety is that detecting if strings are equals is a bit annoying in [!thelang]. So, we use the <code>char getIndication[!c]Bdr[/!]()</code> instead of <code>[!java]String[/!][!c]char*[/!] readMessage()</code>. This method, only known by the buggles of this exercise, returns the first char of the message written on the ground (or ' ' -- the space char -- if nothing is written down). It enables to work with chars instead of strings, that is much simpler in [!thelang].
pt_br: Outro detalhe é que detectar se strings são iguais é um pouco chato em Java. Então, usamos o <code>char getIndication[!c]Bdr[/!]()</code> ao invés do <code>[!java]String[/!][!c]char*[/!] lerMensagem()</code>. Este método, conhecido apenas pelos buggles deste exercício, retorna o primeiro caractere da mensagem escrita no chão (ou ' ' -- o caractere para espaço -- se não tem nada escrito). Ele habilita que se trabalhe com caracteres ao invés de strings, que é muito mais simples em [!thelang].

source: Tips and Hints
pt_br: Dicas

source: If you fail to understand why the buggle does not execute the expected steps, try adding <code>brushDown()</code> in your method. This asks the buggle to put down a brush leaving a trail when it moves. It should help you understanding its trajectory, but do not forget to remove this call when you want to test whether your code is a valid solution to the exercise: you are asked to let the buggle dance, not to vandalize the dance floor.
pt_br: Se você não entendeu por que o buggle não fez os passos esperados, tente adicionar <code>abaixarPincel()</code> no seu método. Isto pede ao buggle para abaixar um pincel deixando um rastro por onde passar. Isto pode ajudar você a entender a trajetória dele, mas não esqueça de remover esta chamada quando você quiser testar se seu código é uma solução válida para o exercício: você pode fazer o buggle dançar, mas não pichar a pista de dança.

source: When your program finally works, move on to the next exercise.
pt_br: Quando seu programa finalmente funcionar, vá para o próximo exercício.

source: BDR is cool, but it's a bit chaotic. First, the buggles giggle in any directions, and then the code you had to write to let them move is rather difficult to read. Here is a new BDR world where the buggle will dance a gentle circle. We will benefit this tranquillity to clean up a bit our code thanks to the new constructs we will introduce.
pt_br: BDR é legal, mas um pouco caótico. Primeiro, os buggles balançam em todas as direções, o que faz com que o código que você tenha que escrever para fazê-los se mover seja um pouco difícil de ler. Apresentamos agora um novo mundo DBR onde os buggles dançam num suave círculo. Vamos aproveitar esta tranquilidade para limpar um pouco nosso código graças a novas construções que vamos introduzir.

source: [!java|c]<code>switch</code> conditionals[/!][!scala]Pattern matching[/!]
pt_br: [!java|c]condicionais <code>switch</code>[/!][!scala]busca de padrões[/!]

source: The hardest part of previous code is certainly the conditional cascading. Somewhere in your code, you certainly had something similar to:
pt_br: A parte mais difícil do código anterior é comn certeza a cascata de condicionais. Em algum ponto do seu código, você certamente tem algo como isto:

source: if ([!java|c]getIndication() == 'R'[/!][!scala]readMessage() == "R"[/!]) { right(); [!c]stepForward()[/!][!java|scala]forward()[/!]; } else if ([!java|c]getIndication() == 'L'[/!][!scala]readMessage() == "L"[/!]) { left(); [!c]stepForward()[/!][!java|scala]forward()[/!]; } else if ([!java|c]getIndication() == 'I'[/!][!scala]readMessage() == "I"[/!]) { back(); [!c]stepForward()[/!][!java|scala]forward()[/!]; <span class="comment">/* other else if */</span> } else { finished = [!c]1[/!][!java|scala]true[/!]; }
pt_br: if ([!java|c]getIndicação() == 'R'[/!][!scala]lerMensagem() == "R"[/!]) { direita(); [!c]avançarUmPasso()[/!][!java|scala]avançar()[/!]; } else if ([!java|c]getIndicação() == 'L'[/!][!scala]lerMensagem() == "L"[/!]) { esquerda(); [!c]avançarUmPasso()[/!][!java|scala]avançar()[/!]; } else if ([!java|c]getIndicação() == 'I'[/!][!scala]lerMensagem() == "I"[/!]) { voltar(); [!c]avançarUmPasso()[/!][!java|scala]avançar()[/!]; <span class="comment">/* other else if */</span> } else { terminou = [!c]1[/!][!java|scala]true[/!]; }

source: When you review this code, it may not be clear at the first glance that it is simply a choice with 4 branches depending on the value of [!java|c]getIndication()[/!][!scala]readMessage()[/!]. To improve this, we will use a [!java|c]<code>switch</code> construct, which Java syntax is the following:[/!] [!scala] pattern matching, which is a very powerful construct that greatly generalizes the <code>if</code>. It is arguably one of the major advantages of Scala when compared to languages such as Java or python. It is not new either, as other languages such as OCaml or Haskell offer this feature since long, but still. It's really cool![/!]
pt_br: Quando você revisa este código, não fica claro à primeira vista que ele é simplesmente a escolha entre quatro ramos dependendo do valor de [!java|c]getIndicação()[/!][!scala]lerMensagem()[/!]. Para melhorar ele, vamos usar uma construção [!java|c]<code>switch</code>, que na sintaxe de Java é o seguinte:[/!] [!scala] de busca de padrões, que é bastante poderosa e generaliza muito o <code>if</code>. É com certeza uma das maiores vantagens de Scala quando comparada com linguagens como Java ou python. E nem é tão nova assim, já que outras linguagens como OCaml e Haskell já tem esta funcionalidade a muito tempo. Ela é bem legal![/!]

source: Observe that each branch of a <tt>switch</tt> must be ended by a <code>break</code>. If you forget this, the machine keeps going and execute the next branch in the list after the branch it jumped to. There is even some <b>rare</b> cases where this behavior reveals helpful.
pt_br: Observe que cada ramo de um <tt>switch</tt> deve terminar com um <code>break</code>. se você esquecer dele, a máquina continua e executa o próximo ramo na lista depois do ramo para o qual ele pulou. Existem na verdade uns <b>raros</b> casos onde este comportamento é útil.

source: It is then possible to rewrite previous BDR code in a cleaner way using the <tt>switch</tt> construct:
pt_br: É então possível reescrever o código do BDR anterior numa forma mais clara usando a construção <tt>switch</tt>:

source: switch (getIndication()) { case 'R': right(); [!c]stepForward()[/!][!java]forward()[/!]; break; case 'L': left(); [!c]stepForward()[/!][!java]forward()[/!]; break; case 'I': back(); [!c]stepForward()[/!][!java]forward()[/!]; break; default: return; }
pt_br: switch (getIndicação()) { case 'R': direita(); [!c]avançarUmPasso()[/!][!java]avançar()[/!]; break; case 'L': esquerda(); [!c]avançarUmPasso()[/!][!java]avançar()[/!]; break; case 'I': voltar(); [!c]avançarUmPasso()[/!][!java]avançar()[/!]; break; default: return; }

source: <i>expression</i> <b>match</b> { <b>case</b> <i>possible value</i> <b>=></b> instructions <b>case</b> <i>other value</i> <b>=></b> other instructions <b>case</b> <i>another value</i> <b>=></b> yet another instructions <b>case _ =></b> default instructions }
pt_br: <i>expressão</i> <b>match</b> { <b>case</b> <i>um valor possível</i> <b>=></b> instruções <b>case</b> <i>um outro valor</i> <b>=></b> outras instruções <b>case</b> <i>mais outro valor</i> <b>=></b> e outras instruções <b>case _ =></b> instruções padrão }

source: The expression provided before the keyword <code>match</code>, and then the branches are evaluated one after the other until we find one which value provided between <code>case</code> and <code>=&gt</code> is equal to the expression's value. The <code>_</code> symbol acts as a wildcard, so the <code>_</code> branch <i>always</i> matches. Here is an example where a variable <code>name</code> is matched.
pt_br: A espressão fornecida antes da palavra-chave <code>match</code>, e os ramos seguintes são avaliados um após o outro até encontrarmos um cujo valor fornecido entre <code>case</code> e <code>=&gt</code> seja igual ao valor da expressão. O símbolo <code>_</code> age como um coringa, logo o ramo <code>_</code> <i>sempre</i> casa. Aqui está um exemplo de onde uma variável <code>name</code> casa.

source: name match { case "Martin" => println("Hello Martin, how are you?") case "Gerald" => println("Hey Gerald! How are you doing?") case _ => println("Welcome stranger.") }
pt_br: name match { case "Martin" => println("Oi Martin, como vai?") case "Gerald" => println("Oi Gerald! como vai você?") case _ => println("Olá estranho.") }

source: It is possible to have more than one instruction per branch, and merge branches when the values are separated by a | symbol.
pt_br: é possível ter mais que uma instrução por ramo, e mesclar ramos quando os valores são separados por um símbolo | .

source: name match { case "Martin" | "Gerald" => println("Hello "+name+", how are you?"); openTheDoor() case _ => println("Hello stranger. Please do not pass."); lockTheDoor() }
pt_br: name match { case "Martin" | "Gerald" => println("Oi "+name+", como vai?"); openTheDoor() case _ => println("Oi estranho. Favor não passar."); lockTheDoor() }

source: You can even add guards to your branches. These are extra conditions that must be respected for the branch to get applied. This is handy if you want match on value ranges, as follows.
pt_br: Você sempre pode adicionar guardas aos seus ramos. Estes são condições extra que devem ser respeitadas para que o ramo seja feito. São úteis se você quiser casar em intervalos de valores, como segue.

source: age match { case i if i&lt;10 => println("Hey kid!") case i if i&lt;20 => println("Hey dude!") case i if i&lt;30 => println("Hello young man") case _ => println("Hello Sir") }
pt_br: age match { case i if i&lt;10 => println("Oi menino!") case i if i&lt;20 => println("Oi cara!") case i if i&lt;30 => println("Oi, meu caro") case _ => println("Oi senhor") }

source: Note that there is no need to check whether the value is higher than 10 on the second line because the first matching branch is used. So, if the second branch gets evaluated, then the first one did not match.
pt_br: Observe que não há necessidade de verificar se o valor é maior que 10 na segunda linha por que o primeiro ramo "foi verificado". Então, se o segundo ramo está sendo verificado, o primeiro não aprovou.

source: Finally, it is possible also to match several variables in one shoot!
pt_br: Finalmente, é possível também aprovar várias variáveis de uma vez!

source: (x,y) match { case (0,0) => println("that's the origin") case (_,0) => println("On the ordinate") case (0,_) => println("On the abscissa") case (_,_) => println("Some random point") }
pt_br: (x,y) match { case (0,0) => println("Esta é a origem") case (_,0) => println("nas ordenadas") case (0,_) => println("nas abscissas") case (_,_) => println("algum ponto qualquer") }

source: I told you that scala's pattern matching is very powerful! I actually love this feature!
pt_br: Eu disse que reconhecimentod e padrões em scala é muito poderoso! Eu adoro esta funcionalidade!

source: [!java|scala|c]Apply the improvement we just saw to rewrite your buggle code with the following dance steps. [/!] [!python]Let's teach a new dance step to the buggles. It is slightly more complex but actually better looking. Beside of that, that's the same old story.[/!] Note that we can now move up to 6 cells in one dance step.
pt_br: [!java|scala|c]"Aplique" a melhoria que acabamos de ver para reescrever seu código do buggle com os seguintes passos de dança. [/!] [!python]Vamos ensinar um novo passo de dança para os buggles. É um pouco mais complexo mas na verdade vai ficar mais legal. Apesar disto, é a mesma história de sempre.[/!] Observe que nósagora vamos subir seis células em um passo de dança.

source: Turn back and move one step forward
pt_br: Vire e dê um passo para frente

source: Move four cells forward
pt_br: Mova quantro passos para frente

source: Move five cells forward
pt_br: Mova cinco passos para frente

source: Move six cells forward
pt_br: Mova seis passos para frente

source: Move four cells backward
pt_br: Mova quatro passos para trás

source: Move five cells backward
pt_br: Mova cinco passos para trás

source: Move six cells backward
pt_br: Mova seis passos para trás

source: When you program works again, proceed to next exercise.
pt_br: Quando seu programa funcionar de novo, vá para o próximo exercício.

source: We will now teach the buggle to explore its world. Its initial position is the bottom left corner, and it should visit any cells up to the top (coloring the ground on its path. The main loop of your code is something like:
pt_br: Agora vamos ensinar o buggle a explorar seu mundo. Sua posição inicial é o canto inferior esquerdo, e ele deve visitar todas as células até o topo (colorindo o chão onde for passando. O loop principal de seu código é algo assim:

source: move brush down while we did not reach the final position move like a snake
pt_br: abaixe o pincel enquanto não chegar na posição final se mova como uma cobra

source: We thus have to write two specific methods: The first one returns a boolean indicating whether we are on a final position while the second moves one snake step forward.
pt_br: Então nós temos que escrever dois métodos específicos: o primeiro retorna um booleano indicando se nós estamos numa posição final enquanto o segundo um "snake step" para frente.

source: We reached the final position if and only if both conditions are true:
pt_br: Chegamos na posição final se e apenas se ambas as condições são verdadeiras:

source: We are facing a wall
pt_br: Estamos de frente para uma parede

source: There is a wall on the north of the buggle. So, if the buggle is facing east, you should check whether there is a wall on the left, and if the buggle is facing west, you should check on the right side.
pt_br: Existe uma parede no norte do buggle. Então, se o buggle está olhando para o leste, você deve verificar se existe uma parede à esquerda, e se o buggle está olhando para o oeste, você deve verificar do lado direito.

source: We can get the current heading of the buggle using the <code>getDirection()</code>, and we know whether it looks east using <code>getDirection() == [!scala|python|java]Direction.[/!]EAST</code> (WEST for west).
pt_br: Nós podemos obter a direção atual do buggle usando o <code>getDireção()</code>, e nós sabemos se ele está apontando para o leste usando <code>getDireção() == [!scala|python|java]Direção.[/!]LESTE</code> (OESTE para oeste).

source: To check, nothing magical: you have to turn the buggle and check whether it is facing a wall afterward.
pt_br: Para verificar, não tem mágica: você tem que virar o buggle e verificar em seguinda se ele está olhando para uma parede.

source: Then, a snake step can be achieved by moving one step forward if we are not facing a wall, and moving to the upper line else (i.e., if you look to the west facing a wall, you have to turn right, forward and turn right).
pt_br: Então, um passo de cobra pode ser conseguido movendo um passo para a frente se nós não estivermos de cara para a parede, e movendo para a linha acima caso contrário (i.e., se você olha para o oeste e está de cara para uma parede, tem que virar a direita, andar e virar a direita).

source: Hint: the main loop of your code must continue while the testing function returns false. There is two ways of writing it:
pt_br: Dica: o loop principal do seu código deve continuar enquanto a função de teste retorna falso. Existem duas formas de fazer isto:

source: [!python]You may prefer to write it as:[/!] [!java|scala|c]Since the exclamation mark (!) denotes the boolean negation in [!thelang], you may write it as:[/!]
pt_br: [!python]Você pode preferir escrever como:[/!] [!java|scala|c]Já que a marca de exclamação (!) denota a negação booleana em [!thelang], você pode escrever como:[/!]

source: The goal of this serie of exercises is to let the buggle traverse its world. It must number the cells it walks on to show its traversal order.
pt_br: O objetivo desta série de exercícios é fazer o buggle percorrer seu mundo. Ele deve numerar as células por onde passa para mostrar a ordem do caminho.

source: The main loop of your code should be something like:
pt_br: O loop principal de seu código deve ser algo como:

source: while we are not on the final position go to the next position label the cell with its number
pt_br: enquanto não estiver na posição final vá para a próxima posição rotule a célula com um número

source: In contrary to the exercises we saw so far, we won't use the <code>forward()</code>, <code>backward()</code> and similar methods. Instead, we will compute the coordinate of the next buggle position and use the <code>setPos(x, y)</code> method to <i>teleport</i> the buggle directly to this position. For example, <code>setPos(3, 5)</code> teleports the buggle to the cell where x=3 and y=5.
pt_br: Ao contrário dos exercícios que vimos até agora, não vamos usar os métodos <code>avançar()</code>, <code>recuar()</code> e similares. Ao invés disto, vamos calcular as coordenadas da próxima posição de buggle e usar o método <code>setPos(x, y)</code> para <i>teletransportar</i> o buggle diretamente para esta posição. Por exemplo, <code>setPos(3, 5)</code> teletransporta o buggle para a célula onde x=3 e y=5.

source: Your first task is thus to write a boolean function indicating whether the buggle reached the final position or not, ie if it reached the bottom right corner of the world. For this, you can use <code>getWorldWidth()</code> and <code>getWorldHeight()</code> which return respectively the world's width and height. Your test is about comparing the buggle's current position (that you can access with <code>getX()</code> and <code>getY()</code>) to the world dimensions.
pt_br: Sua primeira tarefa é escrever uma função booleana indicando se o buggle alcançou a posição final ou não, ou seja se ele alcançou o canto inferior direito do mundo. Para isto, você pode usar <code>getLarguraDoMundo()</code> e <code>getAlturaDoMundo()</code> que retornam respectivamente a largura e altura do mundo. Seu teste deve comparar a posição atual do buggle (que você pode acessar com <code>getX()</code> e <code>getY()</code>) com as dimensões do mundo.

source: Beware, the first line and column are numbered 0 and not 1, and the point (0,0) is on the top left corner. This may seem surprising, but it is very often so in Computer Science.
pt_br: Cuidado, a primeira linha e coluna são numeradas com 0 e não com 1, e o ponto (0,0) fica no canto superior esquerdo. Isto pode parecer estranho, mas é bem comum em ciência da computação.

source: Then, you have to write the code to reach the next position. In this exercise, you have to traverse the world row after row. So, if you are at the bottom of a row, you have to move to the top of next row. Else, you have to move to the cell below.
pt_br: Então, você tem que escrever o código para alcançar a próxima posição. Neste exercício, você tem que percorrer o mundo linha após linha. Logo, se você está no fundo de uma linha, você tem que se mover para o topo da próxima, caso contrário você tem que se mover para a célula abaixo.

source: At this point, you can launch your program to check that the buggle correctly traverse the world in the expected order, and that it stops when it has to. Use the <b>stop</b> button if the buggle does not stop correctly.
pt_br: Neste ponto, você pode lançar seu programa para verificar se o buggle percorre corretamente o mundo na ordem esperada, e que ele pára quando tem que parar. Use oo botão <b>stop</b> se o buggle não parar corretamente.

source: It is now time to write down the cell numbers. For that, you will need a counter initialiser to zero at the beginning of your code, and incremented by one at each step (for example with <code>counter += 1;</code>). Then, you have to use <code>writeMessage()</code> to write the value on the ground.
pt_br: Agora é hora de escrever os números das células. Para isto, você vai precisar de um contador iniciando em zero no começo do seu código, e incrementar de um em cada passo (por exemplo com <code>counter += 1;</code>). Então, você terá que usar <code>escreverMensagem()</code> para escrever o valor no chão.

source: You probably need to write the first [!java|scala|c]or last [/!]value out of the main loop [!java|scala|c], depending on whether you prefer to use a <code>while</code> or a <code>do/while</code> one[/!].
pt_br: Você provavelmente vai precisar escrever o primeiro [!java|scala|c]ou último [/!]valor fora do loop principal [!java|scala|c], dependendo se você prefere usar um <code>while</code> ou um <code>do/while</code>[/!].
