Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: While loops are well adapted to situations where you want to achieve an action while a condition stays true, but it is less adapted to achieve a given action a predetermined amount of time. For example, when we wanted to move <code>stepAmount</code> steps backward in a previous exercise, we had to create a new variable, initialize it, and move backward while incrementing this variable until it became equal to <code>stepAmount</code>.
pt_br: loops 'while' são bem adaptados a situações onde você precise realizar uma ação enquanto uma condição se mantém verdadeira, mas são menos preparados para realizar uma ação num número de vezes predeterminado. Por exemplo, quando nós quisemos nos mover <code>quantidadeDePassos</code> para trás num exercício anterior, nós tivemos que criar uma nova variável, inicializar ela e mover para trás enquanto aumentávamos esta variável até ela se tornar igual a <code>quantidadeDePassos</code>.

source: In such situations, <code>for</code> loops become handy. Their syntax is the following:
pt_br: Em tais situações, loops <code>for</code> se tornam úteis. Suas sintaxes são as seguintes:

source: [!java|c]for (<b>initializing</b>; <b>condition</b>; <b>incrementing</b>) { <b>action</b>(); }[/!][!python]for <b>variable</b> in <b>sequence of values</b>: <b>action</b>()[/!][!scala] for (<b>variable</b> &lt;- <b>firstValue</b> to <b>lastValue</b>) { <b>action</b>(); }[/!]
pt_br: [!java|c]for (<b>inicialização</b>; <b>condição</b>; <b>incremento</b>) { <b>ação</b>(); }[/!][!python]for <b>variável</b> in <b>sequência-de-valores</b>: <b>ação</b>()[/!][!scala] for (<b>variável</b> &lt;- <b>primeiroValor</b> to <b>últimoValor</b>) { <b>ação</b>(); }[/!]

source: For example to repeat the loop body <code>n</code> times, [!python] it is handy to use the instruction <code>range(n)</code> to generate the sequence n integer value from 0 to n-1.[/!] [!java|scala|c] one should write:[/!]
pt_br: Por exemplo, para repetir o corpo do loop <code>n</code> vezes, [!python] é útil usar a instrução <code>range(n)</code> para gerar a sequência de n valores inteiros de 0 a n-1.[/!] [!java|scala|c] você deve escrever:[/!]

source: [!java]for (int stepper=0; stepper&lt;n; stepper++) { <b>action</b>(); }[/!][!c]int stepper; for (stepper=0; stepper&lt;n; stepper++) { <b>action</b>(); }[/!][!python]for <b>stepper</b> in <b>range(n)</b>: <b>action</b>()[/!][!scala] for (<b>stepper</b> &lt;- <b>1</b> to <b>n</b>) { <b>action</b>(); }[/!]
pt_br: [!java]for (int iterador=0; iterador&lt;n; iterador++) { <b>ação</b>(); }[/!][!c]int iterador; for (iterador=0; iterador&lt;n; iterador++) { <b>ação</b>(); }[/!][!python]for <b>iterador</b> in <b>range(n)</b>: <b>ação</b>()[/!][!scala] for (<b>iterador</b> &lt;- <b>1</b> to <b>n</b>) { <b>ação</b>(); }[/!]

source: This code is then equivalent to the following one from the computer point of view. From the programmer point of view, one form or the other can make the source code easier to read, depending on the situation. You should chose wisely in each situation whether you want to use a for loop or a while loop. Your uttermost goal should remain to keep your code simple and easy to read, to ensure that your day remain pleasant and productive.
pt_br: Este código é então equivalente ao seguinte do ponto de vista do computador. Do ponto de vista do programador, uma forma ou outra pode ser mais difícil ou mais fácil de ler, dependendo da situação. Você deve escolher sabiamente em qual situação usar um loop for ou um loop while. Seu objetivo principal deve ser manter seu código simples e fácil de ler, para garantir que seu dia seja agradável e produtivo.

source: [!java|c]int stepper = 0; while (stepper &lt; n) { &nbsp;&nbsp;&nbsp;&nbsp;<b>action</b>(); &nbsp;&nbsp;&nbsp;&nbsp;<b>stepper++</b>; }[/!][!python]stepper=0 while stepper &lt; n: action() stepper = stepper + 1[/!][!scala] var stepper = 1 while (stepper &lt;= n) { <b>action</b>() stepper = stepper + 1 }[/!]
pt_br: [!java|c]int iterador = 0; while (iterador &lt; n) { &nbsp;&nbsp;&nbsp;&nbsp;<b>ação</b>(); &nbsp;&nbsp;&nbsp;&nbsp;<b>iterador++</b>; }[/!][!python]iterador=0 while iterador &lt; n: ação() iterador = iterador + 1[/!][!scala] var iterador = 1 while (iterador &lt;= n) { <b>ação</b>() iterador = iterador + 1 }[/!]

source: In that case, the <code>for</code> loop is easier to read, don't you think?
pt_br: Neste caso, o loop <code>for</code> é fácil de ler, não acha?

source: It is possible to build more advanced <tt>for</tt> loops since any valid instruction can be used as initialization, condition and incrementing instruction. The following example is a bit extreme as there is no need for a loop body to move the buggle forward until it reaches the wall, but it works well: all the work is done in the condition and incrementing instruction.
pt_br: É possível construir loops <tt>for</tt> mais avançados já que qualquer instrução válida pode ser usada como inicialização, condição e instrução de incrementação. O exemplo seguinte é um pouco extremo pois não existe necessidade para um corpo de loop mover um buggle para frente até ele alcançar a parede, mas funciona bem: todo o trabalho é feito nas instruções de condição e incremento.

source: for (; !isFacingWall() ; forward()) { <span class="comment">/* nothing in the loop body */</span> } <span class="comment">/* the buggle now faces a wall */</span>
pt_br: for (; !estáDeFrenteParaParede() ; avançar()) { <span class="comment">/* nada no corpo do loop */</span> } <span class="comment">/* o buggle agora está de cara para uma parede */</span>

source: If you want to nest several loops, you can do it on one line in Scala. This means that the two following chunks are equivalent:
pt_br: Se você quer aninhar vários loops, você pode fazer isto em uma linha no Scala. Isto significa que os dois blocos seguintes são equivalentes:

source: for (stepper1 &lt;- 1 to n) { for (stepper2 &lt;- 1 to m) { actions() } }
pt_br: for (iterador1 &lt;- 1 to n) { for (iterador2 &lt;- 1 to m) { ações() } }

source: for (stepper1 &lt;- 1 to n; stepper2 &lt;- 1 to m) { <span class="comment">// Simply separate both loop conditions with a semi-column</span> actions() }
pt_br: for (iterador1 &lt;- 1 to n; iterador2 &lt;- 1 to m) { <span class="comment">// Simplesmente separe as duas condições de loop com um ponto-e-vírgula</span> ações() }

source: You now have to redo the same exercise than previously (move forward until being over a baggle, pick it up, move back to your original location, drop the baggle), but using a <code>for</code> loop instead of a <code>while</code> loop to move back to the initial location.
pt_br: Você agora tem que refazer o mesmo exercício de antes (mover para frente até estar sobre um baggle, pegá-lo, mover para trás até a localização original, soltar o baggle), mas usando um loop <code>for</code> no lugar de um loop <code>while</code> para mover de volta ao local inicial.

source: Once done, you can proceed to next exercise.
pt_br: Uma vez feito, você pode seguir para o próximo exercício.

source: Stairway to Heaven
pt_br: Uma escadaria para o Céu

source: Your buggle feels a bit depressed today, but it's currently facing a magic stair: It leads directly to heaven, and each time you walk on it, joyful colors spur all around.
pt_br: Seu buggle está um pouco deprimido hoje, mas ele está na frente de uma escada mágica: Ela leva diretamente para o paraíso, e cada vez que você anda nela, belas cores surgem de todos os lados.

source: Your goal is to take this stair, one step after the other. First devise the four instructions you have to give you buggle to take one stair step, and then put them in a loop to take the whole stair.
pt_br: Seu objetivo é subir a escada, um passo por vez. Primeiro "devise" as quatro instruções que você tem que dar ao buggle para subir um degrau, e então bote ela num loop para subir a escada toda.

source: Before that, walk a bit forward to reach that stair, and ensure that you are in the right situation for your loop content to run properly. And once you reach the heaven, take some steps in your new home. Meanwhile, you just have to walk your way, the colors appear automagically.
pt_br: Antes disto, ande um pouco para a frente para alcançar a escada, e certifique-se de estar na situação certa para que o que o loop faz seja feito corretamente. E uma vez alcançado o Céu, dê uns passos no seu novo lar. Enquanto isto, você deve apenas seguir seu caminho, as cores aparecem automagicamente.

source: Training Buggle
pt_br: Treinando o Buggle

source: Today, your buggle wants to get some serious exercise: It wants to run 'till the track burns! Its super-shoes are just perfect to run like hell, but unfortunately, they can actually damage the track on the long run...
pt_br: Hoje seu buggle quer fazer exercício seriamente: Ele quer correr até tocar fogo na trilha! seus super-tenis são perfeitos para correr loucamente, mas infelizmente, eles podem estragar seriamente a trilha a longo prazo...

source: Your goal is to run the track 10 times, no matter what happens. Even if the track suffers, you <b>really HAVE</b> to take that run. Remember, the track has four sides, that take eight steps each to run along. Now go, and show them what these super shoes can do.
pt_br: Seu objetivo é percorrer a trilha 10 vezes, não importa o que aconteça. Mesmo se a trilha "suffers", você <b>TEM MESMO</b> que fazer esta corrida. Lembre, a triha tem quatro lados, cada lado com oito passos. Agora vá, e mostre a eles o que os seus super-sapatos podem fazer.

source: You don't have to do anything particular with regard of the colors: your shoes will do it for you. Just take that run!
pt_br: Você não tem que fazer nada de particular com respeito às cores: seus sapatos vão fazer isto para você. Apenas corra!

source: Outdoor Training Buggle
pt_br: Treinamento ao ar livre do Buggle

source: Well, our last training didn't went that well. The track actually burned, and we are now banned from there. This time, our buggle decided to practice outdoor, in the middle of the forest, with its good old shoes instead. The problem is that you have to be careful to not fall into water. The track on which you can run is rather narrow: One side is now 4 steps forward, 2 steps to the left, 4 steps to the right, 2 steps to the right, 4 steps to the left, and you want to run 7 around.
pt_br: Bem, nosso último treino teve um probleminha. A trilha tocou fogo, e fomos banidos de lá. Desta vez, nosso buggle decidiu praticar ao ar livre, no meio da floresta, com seus velhos tênis. O problema é que você tem que ser cuidadoso para não cair na água. A trilha onde você corre é estreita: "One side is now" 4 passos para a frente, 2 passos para a esquerda, 4 passos para a direita, 2 passos para a direita, 4 passos para a esquerda, "and you want to run 7 around".

source: Oh crap, running on the grass seems to destroy it too! So just take your 7 loops around the garden, and move along to the next exercise before anyone notices the damage you made...
pt_br: Putz, correr na grama destrói a grama também! Então dê apenas 7 voltas no jardim e depois vá para o próximo exercício antes que alguém perceba o estrago que você fez...

source: Some cells of the world are yellow, but your buggle cannot stand being in such cells. Write the necessary code to move forward until the ground gets white. For that, use the provided method <code>isGroundWhite()</code>.
pt_br: Algumas células do mundo são amarelas, mas seu buggle não pode ficar sobre estas células. Escreva o código necessário para mover para a frente até que o chão fique branco. Para isto use o método fornecido <code>chãoBranco()</code>.

source: The trick is that most buggles of this world are currently on this yellow ground that they dislike so much. That is why they are in panic, and every buggle rushes one cell forward, even the buggle that was not on a yellow cell at first. In other worlds, even if the ground is white on the first cell, you still want to move forward to the next cell.
pt_br: O truque é que a maioria dos buggles deste mundo ficam sobre o chão amarelo que eles não gostam. é por isto que eles estão em pânico, e cada buggle "rushes" uma célula para a frente, mesmo aqueles que não estavam numa célula amarela no começo. Em outras palavras, mesmo se o chão for branco na primeira célula, você ainda vai querer se mover para a próxima célula.

source: The general idea is to do something like:
pt_br: A ideia geral é fazer algo como:

source: move forward until located in a white cell
pt_br: Mover para a frente até estar numa célula branca

source: The main difficulty is that we want this loop body to be executed once, even we are already on a white cell. It would be easy to do so by duplicating the loop content before the actual loop, but this would be a bad idea: code duplication is a <b>very</b> bad habit, and you should <b>always</b> avoid it.
pt_br: A coisa mais difícil é que nós queremos executar o corpo do loop uma vez, mesmo se já estivermos numa célula branca. Isto é fácil duplicando o código do loop'antes do loop em si, mas esta é uma má ideia: diplicação de código é um hábito <b>muito</b> ruim, e você deve evitar isto <b>sempre</b>.

source: Code duplication easily turns code maintenance into a nightmare: reading the code becomes difficult as the reader must ensure that no slight difference exist between the versions. Debugging the code becomes difficult, as bugs have to be fixed in all versions. Actually, every modification of the code becomes difficult. So, really, you should <b>always</b> strive to not duplicate your code if you can avoid. And the good news is that you always can...
pt_br: Duplicação de código faz da manutenção de código um pesadelo rapidamente: é fdifícil ler o código e o leitor tem que garantir que nenhuma pequena diferença exista entre as versões. Depurar o código se torna difícil, pois os bugs devem ser consertados em todas as versões. Na verdade, cada modificação do código se torna difícil. Então, na verdade, você deve <b>sempre</b> se esforçar para não duplicar seu código sempre que possível. Mas a boa notícia é que você sempre pode...

source: Executing the loop body at least once
pt_br: Executando o corpo do loop pelo menos uma vez

source: Some languages have specific constructs for that, but not the Python language. No problem, we can do it on our own! A good way is to have a dedicated variable indicating whether we are taking the loop for the first time or not, as follows.
pt_br: Algumas linguagens tem construções específicas para isto, mas não a linguagem Python. Sem problemas, podemos fazer isto nós mesmos! Uma boa forma é ter uma variável dedicada indicando se estamos entrando no loop a primeira vez ou não, como segue.

source: firstTime = True while firstTime or (other conditions): firstTime = False (loop body)
pt_br: primeiraVez = True while primeiraVez or (outras condições): primeiraVez = False (corpo do loop)

source: When <code>firstTime</code> is true, the loop body is executed even if the other conditions would imply the contrary. Once the loop body has been executed once, it is set to false and never impact again the decision to enter the body or not.
pt_br: Quando <code>primeiraVez</code> é true, o corpo do loop é executado mesmo se as outras condições digam o contrário. uma vez que o loop tenha sido executado uma vez, esta variável vira false e nunca mais impacta na decisão de entrar ou não no loop.

source: In a <tt>while</tt> loop, the condition is evaluated before anything else, and if it's false, the loop body is never evaluated. Sometimes (although not that often), you would prefer the loop body to get evaluated at least once, even if the condition is initially false. For that, a variation of the <tt>while</tt> loop gets used, using the following syntax in [!thelang]. [!java|c]Do not forget the semi-column (;) after the condition, it is mandatory.[/!]
pt_br: Num loop <tt>while</tt>, a condição é calculada antes de qualquer coisa, e se for falsa, o corpo do loop nunca é executado. Algumas vezes (mas não muito frequentemente), você pode preferir que o corpo do loop seja executado pelo menos uma vez, mesmo se a condição seja inicialmente falsa. Para isto, uma variação do loop <tt>while</tt> é usada, com a seguinte sintaxe em [!thelang]. [!java|c]Não esqueça o ponto-e-vírgula (;) depois da condição, que é obrigatório.[/!]

source: do { <b>action()</b>[!java];[/!] } while (<b>condition</b>)[!java];[/!]
pt_br: do { <b>ação()</b>[!java];[/!] } while (<b>condição</b>)[!java];[/!]

source: Tracks of buggles
pt_br: Trilhas de buggles

source: Your buggle got lost in a strange maze, and you must help it to find the exit that is represented in orange. You cannot simply explain the path to the exit in something like <code>right();forward();forward();forward()</code> because you have to save two buggles at the same time, that are lost in similar but not identical worlds. You can switch to the other world by using the combobox above the world representation (where it's written 'Deep Forest' right now), and selecting the other entry (that should read 'Deeper Forest').
pt_br: Seu buggle se perdeu num estranho labirinto, e você deve ajudá-lo a achar a saída que está representada em laranja. Você não pode simplesmente explicar o caminho para a saída com algo do tipo <code>direita();avançar();avançar();avançar()</code> por que você tem que salvar dois buggles ao mesmo tempo, que estão presos em mundos similares mas não iguais. Você pode alternar para o outro mundo usando o combobox acima da representação do mundo (onde está escrito 'Floresta Fechada' agora), e selecionar a outra entrada (que deve ler 'Floresta Mais Fechada').

source: The good news is that the path to the exit is written on the ground. As you can see, the world is made of several corridors, with baggles on the ground. After each corridor, you should turn left if the corridor contains three baggels or more, and you have to turn right if there is only 2 baggles or less.
pt_br: A boa nova é que o caminho para a saída está desenhado no chão. Como você pode ver, o mundo é feito de vários corredores, com baggles no chão. Depois de cada corredor, você deve virar à esquerda se o corredor tiver três baggels ou mais, e virar a direita se tiver apenas 2 ou menos baggles.

source: You should count exactly 5 cells per corridor, the one at the intersection counting as the last cell of the previous corridor, not as the first cell after your turn.
pt_br: Você deve contar exatamente 5 células por corredor. Aquela com a intersecção conta como a última do corredor anterior, não como a primeira depois de você virar.

source: So, the general form of your code must be something like "while I did not find the exit, take the next corridor to decide whether I should turn left or right at the next intersection". You can determine whether you are on the exit cell (that is orange) with the provided <code>exitReached()</code> method.
pt_br: Logo, a forma geral de seu código deve ser algo como "enquanto não encontrar a saída, pegue o próximo corredor para decidir se vira à esqueda ou à direita na próxima intersecção". Você pode determinar se você está na célula de saída (que é laranja) com o método <code>saídaAlcançada()</code> fornecido.

source: To take one corridor, you simply have to run from one intersection to another while counting the baggles you see on your path. That's easy: there is 5 steps in each corridors so a simple <code>for</code> loop suffices.
pt_br: Para entrar num corredor, você tem que simplesmente correr de uma intersecção para outra enquanto conta os baggles que vê no seu caminho. Isto é fácil: existem 5 passos em cada corredor, de forma que um simples loop <code>for</code> resolve.

source: I cannot imagine how to count the baggles I see.
pt_br: Eu não consigo imaginar como contar os baggles que eu vejo.

source: You need a variable that is initialized to 0, and incremented each time you see a baggle on the ground. A variable used this way is often called <i>counter</i>.
pt_br: Você precisa de uma variável que é inicializada em 0, e incrementada cada vez que você vê um baggle no chão. Uma variável usada desta forma é frequentemente chamada de <i>contador</i>.

source: Don't forget to reset your counter to 0 at the beginning of each corridor!
pt_br: Não esqueça de resetar seu contador para 0 no começo de cada corredor!

source: Oh, and when you reach the exit, don't forget to take an extra step to actually exit the maze!
pt_br: Ah, e quando chegar na saída, não esqueça de dar um passo a mais para sair de fato do labirinto!

source: [!java|scala]Arrays[/!][!python]Lists[/!] and Knotting
pt_br: [!java|scala]Arrays[/!][!python]Lists[/!] e nós

source: The goal of this exercise is to reproduce the pattern of the first row in the other rows with a shift of one cell (see the Objective tab for details). The biggest difference between this exercise and the others we had on patterns is that you have to read the pattern (on first row) before reproducing it. You cannot do otherwise because the same code will be executed on three different worlds, each of them having a specific pattern.
pt_br: O objetivo deste exercício é reproduzir o padrão da primeira linha nas outras linhas com um deslocamento de uma célula (veja a aba Objetivo para detalhes). A maior diferença entre este exercício e os outros sobre padrões é que você tem que ler o padrão (na primeira linha) antes de reproduzí-lo. Você não pode fazer de outro jeito por que o mesmo código será executado em três mundos diferentes, cada um com seu próprio padrão.

source: One solution is to read the next cell, and go copy it in position before coming back to read the second cell. But since it is forbidden to use the methods to teleport the buggle to a specific position (<code>setPos()</code> and similar), this approach will be a pain to implement.
pt_br: Uma solução é ler a próxima célula, e copiar ela na posição antes de voltar para ler a segunda célula. Mas já que é proibido usar os métodos de teletransporte de buggle para uma posição específica (<code>setPos()</code> e similares), esta abordagem seria muito difícil de implementar.

source: The simplest is to store the sequence of colors that constitute the whole pattern in an [!java|scala]<b>array</b>[/!][!python]<b>list</b>[/!]. But before we can do so, we should learn a bit what [!java|scala]arrays[/!][!python]lists[/!] are.
pt_br: O mais simples é armazenar a sequência de cores que constituem o padrão inteiro numa [!java|scala]<b>array</b>[/!][!python]<b>list</b>[/!]. Mas antes de fazer isto, devemos aprender um pouco sobre o que [!java|scala]arrays[/!][!python]lists[/!] são.
