Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: Of course, these specific methods do not exist by default in [!thelang], but it may be possible to define them by yourself (we'll see later how to define your how methods).
pt_br: Obviamente, estes métodos específicos não existem por padrão em [!thelang], mas é possível definí-los você mesmo (vamos ver mais tarde como definir seus próprios métodos).

source: For now, we'll simply go for the buggle instructions. There is a method for each button of the interactive control panel. To achieve the same effect than the <b>forward</b> button (making the buggle moving one step forward), you need to write the following in the editor:
pt_br: Por enquanto, vamos ficar apenas com as instruções do buggle. Existe um método para cada botão do painel de controle interativo. Para alcançar o mesmo efeito que o botão <b>avançar</b> (fazendo o buggle avançar um passo), você precisa escrever o seguinte no editor:

source: Likewise, to achieve the same effect than the <b>[!java|scala|python]backward[/!][!c]stepBackward[/!]</b>, <b>left</b> and <b>right</b> buttons, you need to use respectively:
pt_br: Da mesma forma, para obter o mesmo efeito que os botões <b>[!java|scala|python]recuar[/!][!c]recuarUmPasso[/!]</b>, <b>esquerda</b> e <b>direita</b>, você precisa respectivamente:

source: backward()[!java|c];[/!] left()[!java|c];[/!] right()[!java|c];[/!]
pt_br: recuar()[!java|c];[/!] esquerda()[!java|c];[/!] direita()[!java|c];[/!]

source: The <b>mark</b> button is a bit particular, since it correspond to two methods: the first one moves the pen up while the second moves it down.
pt_br: O botão <b>marcar</b> é diferente, pois corresponde a dois métodos: o primeiro move a caneta para cima e o segundo move a caneta para baixo.

source: brushUp()[!java|c];[/!] brushDown()[!java|c];[/!]
pt_br: levantarPincel()[!java|c];[/!] abaixarPincel()[!java|c];[/!]

source: The buggle offers other methods, that are presented from the "Help/about this world" menu and will be introduced on need.
pt_br: O buggle tem outros métodos, que estão no menu "Ajuda/sobre este mundo" e serão introduzidos quando forem necessários.

source: Exercise goal
pt_br: Objetivo do exercício

source: <a name="Objectives"/> Our second program will be a bit more complicated, but not much. The goal for your buggle is simply to draw a house (a box), and hide inside. Check the objective world to see exactly what this means.
pt_br: <a name="Objectives"/> nosso segundo programa será um pouco mais complicado, mas não muito. O objetivo é que seu buggle simplesmente desenhe uma casa (um quadrado), e se esconda dentro. Verifique o mundo objetivo para ver exatamente o que isto significa.

source: Use your brush to mark the ground as you walk. Start marking the ground with <code>brushDown()</code>, and stop it with <code>brushUp()</code> afterward (e.g., to enter your house without marking its ground). The full list of all instructions understood by your buggle can be found in "Help/About this world".
pt_br: Use seu pincel para marcar o chão à medida em que anda. Comece a marcar o chão com <code>brushDown()</code>, e pare com <code>brushUp()</code> (e.g., para entrar na sua casa sem marcar o chão). A lista completa de todas as instruções que o buggle entende pode ser encontrada em "Ajuda/Sobre este mundo".

source: After this exercise
pt_br: Depois deste exercício

source: When switching to the next exercise, please note that there is a sub-exercise following this one. By default, it is hidden in the menu and you have to open the sub-menu to see it. When you switch the exercise, most of the exercises are hidden because the tree is folded, as follows:
pt_br: Quando for para o próximo exercício, observe que existe um sub-exercício depois deste. Por padrão, ele fica escondido no menu e você tem que abrir o sub-menu para vê-lo. Quando você troca de exercício, a maioria dos exercícios fica escondida por que a árvore está recolhida, como segue:

source: You have to click on the little symbol to the left of the buggle to unfold the tree, as follows:
pt_br: Você tem que clicar no pequeno símbolo a esquerda do buggle para expandir a árvore, como segue:

source: Now that we know how to draw things on the board, we'll enjoy this ability and draw a beautiful G on the board (check Objective panel for details on what is expected).
pt_br: Agora que nós sabemos como desenhar coisas no tabuleiro, vamos aproveitar esta habilidade e desenhar um belo G (Veja o painel de Objetivo para detalhes).

source: When you write a quite complex program, it is sometimes useful to <b>add comments</b> to simplify the code reviews afterward. Here for example, it's quite easy to get lost in the drawing process, and you may want to add comments like <i>vertical bar done</i> or <i>finished drawing the G. Time to move back to initial position</i>. Commenting your code is almost mandatory if you (or someone else) want to read it afterward, although over-commenting (describing obvious stuff) is a bad idea as the important idea get lost in the noise.
pt_br: Quando você escreve um programa bem complexo, por vezes é útil <b>adicionar comentários</b> para simplificar uma posterior revisão do código. Aqui, por exemplo, é fácil se perder no processo de desenho, e você pode querer adicionar comentários como <i>barra vertical desenhada</i> ou <i>terminei de desenhar o G. hora de voltar para posição inicial</i>. Comentar seu código é quase obrigatório se você (ou mais alguém) quiser lê-lo depois, embora comentar demais (descrevendo coisas óbvias) é ruim pois as ideias importantes se perdem no meio do ruído.

source: There is [!java]three[/!][!python|scala|c]two[/!] types of comments in [!thelang], instructing the [!java|scala|c]compiler[/!][!python]interpreter[/!] to not read the text you add for humans:
pt_br: Existem [!java]três[/!][!python|scala|c]dois[/!] tipos de comentários em [!thelang], que instruem o [!java|scala|c]compilador[/!][!python]interpretador[/!] a não ler o texto que você adiciona para humanos:

source: <b>Comments on a single line</b>. When the [!java|scala|c]compiler[/!][!python]interpreter[/!] encounters the symbol [!java|scala|c]//[/!][!python]#[/!], it ignores the end of the line.
pt_br: <b>Comentários de uma única linha</b>. Quando o [!java|scala|c]compilador[/!][!python]interpretador[/!] encontra o símbolo [!java|scala|c]//[/!][!python]#[/!], ele ignora o resto da linha.

source: <b>Comments on several lines</b>. The [!java|scala|c]compiler[/!][!python]interpreter[/!] ignores anything placed between [!java|scala|c]the symbols /* and */ even if they are placed on differing lines.[/!] [!python]a line beginning with ''' until the next line ending with '''.[/!]
pt_br: <b>Comentários em várias linhas</b>. O [!java|scala|c]compilador[/!][!python]interpretador[/!] ignora tudo entre [!java|scala|c]os símbolos /* e */ mesmo quando eles são postos em linhas diferentes.[/!] [!python]uma linha comaçando com ''' até a próxima linha terminado com '''.[/!]

source: methodCallReadByThe[!java|scala|c]Compiler[/!][!python]Interpreter[/!]()[!java|c];[/!] <span class="comment">[!java|scala|c]//[/!][!python]#[/!] all this is ignored</span> otherCall()[!java|c];[/!] [!java|scala|c]<span class="comment">/* This is</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span class="comment"> also ignored */</span>[/!] [!python]<span class="comment">''' This is</span> <span class="comment">also ignored '''</span>[/!] yetAnotherCall()[!java|c];[/!]
pt_br: chamadaDeMétodoLidaPelo[!java|scala|c]Compilador[/!][!python]Interpretador[/!]()[!java|c];[/!] <span class="comment">[!java|scala|c]//[/!][!python]#[/!] tudo isto é ignorado</span> outraChamada()[!java|c];[/!] [!java|scala|c]<span class="comment">/* Isto aqui</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span class="comment"> também é ignorado */</span>[/!] [!python]<span class="comment">''' Isto aqui</span> <span class="comment">também é ignorado '''</span>[/!] maisUmaChamada()[!java|c];[/!]

source: There is a third kind of comments in Java, between /** and */, which are read by a specific program called JavaDoc to generate automatically the documentation explaining how to use the code. These comments must follow a very precise formalism.
pt_br: Existe um terceiro tipo de comentário em Java, entre /** e */, que é lido por um programa específico chamado JavaDoc para gerar automaticamente a documentação explicando como usar o código. Estes comentários devem seguir um formalismo bem preciso.

source: The comments on several lines are often used to document how to use the code, while others are more used to describe how this code works.
pt_br: Os comentários de várias linhas são frequentemente usados para documentar como usar o código, enquanto os outros são usados para descrever como este código funciona.

source: Programs made of simple suite of instructions similar to previous exercise are quite boring. They always do the same thing, and cannot react to external conditions. A <b>conditional</b> let the program adapt by doing something like <i>if it's raining, take an umbrella</i>.
pt_br: Programas feitos simplesmente de um conjunto de instruções similares ao do exercício anterior são bastante chatos. Eles sempre fazem a mesma coisa, e não reajem a condições externas. Um <b>condicional</b> faz o programa se adaptar fazendo coisas do tipo <i>se está chovendo, pegue um guarda-chuva</i>.

source: The [!thelang] syntax is the following:
pt_br: A sintaxe de [!thelang] é a seguinte:

source: [!java|scala|c]if (<b>condition</b>) { &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoIfTrue();</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoNextIfTrue();</b> }[/!][!python]if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoIfTrue()</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoNextIfTrue()</b>[/!] <b>whatToDoAnyway()[!java|c];[/!]</b>
pt_br: [!java|scala|c]if (<b>condição</b>) { &nbsp;&nbsp;&nbsp;&nbsp;<b>oQueFazerSeForVerdade();</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>oQueFazerDepoisSeForVerdade();</b> }[/!][!python]if <b>condição</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>oQueFazerSeForVerdade()</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>oQueFazerDepoisSeForVerdade()</b>[/!] <b>oQueFazerDeUmJeitoOuDeOutro()[!java|c];[/!]</b>

source: If the condition is true, the code of the next block will be executed and then it will continue with the rest of the code. If the condition is false, the next block is ignored and the execution continues after it. The conditional block can contain several instructions, it can even contain other tests, along with their sub-blocks.
pt_br: Se a condição for verdade, o código do próximo bloco será executado e então o resto do código continua. Se a condição for falsa, o próximo bloco é ignorado e a execução continua depois disto. O bloco condicional pode conter várias instruções, pode até mesmo conter outros testes, com seus próprios sub-testes.

source: In this example, the instructions <code>whatToDoIfTrue()</code> and <code>whatToDoNextIfTrue()</code> will be executed if and only if the condition is true, while the instruction <code>whatToDoAnyway()</code> will be executed whether or not the condition is true.
pt_br: Neste exemplo, as instruções <code>oQueFazerSeForVerdade()</code> e <code>oQueFazerDepoisSeForVerdade()</code> serão executadas se e somente se a condição for verdadeira, mas a instrução <code>oQueFazerDeUmJeitoOuDeOutro()</code> vai ser executada se a condição for verdadeira ou não.

source: In [!thelang], the blocks of code are [!java|scala|c]enclosed between curly brackets: a { sign opens the block, while a } sign closes it. White spaces are not important[/!][!java|c].[/!][!scala], provided that your instructions are still separated with a semi-column or an end of line.[/!] [!java|scala|c]It is still very important to correctly indent your code to keep it readable.[/!] [!python]marked by the indentation: every lines that are a bit shifted to the right with white spaces belong to the block. Quite often, people use 4 spaces for indentation, but it works if you use more or less spaces. Simply, any lines of the block must use the same amount of spaces. The end of Python code blocks are not marked by any specific char. Indenting lines starts a block and unindenting ends it. Do not forget the colon (:) at the end of the <code>if</code> line, python needs it to know that a new block begins. The fact that python relies on indentation to delimit blocks is a very good property for beginners: it will force you to adhere to strict code presentation standards.[/!] It is very easy to get lost in your own code if it's not properly indented, so you want to clean it up so that working on your code remains pleasant and productive.
pt_br: Em [!thelang], os blocos de código são [!java|scala|c]envolvidos entre chaves: um { abre o bloco, e um } fecha. Espaços em branco não são importantes[/!][!java|c].[/!][!scala], uma vez que suas instruções ainda estejam separadas com um ponto-e-vírgula ou um fim-de-linha.[/!] [!java|scala|c]Ainda assim é muito importante indentar corretamente seu código para mantê-lo legível.[/!] [!python]marcados pela indentação: todas as linhas que estiverem um pouco deslocadas para a direita com espaços pertencem ao bloco. Frequentemente se usam 4 espaços para indentação, mas funciona se você usar mais ou menos espaços. Resumindo, quaisquer linhas do bloco devem usar a mesma quantidade de espaços. O fim do bloco de código Python não é marcado por nenhum caractere específico. Indentar linhas começa um bloco e parar de indentar termina o bloco. Não esqueça do dois-pontos (:) no final da linha do <code>if</code>, python precisa dele para saber que um novo bloco vai começar. O fato de que python se baseia em indentação para delimitar blocos é uma ótima propriedade para iniciantes: vai forçar você a aderir a padrões de apresentação de código estritos.[/!] É muito fácil se perder no seu próprio código se ele não for corretamente indentado, então você precisa deixar ele bem arrumado para que trabalhar nele continue sendo agradável e produtivo.

source: All indentations of a given block must be consistent, and it is not possible to cut a block. The two following codes are incorrect and will raise errors.
pt_br: Todas as indentações de um dado bloco devem ser consistentes, e não é possível cortar um bloco. os dois códigos a seguir estão incorretos e devem resultar em erro.

source: if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDo()</b> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoNext()</b> <span class="comment"># one space too much </span> <b>whatToDoAnyway()</b>
pt_br: if <b>condição</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>oQueFazer()</b> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>oQueFazerDepois()</b> <span class="comment"># um espaço a mais </span> <b>oQueFazerDeUmJeitoOuDeOutro()</b>

source: if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDo()</b> <b>whatToDoAnyway()</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoNext()</b> <span class="comment"># this block is not hanging to a condition line</span>
pt_br: se <b>condição</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>oQueFazer()</b> <b>oQueFazerDeUmJeitoOuDeOutro()</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>oQueFazerASeguir()</b> <span class="comment"># este bloco não está condicionado a uma linha de condição</span>

source: The condition must be a <code>[!c]int[/!][!java]boolean[/!][!scala|python]Boolean[/!]</code> expression. The inner block of code will get executed if the expression is evaluated to <code>[!c]1[/!][!java|scala]true[/!][!python]True[/!]</code> and it will be ignored if it is <code>[!c]0[/!][!java|scala]false[/!][!python]False[/!]</code>. [!python|scala|java]<code>[!java|scala]true[/!][!python]True[/!]</code> and <code>[!java|scala]false[/!][!python]False[/!]</code> are constant values defined by [!thelang] directly, just as 0 or 1 in mathematics.[/!]
pt_br: A condição deve ser uma expressão <code>[!c]int[/!][!java]boolean[/!][!scala|python]Boolean[/!]</code>. O bloco interno do código será executado se a expressão for calculada como <code>[!c]1[/!][!java|scala]true[/!][!python]True[/!]</code> e será ignorado se for <code>[!c]0[/!][!java|scala]false[/!][!python]False[/!]</code>. [!python|scala|java]<code>[!java|scala]true[/!][!python]True[/!]</code> e <code>[!java|scala]false[/!][!python]False[/!]</code> são valores constantes definidos por [!thelang] diretamente, assim como 0 ou 1 na matemática.[/!]

source: The condition can be a <code>[!c]int[/!][!java]boolean[/!][!scala|python]Boolean[/!]</code> variable (we will come back on variables in a later exercise, don't worry) or an arithmetic test, such as <code>x == 5</code>, which checks whether the current value of <code>x</code> is 5, or such as <b>!=</b> (checking inequality, that is, returning [!c]1[/!][!java|scala]true[/!][!python]True[/!] only if the left-hand side is different from the right-hand side), <b>&lt;</b> (smaller than), <b>&gt;</b> (larger than), <b>&lt;=</b> (smaller or equal to), <b>&gt;=</b> (larger or equal to).
pt_br: A condição pode ser uma variável <code>[!c]int[/!][!java]boolean[/!][!scala|python]Boolean[/!]</code> (vamos voltar a falar de variáveis num próximo exercício, não se preocupe) ou um teste aritmético, como <code>x == 5</code>, que verifica se o valor atual de <code>x</code> é 5, ou algo como <b>!=</b> (verificando inequação, ou seja, retornando [!c]1[/!][!java|scala]true[/!][!python]True[/!] apenas se o lado esquerdo é diferente do lado direito), <b>&lt;</b> (menor que), <b>&gt;</b> (maior que), <b>&lt;=</b> (menor ou igual a), <b>&gt;=</b> (maior ou igual a).

source: Beware of the classical trap, which consists in testing the equality of a variable using = instead of ==. Hopefully, the [!java|scala|c]compiler[/!][!python]interpreter[/!] detects this problem most of the time, but it could get trapped is some cases (such as when you are affecting a [!c]int[/!][!java|python|scala]boolean[/!] variable). So you'd better to be careful...
pt_br: Cuidado com um erro clássico, que é verificar a igualdade da variável usando = no lugar de ==. Ainda bem que o [!java|scala|c]compilador[/!][!python]interpretador[/!] detecta este problema na maior parte das vezes, mas às vezes passa (como quando você está atribuindo valor a uma variável [!c]int[/!][!java|python|scala]booleana[/!]). Então é bom ter cuidado...

source: The condition can also be a call to some particular methods returning a boolean. For example, the <code>isFacingWall()</code> method of the buggle returns [!c]1[/!][!java|python|scala]true[/!] if the buggle is facing a wall, and [!c]0[/!][!java|python|scala]false[/!] in the other case.
pt_br: A condição pode também ser uma chamada para alguns métodos particulares que retornam booleano. Por exemplo, o método <code>estáDeFrenteParaParede()</code> do buggle retorna [!c]1[/!][!java|python|scala]true[/!] se o buggle está olhando para uma parede, e false caso contrário.

source: Finally, a condition can be composed of several sub-conditions connected by boolean operations:
pt_br: Finalmente, uma condição pode ser composta de várias sub-condições conectadas por operadores booleanos:

source: <code>cond1 [!java|scala|c]&&[/!][!python]and[/!] cond2</code> is true when <tt>cond1</tt> <b>and</b> <tt>cond2</tt> are both true (if <tt>cond1</tt> is false, <tt>cond2</tt> is not even evaluated as we already know that the conjunction of both propositions cannot be true).
pt_br: <code>cond1 [!java|scala|c]&&[/!][!python]and[/!] cond2</code> é verdadeiro (true) quando <tt>cond1</tt> <b>e</b> <tt>cond2</tt> são ambos verdadeiros (se <tt>cond1</tt> é falso (false), <tt>cond2</tt> não é nem sequer calculado pois sabe-se previamente que a conjunção das duas proposições não pode ser verdadeira).

source: <code>cond1 [!java|scala|c]||[/!][!python]or[/!] cond2</code> is true if <tt>cond1</tt> <b>or</b> <tt>cond2</tt> is true (if <tt>cond1</tt> is true, <tt>cond2</tt> is not even evaluated as we already know that the disjunction of both propositions cannot be false).
pt_br: <code>cond1 [!java|scala|c]||[/!][!python]or[/!] cond2</code> é verdadeiro se <tt>cond1</tt> <b>ou</b> <tt>cond2</tt> é verdadeiro (se <tt>cond1</tt> é verdadeiro, <tt>cond2</tt> não é nem sequer calculada pois já se sabe que a disjunção de ambas as proposições não pode ser verdadeira).

source: <code>[!java|scala|c]![/!][!python]not [/!]cond</code> is true if <tt>cond</tt> is false.
pt_br: <code>[!java|scala|c]![/!][!python]not [/!]cond</code> é verdadeira se <tt>cond</tt> é falsa.

source: When the expression becomes complicated, it is better to add parenthesis to force the order of evaluation. Do not hesitate to add more parenthesis to remove any ambiguities that may appear in an expression.
pt_br: Quando a expressão se torna complicada, é melhor adicionar parêntesis para forçar a ordem de cálculo. Não hesite em adicionar mais parêntesis para remover ambiguidades que apareçam na expressão.

source: Last, it is possible to specify what to do when the condition is false using the following syntax. In this case, the instruction <code>whatToDoIfItsFalse</code> will be executed only if the condition is false.
pt_br: Por fim, é possível especificar o que fazer quando a condição é falsa usando a seguinte sintaxe. Neste caso, a instrução <code>oQueFazerSeForFalso</code> será executada apenas se a condição for falsa.

source: [!java|scala|c]if (<b>condition</b>) { &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoIfTheConditionIsTrue();</b> } else { &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoIfItsFalse();</b> }[/!][!python]if (<b>condition</b>): &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoIfTheConditionIsTrue()</b> else: &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoIfItsFalse()</b>[/!]
pt_br: [!java|scala|c]if (<b>condição</b>) { &nbsp;&nbsp;&nbsp;&nbsp;<b>oQueFazerSeCondiçãoÉVerdadeira();</b> } else { &nbsp;&nbsp;&nbsp;&nbsp;<b>oQueFazerSeForFalsa();</b> }[/!][!python]if (<b>condição</b>): &nbsp;&nbsp;&nbsp;&nbsp;<b>oQueFazerSeCondiçãoÉVerdadeira()</b> else: &nbsp;&nbsp;&nbsp;&nbsp;<b>oQueFazerSeForFalsa()</b>[/!]

source: Don't forget the colon (:) after the else, it is indicating that a new block is beginning.
pt_br: Não esqueça do dois-pontos (:) depois do else, ele indica que um novo bloco está começando.

source: <a name="Objectives"/> If the buggle is facing a wall, you must move one step back. If not, you must move one step forward. To detect whether you are facing a wall, simply use the <code>isFacingWall()</code> built-in, that every buggle understands.
pt_br: <a name="Objectives"/> Se o buggle está de cara numa parede, você deve se mover um passo para trás. Se não, você deve se mover um passo para frente. para detectar se você está de cara para uma parede, simplesmente use a função pré-fabricada <code>estáDeFrenteParaParede()</code>, que todo buggle entende.

source: This exercise is a bit different: your code has to work for several buggles, each of them being in a specific initial condition. The same code will be executed for each of them.
pt_br: Este exercício é um pouco diferente: seu código tem que funcionar para vários buggles, cada um começando numa posição diferente. O mesmo código será executado para cada um deles.

source: When your program works, move forward to the next exercise, that is hidden in a sub-tree of the selection window.
pt_br: Quando seu programa funcionar, vá para o próximo exercício, que está escondido numa sub-árvore da janela de seleção.

source: In addition to conditionals, another handy construction is the ability to repeat an action while a specific condition does not appear. A while loop is used for that, with the following syntax.
pt_br: Além dos condicionais, outra construção bem útil é a habilidade de repetir uma ação enquanto uma condição específica não acontece. Um loop 'while' é usado para isto, com a seguinte sintaxe.
