Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: Move forward of the desired length Draw (recursively) the right subtree Draw (recursively) the left subtree Move back to your initial position
pt_br: Mova para a frente no comprimento desejado Desenhe (recursivamente) a sub-árvore da direita Desenhe (recursivamente) a sub-árvore da esquerda Mova para trás para a posição inicial

source: Don't forget to add the base case to your code, or your buggle will enter an infinite loop. Then, drawing the right subtree comes down to turn right and then draw the subtree.
pt_br: Não esqueça de adicionar o caso base a seu código, ou seu buggle vai entrar num loop infinito. Então, desenhar a sub-árvore da direita é virar a direita e desenhar a sub-árvore.

source: As you can see, each recursion level is represented by a distinctive color. For that, you have to call the <code>current(step)</code>, passing the current recursion level as a parameter. This will pick the right color for you. Don't erase your great colors when you move back to your initial location.
pt_br: Como você pode ver, cada nível de recursão é representado por uma cor diferente. Para isto, você tem que chamar o <code>current(step)</code>, passar o nível de recursão atual como parâmetro. Isto vai pegar a cor certa para você. Não apague suas belas cores quando se mover de volta para sua posição inicial.

source: If you get your function wrong, this can easily become hairly to debug as your errors will appear at each level of the recursion, completely changing the drawing. For debugging purpose, you can use the <code>subtree()</code> that will draw a correct subtree. This function is then very similar to the one you are trying to write. The only difference is that <code>subtree()</code> only draws in black. So, you can use it instead of a recursive call to debug your code, but you have to change for a proper recursive call to your own code (once it works) to get the colors right, and pass the exercise.
pt_br: Se você fizer a função errado, pode rapidamente ficar muito difícil de depurar pois os erros vão aparecer em cada nível da recursão, mudando completamente o desenho. Por questões de depuração, você pode usar o <code>subtree()</code> que vai desenhar uma sub-árvore corretamente. Esta função é portanto muito similar àquela que você está tentando escrever. A única diferença é que <code>subtree()</code> apenas desenha em preto. Logo, você pode usar ela no lugar da chamada recursiva para depurar seu código, mas você vai ter que mudar para uma chamada recursiva adequada no seu próprio código (uma vez que funcione) para obter as cores certas, e passar no exercício.

source: Sierpinski's Triangle
pt_br: Triângulo de Sierpinski

source: The fractal we will now draw is formed of a big triangle inside which several smaller triangles are embedded. The prototype of the function to draw it is the following:
pt_br: O fractal que vamos desenhar é formado de um grande triângulo dentro do qual há vários pequenos triângulos. O protótipo da função que desenha isto é o seguinte:

source: [!java|c]void [/!]sierpinski([!java|c]int [/!]level[!scala]:Int[/!], [!java|c]double [/!]length[!scala]:Double[/!])
pt_br: [!java|c]void [/!]sierpinski([!java|c]int [/!]nível[!scala]:Int[/!], [!java|c]double [/!]comprimento[!scala]:Double[/!])

source: Have a look at each world's objective view to understand how to write the function. To draw one side of the triangle, draw a smaller recursive triangle (halve the length) and move forward by the requested length. Globally, you have to draw 3 such sides and turn by 120 between each side.
pt_br: Dê uma olhada em cada uma das visões do mundo objetivo para entender como escrever a função. Para desenhar um lado do triângulo, desenhe um triângulo recursivo menor (metade do comprimento) e mova para a frente no comprimento desejado. Globalmente, você tem que desenhar 3 destes lados e girar 120 graus entre cada lado.

source: Spirals
pt_br: Espirais

source: We will now draw our first recursive function with the turtle. The goal is to draw different kind of spirals with the same function, which prototype is the following:
pt_br: Vamos agora desenhar nossa primeira função recursiva com a tartaruga. O objetivo é desenhar diferentes tipos de espirais com a mesma função, cujo protótipo é o seguinte:

source: [!java|c]void [/!]spiral([!java|c]int [/!]steps[!scala]:Int[/!], [!java|c]int [/!]angle[!scala]:Int[/!], [!java|c]int [/!]length[!scala]:Int[/!], [!java|c]int [/!]increment[!scala]:Int[/!])
pt_br: [!java|c]void [/!]espiral([!java|c]int [/!]passos[!scala]:Int[/!], [!java|c]int [/!]ângulo[!scala]:Int[/!], [!java|c]int [/!]comprimento[!scala]:Int[/!], [!java|c]int [/!]incremento[!scala]:Int[/!])

source: To help you understanding how to write it, here is an example of how the parameters change during one specific call:
pt_br: Para ajudar a entender como escrever isto, aqui está um exemplo de como os parâmetros mudam durante uma chamada específica:

source: spiral(5, 90, 0, 3); forward(0); left(90); spiral(4,90,3,3); forward(3); left(90); spiral(3,90,6,3); forward(6); left(90); spiral(2,90,9,3); forward(9); left(90); spiral(1,90,12,3); forward(12); left(90); spiral(0,90,12,3);
pt_br: espiral(5, 90, 0, 3); avançar(0); esquerda(90); espiral(4,90,3,3); avançar(3); esquerda(90); espiral(3,90,6,3); avançar(6); esquerda(90); espiral(2,90,9,3); avançar(9); esquerda(90); espiral(1,90,12,3); avançar(12); esquerda(90); espiral(0,90,12,3);

source: Drawing spirals
pt_br: Desenhando espirais

source: This exercise is not really an exercise in that sense that you just have to click on the Execute button to get the reward: All the needed code is already provided. Instead, you can here explore the possibilities of the code you just wrote by changing the parameters of the call to the <code>spiral</code> function. You can move on to the next exercise if you are short on time, and come back later to play around.
pt_br: Este exercício não é realmente um exercício pois você tem que simplesmente clicar no botão Rodar para ter uma recompensa: todo o código necessário já está pronto. Na verdade, você pode explorar as possibilidades do código que você acabou de escrever mudando os parâmetros da chamada da função <code>spiral</code>. Você pode mover para o próximo exercício se estiver com pressa, e voltar depois para experimentar este.

source: Here are some of the figures that you can produce with your <code>Spiral</code> function, provided that you come with the right parameters. You can switch to the creative mode (from the Exercise menu) to disable the world comparison when you explore with these spirals.
pt_br: Aqui estão algumas figuras que você pode produzir com sua função <code>Spiral</code>, dado que você passe os parâmetros certos. Você pode trocar para o modo criativo (do menu Exercício) para desabilitar a comparação de mundos quando estiver explorando com estas espirais.

source: If you discover a cool figure, don't forget to send your parameters (menu Help/feedback) so that we can add it to the list!
pt_br: Se você descobrir uma figura legal, não esqueça de enviar seus parâmetros (menu Ajuda/"Dizer o que achou") para que possamos adicionar a esta lista!

source: Dragon curve (1)
pt_br: Curva do Dragão (1)

source: The dragon curve is a classical example of recursive method.
pt_br: A curva do dragão é um exemplo clássico de método recursivo.

source: The definition of this curve is the following:
pt_br: A definição desta curva é a seguinte:

source: the dragon curve of order 1 is a vector between to arbitrary points P and Q,
pt_br: A curva do dragão de ordem 1 é um vetor entre dois pontos P e Q arbitrários,

source: the dragon curve of order n is the dragon curve of order n-1 between P and R, followed by the same curve of order n-1 between Q and R, where PRQ is an isosceles triangle with angle R being a right angle, and R being at the right of the PQ vector. Thus, if P and Q coordinates are (x, y) and (z, t), the coordinate (u, v) of R are given by:
pt_br: A curva do dragão de ordem n é a curva do dragão de ordem n-1 entre P e R, seguida da mesma curva de ordem n-1 entre Q e R, onde PRQ é um triângulo isósceles com o ângulo em R sendo um ângulo reto, e R situado a direita do vetor PQ. Logo, se as coordenadas P e Q são (x, y) e (z, t), as coordenadas (u, v) de R são dadas por:

source: The prototype of the method drawing the curve is the following:
pt_br: O protótipo do método desenhando a curva é o seguinte:

source: [!java|c]void [/!]dragon([!java|c]int [/!]order[!scala]:Int[/!], [!java|c]double [/!]x[!scala]:Double[/!], [!java|c]double [/!]y[!scala]:Double[/!], [!java|c]double [/!]z[!scala]:Double[/!], [!java|c]double [/!]t[!scala]:Double[/!])
pt_br: [!java|c]void [/!]dragão([!java|c]int [/!]ordem[!scala]:Int[/!], [!java|c]double [/!]x[!scala]:Double[/!], [!java|c]double [/!]y[!scala]:Double[/!], [!java|c]double [/!]z[!scala]:Double[/!], [!java|c]double [/!]t[!scala]:Double[/!])

source: You should use the method <code>setPos(x,y)</code> to put your turtle at coordinates (x,y) and the method <code>moveTo(z,t)</code> to draw a line between the turtle position and the point(z,t).
pt_br: Você deve usar o método <code>setPos(x,y)</code> para colocar sua tartaruga nas coordenadas (x,y) e o método <code>moveTo(z,t)</code> para desenhar uma linha entre a posição da tartaruga e o ponto (z,t).

source: The dragon curve (2)
pt_br: A curva do dragão (2)

source: Previous solution induce that the turtle teleports to other location, or at the very least, that it moves its pen up during the drawing. Indeed, the end of the drawing of the first recursive call does not match the beginning of the second recursive call. That is why we had to use the method <code>setPos()</code>
pt_br: A solução anterior "induz" que a tartaruga se teletransporta para outro local, ou pelo menos, que ela levanta a caneta durante o desenho. Na verdade, o final do desenho da primeira chamada recursiva não coincide com o começo da segunda chamada recursiva. É por isto que nós temos que usar o método <code>setPos()</code>

source: In this lesson, you will write a recursive method allowing to draw the dragon curve without taking the pen up. For that, we need another recursive method drawing the mirror side of the curve.
pt_br: Nesta lição, você vai escrever um método recursivo que permita desenhar a curva do dragão sem levantar a caneta. Para isto, precisamos de outro método recursivo que desenhe o lado espelhado da curva.

source: The method <code>dragon()</code> is then recursively defined using itself and <code>dragonReverse()</code>. Likewise, the method <code>dragonReverse()</code> is defined recursively using itself and <code>dragon()</code>. This is thus an example of <i>mutual recursion</i>.
pt_br: O método <code>dragon()</code> é então definido recursivamente usando ele próprio e <code>dragonReverse()</code>. Da mesma forma, o método <code>dragonReverse()</code> é definido recursivamente usando ele próprio e <code>dragon()</code>. Este é, portanto, um exemplo de <i>recursão mútua</i>.

source: The prototype of the <code>dragon()</code> method remains unchanged from previous exercise:
pt_br: O protótipo do método <code>dragon()</code> é o mesmo do exercício anterior:

source: The new point's coordinate (u, v) introduced by the <code>dragon()</code> are:
pt_br: A coordenada do novo ponto (u, v) introduzida pelo <code>dragon()</code> é:

source: The prototype of the method <code>dragonReverse</code> is similar:
pt_br: O protótipo do método <code>dragonReverse</code> é similar:

source: [!java|c]void [/!]dragonReverse([!java|c]int [/!]order[!scala]:Int[/!], [!java|c]double [/!]x[!scala]:Double[/!], [!java|c]double [/!]y[!scala]:Double[/!], [!java|c]double [/!]z[!scala]:Double[/!], [!java|c]double [/!]t[!scala]:Double[/!])
pt_br: [!java|c]void [/!]inverterDragão([!java|c]int [/!]order[!scala]:Int[/!], [!java|c]double [/!]x[!scala]:Double[/!], [!java|c]double [/!]y[!scala]:Double[/!], [!java|c]double [/!]z[!scala]:Double[/!], [!java|c]double [/!]t[!scala]:Double[/!])

source: The new point's coordinate (u, v) introduced by the <code>dragonReverse()</code> are:
pt_br: A coordenada do novo ponto (u, v) introduzida pelo <code>dragonReverse()</code> é:

source: To make the work of each method recursiv more visible, the line painted by the <code>dragon()</code> must be red (<code>Color.red</code>) while the line painted by the <code>dragonReverse()</code> must be blue (<code>Color.blue</code>).
pt_br: Para deixar o trabalho de cada um dos dois métodos recursivos mais visível, a linha pintada pelo <code>dragon()</code> deve ser vermelha (<code>Color.red</code>) enquanto que a linha pintada pelo <code>dragonReverse()</code> deve ser azul(<code>Color.blue</code>).

source: Hanoi towers
pt_br: Torres de Hanoi

source: Here comes the super classical exercise on recursion along with some variations. If you have any other nice variations, please submit them. At some point, someone should also probably contribute these variations to wikipedia, as only the base problem is nicely described there.
pt_br: Aqui está o exercício super-clássico sobre recursão junto com algumas variações. Se você tiver quaisquer outras variações legais, favor envie elas. Em algum momento, alguém deve enviar estas variações também para a wikipédia, pois por enquanto apenas o problema básico é descrito lá.

source: The Interleaved and Split variations come from the following article: "Exploring Recursion with Variations on the Towers of Hanoi", Daniel W. Palmer. Available at http://www.ccscjournal.willmitchell.info/Vol12-96/No2a/Daniel%20W%20Palmer.pdf
pt_br: As variações intercalada e separada vêm do seguinte artigo: "Exploring Recursion with Variations on the Towers of Hanoi", Daniel W. Palmer. Available at http://www.ccscjournal.willmitchell.info/Vol12-96/No2a/Daniel%20W%20Palmer.pdf

source: The Linear Hanoi is briefly discussed in the article presenting the Linear Twin Towers of Hanoi: "The Linear Twin Towers of Hanoi Problem", Steven Minsker (ACM SIGCSE Bulletin Volume 39 Issue 4, December 2007). This article can only be accessed through the paywall of the editor, sorry.
pt_br: Hanoi linear é discutida rapidamente na artigo apresentando as Torres Gêmeas Lineares de Hanoi: "The Linear Twin Towers of Hanoi Problem", Steven Minsker (ACM SIGCSE Bulletin Volume 39 Issue 4, December 2007). Este artigo só pode ser acessado através da via paga do editor, desculpe.

source: The 3-colors Towers of Hanoi problem was presented on this web page: http://www.cut-the-knot.org/recurrence/TricolorHanoiAuto.shtml
pt_br: O problema das Torres de Hanoi de 3 cores foi apresentado nesta página: http://www.cut-the-knot.org/recurrence/TricolorHanoiAuto.shtml

source: The Cyclic Towers of Hanoi was proposed by M.D. Atkinson in an article of 1981 titled "The cyclic towers of Hanoi" (Information Processing Letters, Volume 13:3). The article is available at http://www.cs.otago.ac.nz/staffpriv/mike/Papers/Hanoi/CyclicHanoi.pdf.
pt_br: As Torres de hanoi cíclicas foram propostas por M.D. Atkinson num artigo de 1981 intitulado "The cyclic towers of Hanoi" (Information Processing Letters, Volume 13:3). O artigo está disponível em http://www.cs.otago.ac.nz/staffpriv/mike/Papers/Hanoi/CyclicHanoi.pdf.

source: Here comes the super classical exercise on recursion.
pt_br: Aqui está o exercício super-clássico de recursão.

source: This is an application exercise of recursion, that you should master to take this lesson.
pt_br: Este é um exercício de aplicação em recursão, que você deve dominar para fazer esta lição.

source: Tower of Hanoi
pt_br: Torre de Hanoi

source: The Tower of Hanoi or Towers of Hanoi, also called the Tower of Brahma or Towers of Brahma, is a mathematical game or puzzle. It consists of three pegs, and a number of disks of different sizes which can slide onto any peg. The puzzle starts with the disks in a neat stack in ascending order of size on one peg, the smallest at the top, thus forming a pyramid.
pt_br: A Torre de Hanoi (ou Torres de Hanoi), também conhecida como Torre de Brahma (ou Torres de Brahma), é um quebra-cabeça ou jogo matemático. Consiste de três varas, e uma quantidade de discos de tamanhos diferentes que podem encaixar em qualquer das varas. O jogo começa com os discos todos em uma vara ordenados em ordem crescente, o menor em cima, formando uma pirâmide.

source: The objective of the puzzle is to move the entire stack to another peg, obeying the following rules:
pt_br: O objetivo do jogo é mover a pilha completa para outra vara, obedecendo as seguintes regras:

source: Only one disk may be moved at a time.
pt_br: Apenas um disco pode ser movido por vez.

source: Each move consists of taking the upper disk from one of the pegs and sliding it onto another peg, on top of the other disks that may already be present on that peg.
pt_br: Cada movimentação consiste em pegar o disco de cima de uma vara e colocá-lo em outra vara, no topo dos discos que já estiverem presentes.

source: No disk may be placed on top of a smaller disk.
pt_br: Nenhum disco pode ser colocado sobre um disco menor.

source: Write the core of the method: <code>[!java|c]void [/!]hanoi[!c]Rec[/!]([!java|c]int [/!]height[!scala]:Int[/!], [!java|c]int [/!]src[!scala]:Int[/!], [!java|c]int [/!]other[!scala]:Int[/!],[!java|c]int [/!]dst[!scala]:Int[/!])</code>
pt_br: Escreva o núcleo do método: <code>[!java|c]void [/!]hanoi[!c]Rec[/!]([!java|c]int [/!]height[!scala]:Int[/!], [!java|c]int [/!]src[!scala]:Int[/!], [!java|c]int [/!]other[!scala]:Int[/!],[!java|c]int [/!]dst[!scala]:Int[/!])</code>

source: This method will recursively solve the presented problem. The first parameter named <code>height</code> is the height of the tower to move; The second parameter <code>src</code> is the index of the initial tower, the third parameter <code>other</code> is the index of the unused peg while the fourth parameter <code>dst</code> is the index of the expected final tower.
pt_br: Este método vai, recursivamente, resolve o problema apresentado. O primeiro parâmetro chamado <code>height</code> é a altura da torre a mover; o segundo parâmetro <code>src</code> é o índice da torre inicial, o terceiro parâmetro <code>other</code> é o índica da vara não utilizada enquanto que o quarto parâmetro <code>dst</code> é o índice da torre final experada.

source: A key to solving this puzzle is to recognize that it can be solved by breaking the problem down into a collection of smaller problems and further breaking those problems down into even smaller problems until a solution is reached.
pt_br: O segredo para resover este enigma é reconhecer que ele pode ser dividido em problemas menores e este em problemas menores até que uma solução é encontrada.

source: I don't get it, please give me some extra indications
pt_br: Ainda não captei, por favor me dê mais orientações

source: Here is the pseudo-code of the solution:
pt_br: Aqui está um pseudo-código da solução:

source: label the pegs A, B, C (these labels may move at different steps)
pt_br: Rotule as varas como A, B, C (estes rótulos pode se mover com diferentes passos)

source: let n be the total number of discs (the height of the initial tower)
pt_br: Seja n o número total de discos (A altura da torre inicial)

source: number the discs from 1 (smallest, topmost) to n (largest, bottommost)
pt_br: número de discos a partir de 1 (menor, mais alto) até n (maior, mais baixo)

source: To move n discs from peg A to peg C:
pt_br: Para mover n discos da vara A para a vara C:

source: move n−1 discs from A to B. This leaves disc number n alone on peg A
pt_br: mova n−1 discos de A para B. Isto deixa o disco n sozinho na vara A

source: move disc number n from A to C
pt_br: Mova o disco de número n de A para C

source: move n−1 discs from B to C so they sit on disc number n
pt_br: Mova n−1 discos de B para C de forma que eles fiquem sobre o disco de número n

source: Interleaved Towers of Hanoi
pt_br: Torres de Hanoi Intercaladas

source: In this classical variation of the Towers of Hanoi, you are given 4 pegs with 2 stacks, one white and one black. You should mix the two stacks as depicted in the Objective world. As previously, you cannot move a disk on a smaller disk.
pt_br: Nesta variação clássica das Torres de Hanoi, você tem 4 varas com duas pilhas, uma branca e outra preta. Você deve misturar as duas pilhas como descrito no mundo objetivo. Como antes, você não pode mover um disco para cima de um disco menor.

source: You will probably need to reuse the <code>hanoi()</code> method that you wrote in the previous exercise.
pt_br: Você provavelmente vai precisar reutilizar o método <code>hanoi()</code> que você escreveu no exercício anterior.

source: Please show me an intermediate step
pt_br: Favor me mostra um passo intermediário

source: If your initial situation is as follows:
pt_br: Se sua situação é a seguinte:

source: then you have the following situation right before the main recursive call:
pt_br: Então você tem a seguinte situação exatamente antes da chamada recursiva principal:

source: Split Towers of Hanoi
pt_br: Torres de hanoi Separadas

source: Given one interleaved stack (e.g. resulting from the previous exercise), you should build two separate stacks. In other words, your code should revert the operations done to solve the previous exercise.
pt_br: Dada uma pilha intercalada (e.g. o resultado do exercício anterior), você deve construir duas pilhas separadas. Em outras palavras, seu código deve reverter as operações feitas para resolver o exercício anterior.

source: You will need an extra function that can move an interleaved stack of n pairs of disks, without changing the relative positions of disks of the same size.
pt_br: Você vai precisar de uma função extra que mova uma pilha intercalada de n pares de discos, sem mudar as posições relativas dos discos de mesmo tamanho.

source: Surprisingly, our solution to split the towers generates much more moves than our solution to interleave them. As both problems are symmetric, this should not be.
pt_br: Surpreendentemente, nossa solução de dividir (split) as torres gera muito mais movimentos que a solução de intercalar elas. Como os problemas são simétricos, isto não deveria acontecer.

source: Disks amount
pt_br: Quantidade de discos

source: Interleaved
pt_br: Intercalada

source: 5 pairs
pt_br: 5 pares

source: 62 moves
pt_br: 62 movimentos

source: 88 moves
pt_br: 88 movimentos

source: 6 pairs
pt_br: 6 pares

source: 126 moves
pt_br: 126 movimentos

source: 183 moves
pt_br: 183 movimentos

source: 7 pairs
pt_br: 7 pares

source: 254 moves
pt_br: 254 movimentos

source: 374 moves
pt_br: 374 movimentos

source: Can you make the split tower as efficient as the interleaved one?
pt_br: Você consegue deixar o "split" tão eficiente quanto o intercalada?

source: I need a starter hint
pt_br: Preciso de uma dica de principiante

source: The source of discrepancy is an inefficient problem decomposition. Satisfied that it merely worked, we looked no futher for a better solution. Keeping the disks of the interleaved tower in the correct order during every move is unnecessary. In fact, we can avoid moving the interleaved tower at all. A better problem decomposition splits the pair of disks into two colored towers as they are removed from the interleaved tower.
pt_br: A fonte de discrepância é uma decomposição ineficiente do problema. Satisfeitos com o fato dele simplesmente funcionar, nós não procuramos mais por uma solução melhor. Manter os discos da torre intercalada na ordem correta durante cada movimento é desnecessário. De fato, podemos evitar completamente mover a torre intercalada. Uma decomposição melhor do problema divide o par de discos em duas torres coloridas à medida em que eles são removidos da torre intercalada.
