Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an integer <code>N</code>, return the list constituted of the first <code>N</code> elements. You can assume that the list is long enough, i.e. that there is at least <code>N</code> elements.
pt_br: Dada uma [!scala]List[Int][/!][!java|python]recursive list[/!] e um inteiro <code>N</code>, retorna a lista constituída dos primeiros <code>N</code> elementos. Você pode assumir que a lista é longa o suficiente, i.e. que existem pelo menos <code>N</code> elementos.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an integer <code>N</code>, return the list with only the <code>N</code> last elements.
pt_br: Dada uma [!scala]List[Int][/!][!java|python]recursive list[/!] e um inteiro <code>N</code>, retorna a lista com apenas os últimos <code>N</code> elementos.

source: Your solution should be linear in time, but you will probably need to define several functions to achieve that complexity.
pt_br: Sua solução deve ser linear no tempo, mas você provavelmente precisa definir várias funções para alcançar esta complexidade.

source: I cannot do it in linear time
pt_br: Eu não posso fazer isto em tempo linear

source: The trick is to compute only once (and beforehand) how many elements you should keep.
pt_br: O segredo é calcular apenas uma vez (e previamente) quantos elementos você deve guardar.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an integer <code>N</code>, return the list without the <code>N</code> first elements.
pt_br: Dada uma [!scala]List[Int][/!][!java|python]recursive list[/!] e um inteiro <code>N</code>, retorne a lista sem os primeiros <code>N</code> elementos.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an integer <code>N</code>, return the list without the <code>N</code> last elements.
pt_br: Dada uma [!scala]List[Int][/!][!java|python]recursive list[/!] e um inteiro <code>N</code>, retorna a lista sem os últimos <code>N</code> elementos.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return a new list with all elements in reverse order.
pt_br: Dada uma [!scala]List[Int][/!][!java|python]recursive list[/!], retorna uma nova lista com todos os elementos em ordem inversa.

source: This function is very important and you should not pass that challenge. Your solution should be linear in time, with the help of helper functions.
pt_br: Esta função é muito importante e você não deve pular este desafio. Sua solução deve ser linear no tempo, com a ajuda de funções auxiliares.

source: You need an helper function in which the result is accumulated (built) at each step.
pt_br: Você precisa de uma função auxiliar na qual o resultado é acumulado (construído) em cada passo.

source: Given two [!scala]List[Int][/!][!java|python]recursive list[/!] <code>l1</code> and <code>l2</code>, return a new list with all elements of <code>l1</code> followed by the elements of <code>l2</code>.
pt_br: Dadas duas [!scala]List[Int][/!][!java|python]recursive list[/!] <code>l1</code> e <code>l2</code>, retorna uma nova lista com todos os elementos de <code>l1</code> seguidos de todos os elementos de <code>l2</code>.

source: You need to modify <code>l1</code> beforehand so that the computations at each step of the recursion are in constant time.
pt_br: Você precisa modificar <code>l1</code> antes de forma que os cálculos em cada passo da recursão sejam em tempo constante.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return true if any two elements of the list are different (ie, if no element appears more than once in the list).
pt_br: Dada uma [!scala]List[Int][/!][!java|python]recursive list[/!], retorne verdadeiro se quaisquer dois elementos da lista são diferentes (ie, se nenhum elemento aparece mais de uma vez na lista).

source: The simplest solution is in O(n²), meaning that it runs in quadratic time. You will probably have to define one extra function for that. Another much more complex solution runs in O(n log(n)).
pt_br: A solução mais simples é em O(n²), o que significa que executa em tempo quadrático. Você provavelmente terá que definir uma função extra para isto. Outra solução muito mais complexa executa em O(n log(n)).

source: Recursive algorithms
pt_br: Algoritmos recursivos

source: This lesson allows to experiment with recursive algorithms.
pt_br: Esta lição permite que se experimente com algoritmos recursivos.

source: If you need more recursive algorithms, an exercise on recursive sorting algorithms (in particular QuickSort and MergeSort) is planned in the future within the sorting lesson.
pt_br: Se você precisa de mais algoritmos recursivos, um exercício em algoritmos de ordenação recursivos (em particular QuickSort e MergeSort) está planejado no futuro dentro da lição de ordenação.

source: What can I do to improve this lesson?
pt_br: O que ru posso fazer para melhorar esta lição?

source: As usual, there are several things that could be done in this lesson to improve it further:
pt_br: Como sempre, existem várias coisas que podem ser feitas nesta lição para melhorar ela ainda mais:

source: The Sierpinski triangle can be drawn using a simpler L-system. See http://jpvallon.free.fr/recursivite.html
pt_br: O triângulo de Sierpinski pode ser desenhado usando um L-system mais simples. Veja em http://jpvallon.free.fr/recursivite.html

source: The arrowhead curve is also interesting: http://www.mathcurve.com/fractals/sierpinski/sierpinskitriangle.shtml
pt_br: A curva "arrowhead" também é interessante: http://www.mathcurve.com/fractals/sierpinski/sierpinskitriangle.shtml

source: The dragon curve could be explained as a L-system: http://ecademy.agnesscott.edu/~lriddle/ifs/heighway/heighway.htm
pt_br: A curva do dragão pode ser explicada como um L-system: http://ecademy.agnesscott.edu/~lriddle/ifs/heighway/heighway.htm

source: The dragon2 curve is called the twin dragon: http://ecademy.agnesscott.edu/~lriddle/ifs/heighway/twindragon.htm
pt_br: A curva do dragão2 é chamada de "twin dragon": http://ecademy.agnesscott.edu/~lriddle/ifs/heighway/twindragon.htm

source: The space filling curves could be added (Peano, Hildebert, etc). See: http://teachout1.net/village/fill.html
pt_br: As curvas de preenchimento de spaço podem ser adicionadas (Peano, Hildebert, etc). Veja: http://teachout1.net/village/fill.html

source: We could do another exercise on embeeded polygons: http://www.inrialpes.fr/helix/people/genoud/ENSJAVA/tds/sujets/dessinsReccursifs/actionsrecursives.html
pt_br: Podemos fazer outro exercício em polígonos "embeeded": http://www.inrialpes.fr/helix/people/genoud/ENSJAVA/tds/sujets/dessinsReccursifs/actionsrecursives.html

source: Bases of recursion
pt_br: As bases da recursão

source: Discover the recursive way of thinking by drawing trees and other figures with the Logo turtle.
pt_br: Descobrir a forma recursiva de pensar desenhando árvores e outras figuras com a tartaruga do Logo.

source: The small cousines of Buggles
pt_br: Os primos menores dos buggles

source: Today, we will meet the small cousines of the buggles: the turtles. In fact, turtles are much olders than the buggles. They were invented in the 70's by a scientific from MIT called Seymour Papert to help teaching programming, and the buggles are a variation on the idea invented by Lyn Turbak from Wellesley College later.
pt_br: Hoje vamos conhecer os primos menores dos buggles: as tartarugas. Na verdade, as tartarugas são muito mais velhas que os buggles. Elas foram inventadas nos anos 70 por um cientista do MIT chamado Seymour Papert para ajudar no ensino de programação, e os buggles são uma variação da idéia seguinte de Lyn Turbak do Wellesley College.

source: Turtles are thus a bit like buggles, but smaller. Just like buggles, you can order them to move forward, to turn, to move backward, etc. Just like buggles, they leave a line on their path when they move (but the line is much smaller).
pt_br: Tartarugas então, são meio parecidas com buggles, mas menores. Como os buggles, você pode mandar que elas se movam para a frente, virem, se movam para trás, etc. Como os buggles, elas deixam uma linha no caminho por onde passam (mas a linha é muito menor).

source: The main difference is that where buggles can only move of right angles, turtles can move of any arbitrary angles specified by a real number (a double). This gives them much more liberty in their movings. The buggles can do several other tricks, like reading and writting messages, picking or dropping objects, and there is sometimes walls in their worlds (but all this is completely above the capacities of turtles).
pt_br: A principal diferença é que enquanto os buggles podem se mover apenas em ângulos retos, as tartarugas podem se mover em qualquer ângulo especificado por um número real (um double). Isto dá a elas muito mais liberdade em seus movimentos. Já os buggles podem fazer vários outros truques, como ler e escrever mensagens, pegar e soltar objetos, e às vezes lidar com paredes existentes nos mundos (mas isto está totalmente além da capacidade das tartarugas).

source: From a practical point of view, most of the methods you knew about buggles still work with turtles, with some minor adaptations. In particular, the <code>forward()</code> method takes the amount of steps to do not as an integer, but as a [!python]point number[/!][!java|scala|c]double[/!] (see "About this world" for more details).
pt_br: De um ponto de vista prático, a maioria dos métodos que você conhece sobre buggles ainda funciona com tartarugas, com pequenas adaptações. Em particular, o método <code>forward()</code> pega a quantidade de passos a dar não como inteiro, mas como [!python]point number[/!][!java|scala|c]double[/!] (veja "Sobre este mundo" para maiores detalhes).

source: Doubles? But what is it?
pt_br: Doubles? Mas o que é isto?

source: It's simply a point number. Example:
pt_br: é simplesmente um número com vírgula. Por exemplo:

source: double x = 3.72; x + 1.234 // Value = 4.954 x + 2. // Value = 5.72 (2. means 2.0) x + 2 // [!java|c]Value = 5.72 (2 automatically converted to 2.0)[/!][!scala]Type error (+ operator don't mix Double and Int); manual conversion mandatory[/!] x * 2. // Value = 7.44 x / 2. // Value = 1.86 [!java|c](int) x[/!][!scala]x.asInstanceOf[Int][/!] // Value = 1 (“casting to int”, converted to integer by truncating) Math.round(x) // Value = 2 (1.86 rounded to nearest integer) Math.floor(x) // Value = 1 (1.86 rounded toward minus infinity) Math.floor(-5.12) // Value = -6 (rounded toward minus infinity) Math.ceiling(x) // Value = 2 (1.86 rounded toward plus infinity) Math.ceiling(-5.12) // Value = -5 (rounded toward plus infinity) [!java|c](double) 17[/!][!scala]17.asInstanceOf[Double][/!] // Value = 17.0 (“casted to double”, converted to double)
pt_br: double x = 3.72; x + 1.234 // Valor = 4.954 x + 2. // Valor = 5.72 (2. significa 2.0) x + 2 // [!java|c]Value = 5.72 (2 convertido automaticamente em 2.0)[/!][!scala]Erro de tipo (o operador + não mistura Double e Int); é obrigatória a conversão manual[/!] x * 2. // Valor = 7.44 x / 2. // Valor = 1.86 [!java|c](int) x[/!][!scala]x.asInstanceOf[Int][/!] // Valor = 1 (“fazendo cast para int”, convertido para integer truncando) Math.round(x) // Valor = 2 (1.86 arredondado para o inteiro mais próximo) Math.floor(x) // Valor = 1 (1.86 rounded toward minus infinity) Math.floor(-5.12) // Valor = -6 (rounded toward minus infinity) Math.ceiling(x) // Valor = 2 (1.86 rounded toward plus infinity) Math.ceiling(-5.12) // Valor = -5 (rounded toward plus infinity) [!java|c](double) 17[/!][!scala]17.asInstanceOf[Double][/!] // Valor = 17.0 (“feito cast para double”, convertido para double)

source: Even if this is the first exercise on the recursivity lesson, the code you have to write is not recursive. The goal is to get familiar with the turtle world before getting on serious matter.
pt_br: Mesmo este sendo o primeiro exercício da lição de recursividade, o código que você tem que escrever não é recursivo. O objetivo é se familiarizar com o mundo da tartaruga antes da coisa começar a ficar séria.

source: You must reproduce a simple geometrical painting constituted of four 100 steps long squares (see the objective world for more details). It is obviously a good idea to write a method to draw a square, and then use it in your code.
pt_br: Você deve reproduzir uma pintura geometricamente simples de quatro quadrados de comprimento de 100 passos (veja o mundo objetivo para mais detalhes). É obviamente uma boa ideia escrever um método para desenhar um quadrado, e então usar ele em nosso código.

source: Fractal of polygons
pt_br: Fractal de polígonos

source: The fractal we will now draw is formed of a polygon, with little polygons on each corner. The prototype of the method drawing it is the following:
pt_br: O fractal que vamos desenhar agora é formado de um polígono, com pequenos polígonos em cada canto. O protótipo do método que vai desenhar ele é o seguinte:

source: [!java|c]void [/!]polygonFractal ([!java|c]int [/!]levels[!scala]:Int[/!], [!java|c]int [/!]sides[!scala]:Int[/!], [!java|c]double [/!]length[!scala]:Double[/!], [!java|c]double [/!]shrink[!scala]:Double[/!])
pt_br: [!java|c]void [/!]fractalDoPolígono ([!java|c]int [/!]níveis[!scala]:Int[/!], [!java|c]int [/!]lados[!scala]:Int[/!], [!java|c]double [/!]comprimento[!scala]:Double[/!], [!java|c]double [/!]shrink[!scala]:Double[/!])

source: Have a look at each world's objective view to understand how to write the function.
pt_br: Dê uma olhada em cada visão de mundo objetivo para entender como escrever a função.

source: Snow flake
pt_br: Floco de neve

source: We will now draw snow flakes using the Koch fractal. A fractal is a geometric pattern repeated at every scale.
pt_br: Vamos agora desenhar flocos de neve usando o Koch fractal. Um fractal é um padrão geométrico repetido em cada escala.

source: The general form is a triangle, with each side given by several recursive calls. Your work is only to write the code of the <code>snowSide</code> method so that it draws one side of the triangle. To make it easier, each sides are represented in a specific color. Just draw the red things (without changing your pen color), and the other colors will be drawn automatically.
pt_br: A forma geral é um triângulo, com cada lado dado por várias chamadas recursivas. Seu trabalho é apenas escrever o código do método <code>snowSide</code> de forma que ele desenhe um lado do triângulo. Para facilitar, cada um dos lados é representado numa cor específica. Simplesmente desenhe as coisas vermelhas (sem mudar a cor da sua caneta), e as outras cores serão desenhadas automaticamente.

source: Observe the drawing in each world's objective to understand the pattern's logic, and then reproduce it. At level 0, the Koch curve is just a straight line. At level 1, the curve is divided in three thirds, and the middle part is replaced by the two sides of an equilateral triangle of the same length as the segment being removed. At level 2, the process is repeated, whith each segments split in three parts and the middle part being replaced by the two sides of an equilateral triangle.
pt_br: Observe o desenho em cada um dos mundos objetivo para entender a lógica do padrão, e então reproduza ele. No nível 0, a curva de Koch é apenas uma linha reta. No nível 1, a curva é dividida em três terços, e a parte média é substituída pelos dois lados de um triângulo equilátero do mesmo comprimento do segmento sendo removido. No nível 2, o processo é repetido, com cada um dos segmentos dividido em três partes e a parte do meio sendo substituída pelos dois lados de um triângulo equilátero.

source: The pseudo-code of the general case is the following:
pt_br: O pseudo-código do caso geral é o seguinte:

source: Draw recursively a smaller segment Turn 60 degrees to the left Draw recursively a smaller segment Turn 120 degrees to the right Draw recursively a smaller segment Turn 60 degrees to the left Draw recursively a smaller segment
pt_br: Desenhe recursivamente um segmento menor Gire 60 graus para a esquerda Desenhe recursivamente um segmento menor Gire 120 graus para a direita Desenhe recursivamente um segmento menor Gire 60 graus para a esquerda Desenhe recursivamente um segmento menor

source: As you can see, the function forward() is not called from the recursive case, only in the base case when there is no recursive call.
pt_br: Como você pode ver, a função forward() não é chamada no caso recursivo, apenas no caso base quando não existe chamada recursiva.

source: Too much letters. Please picture it.
pt_br: Muitas letras. Favor "picture it".

source: Here are the results of the first levels of recursion.
pt_br: Aqui estão os resultados dos primeiro níveis da recursão.

source: You must write the <code>snowSide()</code> method, which is recursive but <b>do not call snowFlake from snowSide</b>, or you will get very strange and unexpected behaviors.
pt_br: Você deve escrever o método <code>snowSide()</code>, que é recursivo mas <b>não chame snowFlake de dentro de snowSide</b>, ou vão acontecer resultados estranhos e inesperados.

source: This exercise is a variation over the snow flake that we saw previously. The main difference is that we are growing little squares instead of triangles on the sides of the figure.
pt_br: Este exercício é uma variação sobre o snow flake que vimos previamente. A principal diferença é que vamos fazer crescer pequenos quadrados ao invés de triângulos nos lados da figura.

source: I don't see it, sorry. Please picture it.
pt_br: Desculpe, não vi isto. Favor "picture it".

source: As previously, your <code>squareSide</code> function should only draw one side of the figure, and the template will call it for all sides automatically (with one color per side).
pt_br: Como anteriormente, sua função <code>squareSide</code> deve apenas desenhar um lado da figura, e o template vai chamar ela para todos os lados automaticamente (com uma cor por lado).

source: Here comes yet another variation of the Koch curve. This time, we grow little pentagons (ie, polygons with five sides each). I'm sure you get it now.
pt_br: Aqui vai outra variação da curva de Koch. desta vez, vamos crescer pequenos pentágonos (ie, polígonos com cinco lados cada). Tenho certeza que agora você pegou a ideia.

source: Another difference with earlier is that the length is not divided by three at each step anymore, but multiplied by 0.4. The curve looks better this way :)
pt_br: Outra diferença com o anterior é que o comprimento não é mais dividido por três em cada passo, mas multiplicado por 0.4. A curva parece melhor desta forma :)

source: We draw only one side in this exercise so your code will be called only once this time.
pt_br: Desenhamos apnas um lado neste exercício de forma que seu código vai ser chamado apenas uma vez agora.

source: This time, we will draw the curve that is known as the (6, 0.14)-Koch curve. This means that you have to grow 6-sided polygons on the segments, and that the length should be multiplied by 0.14 at each recursion level.
pt_br: Agora vamos desenhar a curva conhecida por curva (6, 0.14)-Koch. Isto significa que você tem que crescer polígonos de 6 lados nos segmentos e que o comprimento deve ser multiplicado por 0.14 em cada nível de recursão.

source: For the record, the original Koch curve is the (3, 1/3)-Koch curve, the Snow square would be (4,1/3)-Koch curve while the Snow pentagon is also called the (5, 0.4)-Koch curve. If you want, you can switch to the creative mode in the menu and explore freely other Koch curves. Just change the initial call to hexaKoch to what you want.
pt_br: Para registro, a curva de Koch original é a curva (3, 1/3)-Koch, a Snow square será a curva (4,1/3)-Koch enquanto que a Snow pentagon é também chamada de curva (5, 0.4)-Koch. Se você quiser, você pode trocar para o modo criativo no menu e explorar livremente outras curvas de Koch. Simplesmente mude a chamada inicial de hexaKoch para o que você quiser.

source: For further reference, please see <a href="http://ecademy.agnesscott.edu/~lriddle/ifs/kcurve/kcurve.htm">http://ecademy.agnesscott.edu/~lriddle/ifs/kcurve/kcurve.htm</a>.
pt_br: Para mais referências, favor ler <a href="http://ecademy.agnesscott.edu/~lriddle/ifs/kcurve/kcurve.htm">http://ecademy.agnesscott.edu/~lriddle/ifs/kcurve/kcurve.htm</a>.

source: Fractal Crab
pt_br: Carangueijo Fractal

source: The Crab curve is not exactly a Koch curve, but that's still a fractal and it's built rather similarly. This time, we grow square triangle on the side of the figure: the angle is 45 degrees, and the length is divided by [!java|scala]Math.sqrt(2)[/!][!python]math.sqrt(2)[/!][!c]sqrt(2);[/!] at each step.
pt_br: A curva do carangueijo não é exatamente uma curva de Koch, mas ainda é um fractal e e construída de forma similar. Desta vez, vamos crescer um triângulo retângulo na lateral da figura: o ângulo é de 45 graus, e o comprimento é dividido por [!java|scala]Math.sqrt(2)[/!][!python]math.sqrt(2)[/!][!c]sqrt(2);[/!] em cada passo.

source: Check the figures produced by the first steps of recursion to understand the pattern.
pt_br: Verifique as figuras produzidas pelos primeiros passos da recursão para entender o padrão.

source: Bibliographical note
pt_br: nota bibliográfica

source: This curve, also called the Lévy C curve was invented in 1938 by the French mathematician Paul Lévy. As usual, the wikipedia page is very instructive, and the page provide very good additions: <a href="http://www.mathcurve.com/fractals/c/c.shtml">http://www.mathcurve.com/fractals/c/c.shtml</a>.
pt_br: Esta curva, também chamada de curva C de Lévy foi inventada em 1938 pelo matemático francês Paul Lévy in 1938. Como sempre, a página da wikipédia é bem instrutiva, além de fornecer ótimos extras: <a href="http://www.mathcurve.com/fractals/c/c.shtml">http://www.mathcurve.com/fractals/c/c.shtml</a>.

source: Trees
pt_br: Árvores

source: We will now draw trees. For that, we will write a method using double recursion following this prototype
pt_br: Vamos agora construir árvores. Para isto, vamos escrever um método usando recursão dupla seguindo este protótipo

source: [!java|c]void [/!]tree([!java|c]int [/!]steps[!scala]:Int[/!], [!java|c]double [/!]length[!scala]:Double[/!], [!java|c]double [/!]angle[!scala]:Double[/!], [!java|c]double [/!]shrink[!scala]:Double[/!])
pt_br: [!java|c]void [/!]árvore([!java|c]int [/!]passos[!scala]:Int[/!], [!java|c]double [/!]comprimento[!scala]:Double[/!], [!java|c]double [/!]ângulo[!scala]:Double[/!], [!java|c]double [/!]shrink[!scala]:Double[/!])

source: To draw a tree of four levels, you have to draw a trunk of the given length, turn right of the given angle, draw a tree of level 3, turn left twice of the given angle, draw another tree of level 3, and come back to your initial location. Don't forget to come back to the initial location!
pt_br: Para desenhar uma árvore de quatro níveis, você deve desenhar um tronco do comprimento dado, virar à direita num ângulo dado, desenhar uma árvore de nível 3, virar a esquerda duas vezes no ângulo dado, desenhar outra árvore de nível 3, e voltar para a posição inicial. Não esqueça de voltar para a posição inicial!

source: If a tree's trunk is of length 'len', the trunk of the next level tree will be of length 'len*shrink'.
pt_br: Se um tronco da árvore é de comprimento 'len', o tronco da árvore no próximo nível será de comprimento 'len*shrink'.

source: At the end, here is the pseudo-code of the general case (you should add the base case yourself):
pt_br: Finalmente, aqui está o pseudo-código do caso geral (você deve adicionar o caso base por si só):
