Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: You have a red lottery ticket showing ints a, b, and c, each of which is 0, 1, or 2. If they are all the value 2, the result is 10. Otherwise if they are all the same, the result is 5. Otherwise so long as both b and c are different from a, the result is 1. Otherwise the result is 0.
pt_br: Você tem um bilhete de loteria vermelho com três inteiros a, b e c. Cada um com o valor 0, 1, ou 2. Se todos tem o valor 2, o resultado vale 10. Senão, se eles são iguais, o resultado vale 5. Senão, e se b e c são diferentes de a, o resultado vale 1. Senão, o resultado é 0.

source: ShareDigit
pt_br: dígitos compartilhados

source: Given two ints, each in the range 10..99, return true if there is a digit that appears in both numbers, such as the 2 in 12 and 23. (Note: division, e.g. n/10, gives the left digit while the % "mod" n%10 gives the right digit.)
pt_br: Sejam dois inteiros, cada um no intervalo [10,99], retorne verdadeiro se existe um dígito que aparece nos dois números, como 2 em 12 e 23. (Nota: divisão, i.e. n/10, retorna o dígito à esquerda e % "mod" n%10 retorna o dígito a direita.)

source: SortaSum
pt_br: Soma de inteiros

source: Given 2 ints, a and b, return their sum. However, sums in the range 10..19 inclusive, are forbidden, so in that case just return 20.
pt_br: Dados 2 inteiros, a e b, retorne sua soma. Entretanto, somas no intervalo 10..19 inclusive, são proibidas. Neste caso, simplesmente retorne 20.

source: SquirrelPlay
pt_br: Jogo do Esquilo

source: The squirrels in Palo Alto spend most of the day playing. In particular, they play if the temperature is between 60 and 90 (inclusive). Unless it is summer, then the upper limit is 100 instead of 90. Given an int temperature and a boolean isSummer, return true if the squirrels play and false otherwise.
pt_br: Os esquilos em Palo Alto passam a maior parte do dia jogando. Em particular, eles jogam se a temperatura está entre 60 e 90 (inclusive). A menos que seja verão, e neste caso o limite superior é de 100 ao invés de 90. Seja uma temperatura inteira e um isSummer (éVerão) booleano. Retorne verdadeiro se eles jogam e falso caso contrário.

source: TeaParty
pt_br: Festa do chá

source: We are having a party with amounts of tea and candy. Return the int outcome of the party encoded as 0=bad, 1=good, or 2=great. A party is good (1) if both tea and candy are at least 5. However, if either tea or candy is at least double the amount of the other one, the party is great (2). However, in all cases, if either tea or candy is less than 5, the party is always bad (0).
pt_br: Estamos tendo uma festa com chá e doces. Retorne o resultado inteiro da festa codificado como 0=ruim, 1=bom, ou 2=excelente. Uma festa é boa (1) se o chá e os doces são pelo menos 5. Entretanto, se tanto os doces como o chá forem pelo menos o dobro do outro, a festa é excelente (2). Entretanto, em todo caso, se tanto o chá quanto os doces forem menos que 5, a festa é sempre ruim (0).

source: TeenSum
pt_br: Soma de adolescentes

source: Given 2 ints, a and b, return their sum. However, "teen" values in the range 13..19 inclusive, are extra lucky. So if either value is a teen, just return 19.
pt_br: Dados dois números inteiros (a e b), retorne sua soma. Entretanto, os valores adolescentes (no intervalo [13;19]) são particularmente sortudos. Portanto, se um dos números for um adolescente, retorne simplesmente 19.

source: TwoAsOne
pt_br: Dois como um

source: Given three ints, a b c, return true if it is possible to add two of the ints to get the third.
pt_br: Dados três inteiros a, b e c, retorne verdadeiro se é possível adicionar dois deles e o resultado ser o terceiro.

source: WithoutDoubles
pt_br: Sem dobros

source: Return the sum of two 6-sided dice rolls, each in the range 1..6. However, if noDoubles is true, if the two dice show the same value, increment one die to the next value, wrapping around to 1 if its value was 6.
pt_br: Retorne a soma das rolagens de dois dados de 6 lados. entretanto, se noDoubles é verdadeiro e os dois dados derem o mesmo valor, incremente um dos dados para o valor seguinte, e volte a 1 se o valor for 6.

source: String fun
pt_br: Diversão com Strings

source: Strings are the simplest of the complex data types :) They provide several operations, such as getting the length of the string, or a substring of it.
pt_br: Strings são os mais simples dos tipos de dados complexos :) Elas fornecem diferentes operações, como obter o tamanho da string ou uma sub-string.

source: A very good introduction to this type is available here: http://codingbat.com/doc/java-string-introduction.html
pt_br: Uma introdução muito boa a este tipo pode ser encontrada em: http://codingbat.com/doc/java-string-introduction.html

source: Small exercises about strings
pt_br: Pequenos exercícios com strings

source: These are some training exercises around strings. But unfortunately, its integration within PLM is still ongoing.
pt_br: Aqui estão alguns exercícios sobre strings. Mas infelizmente, sua integração no PLM ainda está sendo construída.

source: Please be patient with us.
pt_br: Por favor seja paciente conosco.

source: AltPairs
pt_br: Pares alternados

source: Given a string, return a string made of the chars at indexes 0,1, 4,5, 8,9 ... so "kittens" yields "kien".
pt_br: Dada uma string, retorne outra string feita com os caracteres de índices 0,1, 4,5, 8,9 ... por exemplo "kittens" retorna "kien".

source: Given a string and a non-negative int n, we'll say that the front of the string is the first 3 chars, or whatever is there if the string is less than length 3. Return n copies of the front;
pt_br: Seja uma string e um inteiro n. Definiremos o começo de uma string como seus três primeiros caracteres, ou ela toda se o comprimento dela é menor que 3. Retorne n cópias do começo de uma string.

source: Last2
pt_br: Último2

source: Given a string, return the amount of times that the two last letters appear as a substring of the string. So "hixxxhi" yields 1 (we won't count the end substring) while "aaaNaa" yields 2 (substrings may overlap).
pt_br: Dada uma string, retorne o número de vezes que os dois últimos dígitos aparecem. Por exemplo, "hixxxhi" retorna 1 (não contamos a última sub-string) enquanto que "aaaNaa" retorna 2 (as ocorrências podem se sobrepor parcialmente).

source: Given a string, return a new string made of every other char starting with the first, so "Hello" yields "Hlo".
pt_br: Dada uma string, retorne uma nova string formada pegando um caractere sim, outro não, começando com o primeiro. Assim, "Primeiro" se torna "Pier".

source: StringMatch
pt_br: Comparação de string

source: Given 2 strings, a and b, return the number of the positions where they contain the same length 2 substring. So "xxcaazz" and "xxbaaz" yields 3, since the "xx", "aa", and "az" substrings appear in the same place in both strings.
pt_br: Sejam duas strings a e b. Retorne o número de posições onde elas contém a mesma substring de tamanho 2. Assim, "xxcaazz" e "xxbaaz" retornam 3, pois as substrings "xx", "aa", e "az" aparecem nas mesmas posições nas duas strings.

source: StringSplosion
pt_br: Explosão de strings

source: Given a non-empty string like "Code" return a string like "CCoCodCode".
pt_br: Dada uma string não vazia como "Code". Retorne uma string como "CCoCodCode".

source: StringTimes
pt_br: Multiplicação de strings

source: Given a string and a non-negative int n, return a larger string that is n copies of the original string.
pt_br: Dada uma string e um inteiro positivo n. Retorne uma string mais que consiste em n cópias da string original.

source: Given a string, return a version where all the "x" have been removed. Except an "x" at the very start or end should not be removed.
pt_br: Dada uma string, retorne uma versão onde todos os "x" são removidos. Exceto os "x" no começo e no final que devem permanecer.

source: Suppose the string "yak" is unlucky. Given a string, return a version where all the "yak" are removed, but the "a" can be any char. The "yak" strings will not overlap.
pt_br: A string "yak" não tem sorte. Dada uma stringd, retorne uma versão onde todas as "yak" são suprimidas (qualquer que seja o caractere no lugar do 'a'). As diferentes strings "yak" não se sobrepõe.

source: Lunar Lander
pt_br: Módulo lunar

source: In this lesson you pilot a lunar landing module in increasingly complex situations.
pt_br: Nesta lição você vai pilotar um módulo lunar em situações de complexidade crescente

source: At each step of the simulation, the player issues a command controlling how much the angle and thrust of the lander should change
pt_br: Em cada passo da simulação, o jogador envia um comando controlando quanto o ângulo e a potência do módulo devem mudar

source: Ideas concerning the progression of exercises:
pt_br: Ideias a respeito da progressão dos exercícios:

source: A lander in vertical position above flat ground, the player can only control thrust (done)
pt_br: Um módulo em posição vertical sobre solo plano, o jogador só controla a potência (feito)

source: A lander in vertical position not above flat ground, the player control thrust and angle (done)
pt_br: Um módulo em posição vertical sobre solo inclinado, o jogador controla potência e ângulo (feito)

source: A lander with difficult angle and speed not above flat ground, the player control thrust and angle
pt_br: Um módulo com com ângulo ruim e rápido sobre solo inclinado, o jogador controla potência e ângulo

source: A lander with difficult angle and speed not above flat ground, with difficult ground, the player control thrust and angle
pt_br: Um módulo com ângulo difícil e rápido sobre superfície inclinada, com solo difícil, o jogador controla potência e ângulo

source: Same with wind?
pt_br: O mesmo com vento?

source: This lesson assumes some basic programming and physics skills.
pt_br: Esta lição assume algum conhecimento de física e programação básica.

source: In this universe you pilot a lunar lander. At each simulation step you're given the lander's position, speed, angle and thrust and must issue a command adjusting its angle and thrust.
pt_br: Neste universo você pilota um módulo lunar. Em cada passo da simulação você recebe a posição, velocidade, ângulo e potência do módulo e deve enviar um comando ajustando o ângulo e a potência.

source: Get the X and Y position of the lander.
pt_br: Obter (Get) as posições X e Y do módulo.

source: [!java|c]double [/!]getSpeedX()[!scala]:Double[/!] [!java|c]double [/!]getSpeedY()[!scala]:Double[/!]
pt_br: [!java|c]double [/!]getVelocidadeX()[!scala]:Double[/!] [!java|c]double [/!]getVelocidadeY()[!scala]:Double[/!]

source: Get the horizontal and vertical speed of the lander.
pt_br: Obter a velocidade horizontal e vertical do módulo.

source: [!java|c]double [/!]getAngle()[!scala]:Double[/!] [!java|c]void [/!]setDesiredAngle([!java|c]double [/!]desiredAngle[!scala]:Double[/!])
pt_br: [!java|c]double [/!]getÂngulo()[!scala]:Double[/!] [!java|c]void [/!]setÂnguloDesejado([!java|c]double [/!]ÂnguloDesejado[!scala]:Double[/!])

source: Get or set the angle of the lander.
pt_br: Obter ou ajustar o ângulo do módulo.

source: An angle of 0° denotes a vertical position where the "head" of the lander points up. This is the angle you must land with. A positive angle denotes a left-leaning lander, a negative angle a right-leaning one. You cannot lean more than by ±90°, and the angle can vary by at most ±5° in one step.
pt_br: Um ângulo de 0° denota uma posição vertical onde a "cabeça" do módulo aponta para cima. Este é o ângulo que você deve pousar. Um ângulo positivo denota inclinação para a esquerda, um ângulo negativo denota inclinação para a direita. Você não pode inclinar mais que ±90°, e o ângulo pode sofrer uma variação de no máximo ±5° em cada passo.

source: [!java|c]int [/!]getThrust()[!scala]:Int[/!] [!java|c]void [/!]setDesiredThrust([!java|c]int [/!]thrust[!scala]:Int[/!])
pt_br: [!java|c]int [/!]getImpulso()[!scala]:Int[/!] [!java|c]void [/!]setImpulsoDesejado([!java|c]int [/!]thrust[!scala]:Int[/!])

source: Get or set the thrust of the lander.
pt_br: Obter ou ajustar a potência do módulo.

source: You can only increment or decrement the thrust by 1 between two simulation steps, so if the current thrust is 2 and you ask for 4, you'll only get 3 in the next step. If you ask for less than 0 (resp. more than 4), everything will be as if you had asked for 0 (resp. 4).
pt_br: Você só pode aumentar ou diminuir a potência de 1 a cada passo. logo, se a potência atual é 2 e você pede 4, ela vai mudar para 3 no próximo passo. Se você pedir menos que 0 (ou, respectivamente, mais que 4), vai ser como se você tivesse pedido 0 (ou, respectivamente, 4).

source: [!java|c]int [/!]getFuel()[!scala]:Int[/!]
pt_br: [!java|c]int [/!]getCombustível()[!scala]:Int[/!]

source: Get the remaining fuel in the lander. At each step of the simulation the lander consumes as many fuel units as the current thrust. Once you run out of fuel you're in free fall so beware!
pt_br: Obter o combustível restante no módulo. Em cada passo da simulação o módulo consome tantas unidades de combustível quanto a potência atual. Uma vez que você fique sem combustível você entra em queda livre. Portanto cuidado!

source: [!java]List&lt;Point&gt; [/!]getGround()[! scala]:List[Point][/!]
pt_br: [!java]List&lt;Point&gt; [/!]getChão()[! scala]:List[Point][/!]

source: Get the vertices of the ground's profile from left to right. [!java|scala]You can retrieve the X and Y coordinates of each point with the corresponding methods of your point: <code>p.x()</code> and <code>p.y()</code>.[/!] [!python]Each point is an array of two integers denoting respectively the X and Y coordinates of that point.[/!]
pt_br: Obter os vértices do perfil do solo da esquerda para a direita. [!java|scala]Você pode recuperar as coordenada X e Y de cada ponto com os métodos correspondentes do seu ponto: <code>p.x()</code> e <code>p.y()</code>.[/!] [!python]Cada ponto é uma array de de dois inteiros denotando respectivamente as coordenadas X e Y de cada ponto.[/!]

source: Congratulations! You won a (one-way) trip to Mars in a cereal box. NASA was kind enough to donate the Lunar Excursion Module for this mission, so that's what you'll be flying.
pt_br: Parabéns! Você ganhou uma viagem (só de ida) para Marte numa caixa de cereais. A NASA está orgulhosa em doar o módulo da excursão lunar para esta missão, e é ele que você vai pilotar.

source: Before you take off, you must go through some basic landing simulation. You shouldn't have to fly the lander if all goes as planned but, as they say, "better safe than sorry".
pt_br: Antes de pousar, você vai realizar algumas simulações de pouso. Você não tem que pilotar o módulo se tudo for como planejado mas, como dizem, "é melhor prevenir que remediar".

source: Your mission is to <b>land the lander with a vertical speed of at most 10 m/s.</b> There are two ways you can influence the lander's course: by adjusting its angle or by adjusting its thrust. In this simulation we only care about adjusting the thrust, expressed in m/s².
pt_br: Sua missão é <b>pousar o módulo com velocidade vertical de no máximo 10 m/s.</b> Existem duas formas de influenciar o curso do módulo: ajustando seu ângulo ou ajustando sua potência. Nesta simulação vamos nos preocupar apenas com ajustar a potência, expressa em m/s².

source: The [!python]<code>step()</code> function[/!][!scala|java|c]code[/!] that you should write now will be called every 0.1 second during the simulation. Make sure that your code does not last too long, with no while loop! It should only set the desired thrust of the next simulation step, by calling <code>[!java]void [/!]setDesiredThrust([!java]int [/!]desiredThrust[!scala]:Integer[/!])</code> where <code>desiredThrust</code> is some integer between 0 and 4 (that is, a thrust between 0 m/s² and 4 m/s²). You can only increment or decrement the thrust by 1 between two simulation steps, so if the current thrust is 2 and you ask for 4, you'll only get 3 in the next step. If you ask for less than 0 (resp. more than 4), everything will be as if you had asked for 0 (resp. 4).
pt_br: [!python]A função <code>step()</code> [/!][!scala|java|c]O código[/!] que você vai escrever agora vai ser chamad[!python]a[/!][!scala|java|c]o[/!] a cada 0.1 segundos durante a simulação. Certifique-se que seu código não demora muito para executar, sem usar loop while! Ele apenas deve ajustar a potência desejada para o próximo passo da simulação, chamando <code>[!java]void [/!]setDesiredThrust([!java]int [/!]desiredThrust[!scala]:Integer[/!])</code> onde <code>desiredThrust</code> é algum inteiro entre 0 e 4 (ou seja, uma potência entre 0 m/s² e 4 m/s²). Você só pode aumentar ou diminuir a potênciapor 1 entre dois passos da simulação. Portanto, se a potência atual é 2 e você pede 4, você vai conseguir apenas 3 no próximo passo. Se você pede por menos que 0 (ou, respectivamente, mais que 4), vai ser como se você tivesse pedido 0 (ou, respectivamente, 4).

source: In order to take informed decisions, you can query the lander's state. In this simulation you'll probably be interested in its vertical position: <code>[!java]double [/!]getY()[!scala]:Double[/!]</code>, and its vertical speed: <code>[!java]double [/!]getSpeedY()[!scala]:Double[/!]</code>. You can also ask for the thrust via <code>[!java]int [/!]getThrust()[!scala]:Integer[/!]</code> in case you don't remember what you asked for. Remember that Mars' gravity is 3.711 m/s², it might come in handy.
pt_br: Para tomar decisões informadas, você pode consultar o status do módulo. Nesta simulação você provavelmente vai estar interessado na posição vertical: <code>[!java]double [/!]getY()[!scala]:Double[/!]</code>, e na velocidade vertical: <code>[!java]double [/!]getSpeedY()[!scala]:Double[/!]</code>. Você também pode pedir a potência com <code>[!java]int [/!]getThrust()[!scala]:Integer[/!]</code> caso você não lembre o que pediu. Lembre que a gravidade de Marte é 3.711 m/s². Isto pode ser útil.

source: One last thing: the lander is pretty small so you don't have much fuel. At each step of the simulation the lander consumes as many fuel units as the current thrust. Once you run out of fuel you're in free fall so beware! You can consult the remaining amount of available fuel units using <code>[!java]int [/!]getFuel()[!scala]:Integer[/!]</code>.
pt_br: Uma última coisa: o módulo é bem pequeno, logo você não tem muito combustível. Em cada passo da simulação o módulo consome tantas unidades de combustível quanto a potência atual. Uma vez que você fique sem combustível você vai cair em queda livre, portanto cuidado! Você pode consultar o quantidade de unidades de combustível restante usando <code>[!java]int [/!]getFuel()[!scala]:Integer[/!]</code>.

source: Locate a Landing Zone
pt_br: Localizar uma área de pouso

source: After 200 days of traveling space and eating cereals you finally reach Mars. Time to land at last!
pt_br: Depois de 200 dias viajando no espaço e comendo cereais você finalmente chegou em Marte. Hora de pousar, finalmente!

source: A segment is composed of two <code>Point</code>s, each of them composed of two <code>double</code>s. A segment is built via the <code>Segment([!java]Point [/!]start[!scala]:Point[/!], [!java]Point [/!]end[!scala]:Point[/!])</code> constructor. A point is built via the <code>Point([!java]double [/!]x[!scala]:Double[/!], [!java]double [/!]y[!scala]:Double[/!])</code> constructor. A point's coordinates are accessible via its <code>[!java]double [/!]x()[!scala]:Double[/!]</code> and <code>[!java]double [/!]y()[!scala]:Double[/!]</code> methods.
pt_br: Um segmento é composto de dois <code>Ponto</code>s, cada um deles composto de dois <code>double</code>s. Um segmento é construído com o construtor <code>Segment([!java]Point [/!]start[!scala]:Point[/!], [!java]Point [/!]end[!scala]:Point[/!])</code>. Um ponto é construído com o construtor <code>Point([!java]double [/!]x[!scala]:Double[/!], [!java]double [/!]y[!scala]:Double[/!])</code>. As coordenadas de um ponto são acessíveis através de seus métodos <code>[!java]double [/!]x()[!scala]:Double[/!]</code> e <code>[!java]double [/!]y()[!scala]:Double[/!]</code>.

source: [/!] [!python]tuple of two X coordinates representing the zone of your choice.[/!]
pt_br: [/!] [!python]tupla de duas coordenadas X representando a área escolhida.[/!]

source: In order to determine which zone to return, you'll need to call <code>[!java]List&lt;Point&gt; [/!]getGround()[!scala]List[Point][/!]</code>, which returns the vertices of the ground's profile as a list of [!java|scala]<code>Point</code>[/!] [!python]tuples (x,y)[/!].
pt_br: Para determinar para qual área retornar, você precisa chamar <code>[!java]List&lt;Point&gt; [/!]getGround()[!scala]List[Point][/!]</code>, que retorna os vértices do perfil do solo como uma lista de [!java|scala]<code>Point</code>s[/!] [!python]tuples (x,y)[/!].

source: One more thing: your function should return a valid flat zone in any kind of situation, not just for the currently visualized one. That's because it will be not only tested against that world, but also against the one we had in the previous exercise. As usual, you can see the other existing worlds with the appropriate combobox.
pt_br: Mais um detalhe: Sua função deve retornar uma área plana válida em qualquer situação, não apenas para a atualmente vista. Isto é por que ele não vai ser testado apenas neste mundo, mas também naquele do exercício anterior. Como sempre, você pode ver os outros mundo existentes com a combobox apropriada.

source: Have a safe landing! Don't forget to put on your space suit on your way out.
pt_br: Tenha um bom pouso! Não esqueça de vestir se traje espacial quando for sair.

source: Fly the Lander!
pt_br: Pilote o módulo!

source: After 30 days of staring at rocks and eating cereals you decide it's time to go explore other parts of the planet.
pt_br: Depois de 30 dias olhando rochas e comendo cereais você decide que é hora de explorar outras partes do planeta.

source: You fly for a while and suddenly realize you're almost out of fuel. Unfortunately you're in a delicate situation and the autopilot is helpless. You will have to pilot the lander yourself. Your mission is to <b>land the lander on a flat zone with a vertical speed less than 10 m/s, an horizontal speed less than 5 m/s and an angle of 0°.</b>
pt_br: Você voa por um tempo e repentinamente repara que está quase sem combustível. Infelizmente, você está numa situação delicada e o piloto altomático é inútil. Você vai ter que pilotar o módulo você mesmo. Sua missão é <b>pousar o módulo numa área plana com uma velocidade vertical menor que 10 m/s, uma velocidade horizontal menor que 5 m/s e um ângulo de 0°.</b>
