Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: [!java|scala|c]while (<b>condition</b>) { &nbsp;&nbsp;&nbsp;&nbsp;<b>action()</b>; }[/!][!python]while <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>action()</b>[/!]
pt_br: [!java|scala|c]while (<b>condição</b>) { &nbsp;&nbsp;&nbsp;&nbsp;<b>ação()</b>; }[/!][!python]while <b>condição</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>ação()</b>[/!]

source: The inner bloc is then executed again and again, as long as the condition remains true. More specifically, the buggle tests the value of the condition. If it's false, it ignores the bloc and continue below. If it's true, it executes the bloc. After that, it tests the condition. If it's now false (for example because the moves of the block made us facing the wall), it now ignores the bloc and continue. If it's still true, it execute the bloc and reevaluate the condition. It does so as long as the condition remains true.
pt_br: O bloco interno é então executado várias e várias vezes, enquanto a condição se mantiver verdadeira. Mais especificamente, o buggle testa o valor da condição. Se for falsa, ele ignora o bloco e continua abaixo. Se for verdadeira, ele executa o bloco. Depois disto, ele testa a condição. Se ela agora for falsa (por exemplo, por que os movimentos do bloco nos deixaram de cara pra parede), ele agora ignora o bloco e continua. Se ele ainda for verdadeiro, ele executa o bloco e reavalia a condição. Ele faz isto enquanto a condição se mantém verdadeira.

source: Naturally, if the chosen action does not modify the value of the condition, the buggle will do the action endlessly. The <b>stop</b> button of the interface becomes then handy. To test this, you can try to type the following code in the editor:
pt_br: Naturalmente, se a ação escolhida não modifica o valor da condição, o buggle vai fazer a ação infinitamente. O botão <b>stop</b> na interface se torna útil nestes casos. Para testar isto, você pode tentar digitar o seguinte código no editor:

source: [!java|scala]while (true) { &nbsp;&nbsp;&nbsp;&nbsp;left(); }[/!][!c]while (1) { &nbsp;&nbsp;&nbsp;&nbsp;left(); }[/!][!python]while True: &nbsp;&nbsp;&nbsp;&nbsp;left()[/!]
pt_br: [!java|scala]while (true) { &nbsp;&nbsp;&nbsp;&nbsp;esquerda(); }[/!][!c]while (1) { &nbsp;&nbsp;&nbsp;&nbsp;esquerda(); }[/!][!python]while True: &nbsp;&nbsp;&nbsp;&nbsp;esquerda()[/!]

source: This will let the buggle turn left as long as <code>[!c]1[/!][!java|scala]true[/!][!python]True[/!]</code> remains true (ie, endlessly), or until you stop it manually using the stop button.
pt_br: Isto vai fazer o buggle virar à esquerda enquanto <code>[!c]1[/!][!java|scala]true[/!][!python]True[/!]</code> permanecer true (ou seja, infinitamente), ou até que você pare manualmente usando o botão parar.

source: You now have to write some code so that your buggles move forward until they encounter a wall. The idea is thus to do something like:
pt_br: Agora você tem que escrever algum código para seus buggles se moverem para a frente até que eles encontrem uma parede. A ideia é então fazer algo assim:

source: while we are not facing a wall, do: &nbsp;&nbsp;moveForward()
pt_br: Enquanto não estiver de cara para uma parede, faça: &nbsp;&nbsp;avançar()

source: Look at the documentation (in "Help/About this world") for the full list of buggles' methods.
pt_br: Procure na documentação (em "Ajuda/Sobre este mundo") para a lista completa dos métodos dos buggles.

source: The buggle world can sometimes contain some <i>baggles</i>, which are little biscuits that buggles can carry from one point to another. For that, they have to use specific methods such as <code>isOverBaggle(), isCarryingBaggle(), pickupBaggle()</code> or <code>dropBaggle()</code>. Check their documentation in "Help/About this world" for more details.
pt_br: O mundo dos buggles pode algumas vezes conter alguns <i>baggles</i>, que são pequenos biscoitos que os buggles podem carregar de um ponto a outro. para isto, eles tem que usar métodos específicos como <code>estáSobreBaggle(), estáCarregandoBaggle(), pegarBaggle()</code> ou <code>soltarBaggle()</code>. Verifique a documentação deles em "Ajuda/Sobre este mundo" para mais detalhes.

source: Let each buggle find its baggle by adapting the code you wrote in previous exercise (copy/paste what you've done before if you want).
pt_br: Deixe cada buggle encontrar seu baggle adaptando o código que você escreveu no exercício anterior (copie e cole o que você fez antes se você quiser).

source: The programs we wrote so far are missing a fundamental point in computing. Actually, it is all about processing <b>data</b> through specific <b>instructions</b>. In the buggle world, the main data are a bit hidden behind the graphical representation, but that's no reason to never manipulate some data explicitly.
pt_br: Os programas que escrevemos até agora não tem um ponto fundamental da computação. Na verdade, é sobre processar <b>dados</b> através de <b>instruções</b> específicas. No mundo dos buggles, os dados principais estão escondidos atrás de uma representação gráfica, mas isto não é motivo para nunca manipular alguns dados explicitamente.

source: Data in [!thelang]
pt_br: Dados em [!thelang]

source: In a program, you can use several <i>types</i> of data, such as integers or strings of chars. If you want to use a data several times, you need to store it within a <i>variable</i>, which is a memory cell containing a value: you put your data (say the value '5') in the variable (say 'length'), and you can retrieve it later when you need it. That's very similar to a box of label 'gift' in which you would put some stuff, like a bottle of perfume "Channel N°5".
pt_br: Num programas, você pode usar vários <i>tipos</i> de dados, tais como números inteiros ou cadeias de caracteres ou caracteres. Se você quiser usar um dado várias vezes, você precisa armazenar ele numa <i>variável</i>, que é uma célula de memória contendo um valor: você bota seu dado (digamos o valor '5') na variável (digamos 'comprimento'), e você pode recuperá-la mais tarde quando precisar dela. Isto é muito similar a uma caixa com o rótulo 'presente' na qual você pode colocar alguma coisa, como um perfume "Channel N°5".

source: Variable declarations
pt_br: Declaração de variáveis

source: <b>Declaring</b> (ie, creating) a variable in [!thelang], is very simple. You just need to write [!java]its type, a space, and the variable name.[/!] [!scala]the <code>var</code> keyword, the variable name, a column (:) and the variable type an equal sign (=) and an initial value.[/!] [!python]the variable name, an equal sign (=) and an initial value.[/!] The variable name is the label to retrieve it afterward[!python].[/!] [!java|scala] while the type is the kind of data that this variable accepts to store.[/!] It is forbidden to use spaces in variable names. You can name a variable <code>stepAmount</code> if you want, but <code>step amount</code> is not a valid name.
pt_br: <b>Declarar</b> (ie, criar) uma variável em [!thelang], é muito simples. Você simplesmente escreve [!java]seu tipo, um espaço, e o nome da variável.[/!] [!scala]a palavra-chave <code>var</code>, o nome da variável, um dois-pontos (:) e o tipo da variável, um sinal de igualdade (=) e um valor inicial.[/!] [!python]o nome da variável, um sinal de igual (=) e um valor inicial.[/!] O nome da variável é o rótulo para recuperar ela depois[!python].[/!] [!java|scala] enquanto o tipo é o tipo de dado que a variável aceita guardar.[/!] É proibido usar espaços em nomes de variáveis. Você pode nomear uma variável <code>quantidadeDePassos</code> se você quiser, mas <code>quantidade de passos</code> não é um nome válidos.

source: So, to create a variable named <b>x</b> intended to contain integers, one should write:
pt_br: Então, para criar uma variável chamada <b>x</b> para guardar inteiros, você deve escrever:

source: If you want, you can specify the initial value of the variable by adding an equal sign (=) followed by the value after the declaration.
pt_br: Se você quiser, pode especificar o valor inicial da variável adicionando um símbolo de igual (=) seguido do valor depois da declaração.

source: So, if you want that the variable contains 5 as initial value, you should type:
pt_br: Então se você quiser que a variável tenha o valor inicial de 5, você deve digitar:

source: So, to create a variable named <b>x</b> intended to contain integers with 42 as initial value, one should write:
pt_br: Logo, para criar uma variável chamada <b>x</b> que vai guardar inteiros e com 42 como valor inicial, você deve escrever:

source: In most cases, the compiler is able to guess the type of the variable from the initialization value, and you can omit it:
pt_br: Na maioria dos casos, o compilador é capaz de adivinhar o tipo da variável baseado no valor inicial, e você pode omitir o tipo:

source: You still have to specify if you use some generic values as an initialization, such as the very particular value <code>null</code>, which type happens to be ambiguous. Even when the type is clear, you can still specify it if you prefer. So you want that the variable contains 5 as initial value, you should type:
pt_br: Você ainda tem que especificar se você usa alguns valores genéricos como uma inicialização, tais como o valor muito especial <code>null</code>, cujo tipo parece ser ambíguo. Mesmo quando o tipo é claro, você ainda pode especificar o tipo se preferir. Portanto, se você quiser que a variável contenha 5 como valor inicial, você deve digitar:

source: var x: Int = 5 <span class="comment">// I can define the type if I want to</span> var y = 10 <span class="comment">// or I can omit the type if I prefer</span>
pt_br: var x: Int = 5 <span class="comment">// Eu posso definir o tipo se eu quiser</span> var y = 10 <span class="comment">// ou posso omitir o tipo se eu preferir</span>

source: As you can see, the variables are <b>typed</b> in [!thelang], which means that they are somehow specialized: A given variable can only store data of a given type; Don't even think of storing numbers in a variable that is tailored for letters! The [!thelang] language is said to be <b>statically typed</b>.
pt_br: Como você pode ver, as variáveis são <b>tipadas</b> em [!thelang], que significa que elas são de certa forma especializadas: Uma dada variável pode armazenar apenas dados de um tipo; nem pense em guardar números em uma variável que é feita para letras! Dizemos que a linguagem [!thelang] é <b>estaticamente tipada</b>.

source: Other languages (such as Python) are less picky and allow you to store any kind of data in any variable, without restriction (those languages are said to be <b>dynamically typed</b>). This seems easier at the first glance, but this kind of restriction allows the compiler to catch more logic errors for you, which is also good. In some sense, Python is easier to write but errors can sneak in more easily than in [!thelang].
pt_br: Outras linguages (como Python) são menos charas e permitem que você guarde qualquer tipo de dado em qualquer variável, sem restrições (estas linguagens são ditas <b>dinamicamente tipadas</b>). Parecem mais fáceis à primeira vista, mas este tipo de restrição permite que o compilador perceba mais erros de lógica para você, o que é bom. Num certo sentido, Python é mais fácil de escrever mas os erros surgem com mais frequencia do que em [!thelang].

source: Here are some existing types in [!thelang]:
pt_br: Aqui estão alguns dos tipos em [!thelang]:

source: <b>[!java|c]int[/!][!scala]Int[/!]</b>, for integers;
pt_br: <b>[!java|c]int[/!][!scala]Int[/!]</b>, para inteiros;

source: <b>[!java|c]double[/!][!scala]Double[/!]</b>, for dot numbers;
pt_br: <b>[!java|c]double[/!][!scala]Double[/!]</b>, para números com vírgula;

source: <b>[!c]int[/!][!java]boolean[/!][!scala]Boolean[/!]</b>, for booleans that are values being either [!c]1[/!][!java|scala]true[/!] or [!c]0[/!][!java|scala]false[/!];
pt_br: <b>[!c]int[/!][!java]boolean[/!][!scala]Boolean[/!]</b>, para booleanos, que são valores ou [!c]1[/!][!java|scala]true[/!] ou [!c]0[/!][!java|scala]false[/!];

source: <b>[!c]char*[/!][!java|scala]String[/!]</b>, for char strings.
pt_br: <b>[!c]char*[/!][!java|scala]String[/!]</b>, para cadeias de caracteres.

source: Other languages (such as Java, Scala or C) are much more picky and prevent you to mix data types in a given variable (they are said to be <b>statically typed</b>). This seems annoying at the first glance, but this kind of restriction allows the compiler to catch more logic errors for you, which is also good. In some sense, Python is easier to write but errors can sneak in more easily.
pt_br: Outras linguagens (como Java, Scala ou C), são muito mais exigentes e impedem que você misture tipos de dados numa certa variável (dizemos que elas são <b>esticamente tipadas</b>). Isto parece inconveniente à primeira vista, mas este tipo de restrição permite que o compilador capture mais erros de lógica para você, o que também é bom. Num certo sentido, Python é mais fácil de escrever mas erros podem surgir mais facilmente.

source: If you know that the value of your "variable" will never change (eg because it contains the screen size or some other constant value), then you should make it a <b>value</b> instead of a variable. Simply change the <code>var</code> keyword with the <code>val</code> one. The compiler can then check your actions and catch your error when you inadvertently modify the value. More interestingly, the compiler can produce faster code in some cases.
pt_br: Se você sabe que o valor de sua "variável" nunca vai mudar (eg quando ela contém o tamanho da tela ou outro valor constante), então você deve fazer dela um <b>valor</b> ao invés de uma variável. Simplesmente mude a palavra-chave <code>var</code> para <code>val</code>. O compilador pode então verificar suas ações e capturar seu erro quando você inadvertidamente modificar o valor. Mais interessante ainda, o compilador pode produzir código mais rápido em alguns casos.

source: Variables work very similarly for strings, floating point numbers and boolean values.
pt_br: Variáveis funcionam muito parecido com strings, números com vírgula e valores booleanos.

source: char* name = "Martin Quinson"; double height=1.77; <span class="comment">// in meters</span> int married=1;<span class="comment">// 1 means "true"; "false" would be written 0</span>
pt_br: char* nome = "Martin Quinson"; double altura=1.77; <span class="comment">// em metros</span> int casado=1;<span class="comment">// 1 significa "verdadeiro"; falso é 0</span>

source: String name = "Martin Quinson"; double height=1.77; <span class="comment">// in meters</span> boolean married=true;<span class="comment">// the contrary would be written "false"</span>
pt_br: String nome = "Martin Quinson"; double altura=1.77; <span class="comment">// em metros</span> boolean casado=true;<span class="comment">// o contrário se escreve "false"</span>

source: val name:String = "Martin Quinson"; <span class="comment">// this cannot be modified (it's a value)</span> var height: Double = 1.77; <span class="comment">// in meters</span> var married = true; <span class="comment">// the contrary would be written "false"</span> <span class="comment">// Scala knows that 'true' is a Boolean value, no need to repeat it here</span>
pt_br: val nome:String = "Martin Quinson"; <span class="comment">// isto não pode ser modificado (é um valor)</span> var altura: Double = 1.77; <span class="comment">// em metros</span> var casado = true; <span class="comment">// o contrário se escreve "false"</span> <span class="comment">// Scala sabe que 'true' é um valor Booleano, não precisa repetir</span>

source: firstName = "Martin" lastName = 'Quinson' <span class="comment"># both single and double quote work here</span> motto = "I never finish anyth' (but I keep trying)" <span class="comment"># having single quote within double quote is fine</span> height=1.77 <span class="comment"># in meters</span> married=True <span class="comment"># the contrary would be written "False"</span>
pt_br: firstName = "Martin" lastName = 'Quinson' <span class="comment"># aspas e aspas simples funcionam aqui</span> frase = "uma gota d'água é sempre melhor que nada" <span class="comment"># uma aspas simples entre aspas duplas vale</span> altura=1.77 <span class="comment"># em metros</span> casado=True <span class="comment"># o contrário se escreve "False"</span>

source: Affectations
pt_br: Atribuições

source: Once your variable is declared, you can <b>affect</b> a new value to it later in the program. That's really easy:
pt_br: Uma vez que sua variável está declarada, você pode <b>atribuir</b> um novo valor para ela mais tarde no programa. Isto é bem fácil:

source: To the right of the equal symbol, you can put an arithmetic expression containing constants, variables and operations.
pt_br: À esquerda do símbolo de igual você pode colocar uma expressão aritmética contendo constantes, variáveis e operações.

source: x = 3 + 2[!java|c];[/!] x = 3 * x[!java|c];[/!] [!java|scala|python]greeting = "Hello "+name[!java];[/!] <span class="comment">[!python]#[/!][!scala|java]//[/!] + is (also) the operation to concatenate (ie, to join) strings[/!]</span>
pt_br: x = 3 + 2[!java|c];[/!] x = 3 * x[!java|c];[/!] [!java|scala|python]saudação = "Oi "+nome[!java];[/!] <span class="comment">[!python]#[/!][!scala|java]//[/!] + é (também) a operação para concatenar (ie, para juntar) strings[/!]</span>

source: It is now time to do more challenging exercises, don't you think? The objective is now to move forward until you find a baggle, pick it up, and then move back to your initial location before dropping the baggle.
pt_br: Agora vamos fazer exercícios mais desafiantes, certo? O objetivo agora é mover para a frente até encontrar um baggle, pegar ele e se mover para trás até a localização inicial antes de sotar o baggle.

source: How to do this?
pt_br: Como fazer isto?

source: To solve this problem, you have to decompose it in easier sub-parts. For example, you may want to do the following steps:
pt_br: Para resolver este problema, você tem que docompor ele em sub-partes menores. Por exemplo, você pode querer fazer os passos seguintes:

source: Move forward until located over a baggle
pt_br: Mover para a frente até se colocar sobre um baggle

source: Pickup the baggle
pt_br: Pegar o baggle

source: Move backward of the same amount of steps than done in first step
pt_br: Mover para trás a mesma quantidade de passos que deu no primeiro passo

source: Drop back the baggle
pt_br: Soltar o baggle de novo

source: Naturally, it is impossible to do the right amount of steps backward at step 3 if you didn't count the amount of steps done in the first phase. You can use a variable for that, which can be named <code>stepAmount</code>.
pt_br: Naturalmente, é impossível dar a quantidade certa de passos para trás no passo 3 se você não contou a quantidade de passos dados na primeira fase. Você pode usar uma variável para isto, que pode ser chamada <code>quantidadeDePassos</code>.

source: Create an integer variable before phase 1, initialize it to 0, and each time you move one step forward, increment its value by one (<code>stepAmount = stepAmount + 1;</code>[!java|c] or <code>stepAmount++;</code>, both syntaxes being equivalent[/!]). Such variable which takes every values of a given range is often called a <b>stepper</b>.
pt_br: Crie uma variável inteira antes da fase 1, inicie ela com 0 e a cada vez que der um passo para frente, incremente ela de um (<code>quantidadeDePassos = quantidadeDePassos + 1;</code>[!java] ou <code>quantidadeDePassos++;</code>, ambas as sintaxes são equivalentes[/!]). Tais variáveis que pegam cada valor de um dado intervalo são normalmente chamadas de <b>stepper</b>.

source: If you know Java or other languages, you will probably try to use the <code>++</code> operator to increment the variable, but it's not allowed in [!thelang]. This is because it would be difficult to define this operator for every data types. For example, what should ++ do when applied to a Complex value or to a String? The problem does not occur in Java as <code>int</code> is not an object but a primitive type. (if you don't know the <code>++</code>, just ignore this paragraph: it does not exist in [!thelang])
pt_br: Se você conhece Java ou outras linguagens, você provavelmente vai tentar usar o operador <code>++</code> para incrementar a variável, mas isto não é permitido em [!thelang]. Isto é por que seria difícil definir este operador para todos os tipos de dados. Por exemplo, o que faria ++ quando aplicado a um valor complexo ou a uma String? O problema não ocorre em Java pois <code>int</code> não é um objeto e sim um tipo primitivo. (se você não conhece o <code>++</code>, simplesmente ignore este parágrafo: ele não existe em [!thelang])

source: Then, phase 3 consists in simply creating a new integer variable <code>doneSteps</code> initialized to 0, and do one step backward as long as <code>doneSteps</code> is not equal to <code>stepAmount</code>, incrementing <code>doneSteps</code> each time. The <code>!=</code> operator should be used to test the inequality (whether some values are NOT equal).
pt_br: Então, a fase 3 consiste em simplesmente criar uma nova variável inteira <code>passosDados</code> iniciada como 0, e dar um passos para trás enquanto <code>passosDados</code> não for igual a <code>quantidadeDePassos</code>, aumentando <code>passosDados</code> a cada vez. O operador <code>!=</code> deve ser usado para testar a inequação (quando um valor NÃO É igual).

source: It's your turn now!
pt_br: É sua vez agora!

source: Run Four bases
pt_br: Ande quatro bases

source: Today is a great day for the buggles: the Big Buggles' Race begun. It's a traditional competition in which young buggles prove their value to the tribe. Both force and intelligence is exercised: you have to rush forward, but stop as soon as you reach your fourth baggle. Please help the buggles to move forward while counting the baggles and to determine when to stop.
pt_br: Hoje é um grande dia para os buggles: a grande corrida dos Buggles começou. Esta é uma competição tradicional na qual jovens buggles mostram seu valor para a tribo. Tanto força quanto inteligência são exercitados: você tem que correr, mas parar assim que alcançar o quarto baggle. Por favor, ajude os buggles a se moverem para frente enquanto conta os baggles e determina quando parar.

source: The Four Halves run
pt_br: A corrida dos quatro meios

source: Here is the second day of the Big Buggles' Race. As previously, you have to run forward until you reach the right cell to stop on. But this time, you have to reach the cell where the amount of baggles you saw is the double of the orange cells plus 1. In other words, the following condition must become true: <code>2 * baggles = orangeCells + 1</code>.
pt_br: Chegamos ao segundo dia da grande corrida dos Buggles. Como antes, você tem que correr até alcançar a célula certa para parar. Mas desta vez, você tem que alcançar a célula onde a quantidade de baggles que você viu é o dobro da quantidade de células laranjas mais 1. Em outras palavras, a seguinte condição deve se tornar verdadeira <code>2 * baggles = célulasLaranjas + 1</code>.

source: You can determine whether you are over a orange cell with the <code>isOverOrange()</code> method.
pt_br: Você pode determinar quando você está sobre uma célula laranja com o método <code>estáSobreLaranja()</code>.
