Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: The CamelCase convention is used everywhere in PLM because this program is written in Java itself, so we kept our habits when adding new languages. But the fact that the Python bindings of PLM use the CamelCase instead of the snake_case is considered as a bug that we will fix in further releases.
pt_br: A convenção CamelCase é sempre usada no PLM por que este programa foi escrito em Java, então mantivemos o hábito quando inserimos novas linguagens. Mas o fato de os vínculos Python do PLM usarem CamelCase e não snake_case é considerado um bug que será corrigido em algum lançamento futuro.

source: The goal of this exercise is to write a method called <code>goAndGet()</code> which does the same than in a previous exercises (move forward until over a baggle, pick it up, move back to initial position, drop baggle).
pt_br: O objetivo deste exercício é escrever um método chamado <code>vaiEPega()</code> que faça a mesma coisa que foi feita num exercício anterior (vai para a frente até estar sobre um baggle, pega ele, vai para trás até a posição inicial e solta o baggle).

source: This exercise is a bit different because you will not write all of the code executed by the buggle. Instead, you should only write one method that get called automagically added when you click on <b>Start</b>. Your buggle calls your <code>goAndGet()</code> method on each row, until the baggle is found. [!python|scala]The code for that is already provided under the <code>goAndGet()</code> method, but you probably don't want to change it.[/!] [!java]You don't need to write the code calling <code>goAndGet()</code> yourself. It's automagically there already, even if you cannot see it.[/!]
pt_br: Este exercício é um pouco diferente por que você não vai precisar escrever todo o código executado pelo buggle. Ao invés disto, você deve apenas escrever um método que será chamado automagicamente quando você clica em <b>Iniciar</b>. Seu buggle vai chamar seu método <code>vaiEPega()</code> em cada linha, até que o baggle seja encontrado. [!python|scala]O código para isto já está pronto no método <code>vaiEPega()</code>, mas você provavelmente não vai querer mudar isto. [/!] [!java]Você não precisa escrever o código chamado <code>vaiEPega()</code>. Ele já está lá automaticamente, mesmo se você não possa vê-lo.[/!]

source: But for that to work, you have to actually write this <code>goAndGet()</code> method now.
pt_br: Mas para isto funcionar, você tem que na verdade escrever este método <code>vaiEPega()</code> agora.

source: We now would like to teach the buggle to build a doghouse. The naive approach consists in directly writing the needed code as follows. This works because the buggle of this exercise leaves a red path as it moves.
pt_br: Agora nós queremos ensinar ao buggle como construir uma casa de cachorro. A abordagem simplória consiste em escrever diretamente o código necessário como segue. Isto funciona por que o buggle deste exercício deixa um caminho vermelho à medida em que anda.

source: [!c]stepForward()[/!][!python|java|scala]forward()[/!][!java|c];[/!] [!c]stepForward()[/!][!python|java|scala]forward()[/!][!java|c];[/!] left()[!java|c];[/!] [!c]stepForward()[/!][!python|java|scala]forward()[/!][!java|c];[/!] [!c]stepForward()[/!][!python|java|scala]forward()[/!][!java|c];[/!] left()[!java|c];[/!] [!c]stepForward()[/!][!python|java|scala]forward()[/!][!java|c];[/!] [!c]stepForward()[/!][!python|java|scala]forward()[/!][!java|c];[/!] left()[!java|c];[/!] [!c]stepForward()[/!][!python|java|scala]forward()[/!][!java|c];[/!] [!c]stepForward()[/!][!python|java|scala]forward()[/!][!java|c];[/!] left()[!java|c];[/!]
pt_br: [!c]avançarUmPasso()[/!][!python|java|scala]avançar()[/!][!java|c];[/!] [!c]avançarUmPasso()[/!][!python|java|scala]avançar()[/!][!java|c];[/!] left()[!java|c];[/!] [!c]avançarUmPasso()[/!][!python|java|scala]avançar()[/!][!java|c];[/!] [!c]avançarUmPasso()[/!][!python|java|scala]avançar()[/!][!java|c];[/!] left()[!java|c];[/!] [!c]avançarUmPasso()[/!][!python|java|scala]avançar()[/!][!java|c];[/!] [!c]avançarUmPasso()[/!][!python|java|scala]avançar()[/!][!java|c];[/!] left()[!java|c];[/!] [!c]avançarUmPasso()[/!][!python|java|scala]avançar()[/!][!java|c];[/!] [!c]avançarUmPasso()[/!][!python|java|scala]avançar()[/!][!java|c];[/!] left()[!java|c];[/!]

source: It becomes harder when we want to draw two doghouses: we have to rewrite the same code twice, which is not really handy. When the code becomes a bit long as this one, it becomes easier to see why we insist since a while on the pure evilness that code duplication represents. Indeed, if you realize that an error sneaked into a code that you copied at several locations, you will have to fix it several times. And mind your back if you forget one of these locations.
pt_br: Vai ficar mais difícil se tivermos que desenhar duas casas de cachorro: teremos que reescrever o mesmo código duas vezes, o que não é muito prático. Quando o código se torna um pouco longo como este, torna-se fácil ver por que nós insistimos já tem um tempinho namais pura maldade que duplicação de código representa. Na verdade, imagine um erro que se infiltrou no código que você copiou para vários lugares, você vai ter que corrigir várias vezes. E ai de você se esquercer de corrigir num destes lugares.

source: There is even a name to this good principle in programming: DRY/SPOT, which means "Don't Repeat Yourself / Single Point Of Truth". The latter part means that each information must be written in only one location of your program to avoid the differing locations to get out of synch when you modify your code.
pt_br: Existe até um nome para esta boa prática de programação: DRY/SPOT, que em inglês significa "Don't Repeat Yourself / Single Point Of Truth" (não se repita/ponto único de confiança). A última parte significa que cada informação deve ser escrita em apenas um local de seu programa para evitar que diferentes locais fiquem desincronizados quando você modificar o código.

source: So, let's apply this good principle and <b>factorize our code</b>, ie to write it only once, for example in a method. You should even to go further by factorizing the method body with a <code>for</code> loop, as seen previously. If you do it correctly (what you should), you can use the method <code>left()</code> only once.
pt_br: Portanto, vamos aplicar este bom princípio de programação e <b>fatorizar seu código</b>, ie escrever ele apenas uma vez, por exemplo em um método. Você pode ir até mais longe fatorizando o corpo do método com um loop <code>for</code>, como visto anteriormente. Se você faz isto corretamente (o que se espera), dá para você usar o método <code>esquerda()</code> apenas uma vez.

source: The goal of this exercise is to write a method called <code>dogHouse</code> achieving the same result than the code above, but with a for loop to keep it short. The buggle will call your creation to create several dog houses around its world.
pt_br: O objetivo deste exercício é escrever um método chamado <code>casaDeCachorro</code> que faz a mesma coisa que o código acima, mas com um loop for para mantê-lo curto. O buggle vai chamar sua criação para construir várias casas de cachorro neste mundo.

source: In this exercise, we will reproduce the geometric drawing that you can see in the "Objective" tab.
pt_br: Neste exercício, vamos reproduzir o desenho geométrico que você pode ver na aba "Objetivo".

source: Your goal (here and in any well written program) is to write the simplest possible code. For that, you have to decompose your work in sub-steps, and write a specific method for each sub-step.
pt_br: Seu objetivo (aqui e em qualquer programa bem escrito) é escrever o código mais simples possível. Para isto, você tem que decompor seu trabalho em sub-passos e escrever métodos específicos para cada sub-passo.

source: If you observe carefully the picture to draw, it is constituted of four parts depicting a sort of V. A possible decomposition is to write a method in charge of drawing a V from the current position. Its prototype can be: <code>[!java|c]void [/!]makeV()</code>
pt_br: Se você observar cuidadosamente a figura que tem que desenhar, ela é constituída de quatro partes descrevendo um V. Uma decomposição possível é escrever um método responsável por escrever um V a partir da posição atual. Seu protótipo pode ser: <code>[!java|c]void [/!]fazerV()</code>

source: In this method, you should use the methods <code>brushUp()</code> and <code>brushDown()</code> to mark the ground (you may want to factorize this in another method). It may be wise to write the <code>makeV()</code> so that it places directly the buggle in position for the next V.
pt_br: Neste método, você deve usar os métodos <code>levantarPincel()</code> e <code>abaixarPincel()</code> para marcar o chão (se quiser, faça um método só para isto). É uma decisão inteligente escrever <code>fazerV()</code> para colocar o buggle diretamente em posição para o próximo V.

source: Your turn. Your code should not be longer than 4 lines (not counting <code>makeV</code>)...
pt_br: Sua vez. Seu código não deve ser maior que 4 linhas (sem contar <code>fazerV</code>)...

source: We will now reproduce an even bigger geometrical drawing. Once again, you can see the model by clicking on the "Objective" tab.
pt_br: Vamos agora reproduzir um desenho geométrico ainda maior. Novamente, você pode ver o modelo clicando na aba "Objetivo".

source: You can naturally reuse all the code you typed in previous exercise (select the other exercise, do Ctrl-C, come back to the code of this exercise, do Ctrl-V).
pt_br: Você pode naturalmente reutilizar todo o código que você digitou em exercícios anteriores (selecione o outro exercício, faça Ctrl-C, volte para o código deste exercício e faça Ctrl-V).

source: But you want to keep your code as simple as possible. For that, define new methods to deal simply with the repetitions in the pattern. For example, a method <code>makePattern()</code> achieving the pattern of previous example seems to be a good idea (but this may not be enough).
pt_br: Mas você quer manter seu código tão simples quanto possível. Para isto, defina novos métodos para lidar simplesmente com as repetições no padrão. Por exemplo, um método <code>fazerPadrão()</code> fazendo o padrão do exemplo anterior parece ser uma boa ideia (mas pode não ser o suficiente).

source: Why don't you give it a shot? The main code method shouldn't take more than 2 lines (included in a for loop)
pt_br: Por que não tentar? O método do código principal não deve levar mais de 2 linhas (incluindo o loop for)

source: As you can imagine, you have to reproduce the geometric drawing depicted in the "Objectives" tab. As you can see, it is even bigger than the previous one.
pt_br: Como você pode imaginar, você vai ter que reproduzir o desenho geométrico descrito na aba "Objetivos". Como você pode ver, ele é até maior que o anterior.

source: You thus have to declare even more methods to use the repetitions of the pattern and factorize your code. Your turn...
pt_br: Portanto você tem que declarar até mais métodos para usar as repetições do padrão e fatorar seu código. Sua vez...

source: Functions
pt_br: Funções

source: Quite often, you want to write a method that compute some value and returns it. Methods returning results are called <b>functions</b>. Writing a function is not really harder than writing a simple method. [!java|c]You simply have to specify the data type of expected results before the function name (where we previously had <code>void</code>).[/!] [!scala]You simply have to add a colon (:) after the parenthesis and write the type of data that your function will return, and add an equal sign (=). This syntax is actually rather close to defining a variable, with its type, that is actually a function.[/!] You can use the <code>return</code> instruction anywhere in your function body to specify that the computation is done (the function is not further executed), and that the result is the value following the <code>return</code> keyword.
pt_br: Frequentemente, você vai querer escrever um método que calcula algum valor e o retorna. Métodos retornando resultados são chamados <b>funções</b>. Escrever uma função não é realmente mais difícil do que escrever um simples método. [!java|c]Você simplesmente tem que especificar o tipo de dados do resultado esperado entes do nome da função (onde nós previamente tínhamos <code>void</code>).[/!] [!scala]Você simplesmente tem que adicionar um dois-pontos (:) depois do parêntesis e escrever o tipo de dados que sua função vai retornar, e adicionar um símbolo de igualdade (=). Esta sintaxe é na verdade mais próxima de definir uma variável, com seu tipo, do que na verdade escrever uma função.[/!] Você pode usar a instrução <code>return</code> em qualquer lugar do corpo da sua função para especificar que o cálculo foi feito (a função não continuará sendo executada), e que o resultado é o valor que acompanha a palavra-chave <code>return</code>.

source: Actually, you can also use that <code>return</code> keyword in methods that do not return any result, to interupt the computation. Of course, you should not provide any value to return in that case.
pt_br: Na verdade, você também pode usar a palavra-chave <code>return</code> em métodos que não retornam qualquer resultado, para interromper o cálculo. Obviamente que nestes casos você não passa nenhum valor para retornar.

source: It is possible to have several <code>return</code> instructions in several branches of a conditional. In fact, it is forbidden to have any execution path of your body without any <code>return</code>, or to write some code after the <code>return</code> instruction. Indeed, if the machine reaches the end of the function without finding any <code>return</code>, it cannot know what actual value to give back to the function caller. Moreover, <code>return</code> interrupts immediately the function execution (why bother looking further when you know the function result?). So, if there is some code after a <code>return</code>, it must be an error and the compiler warns you.
pt_br: É possível ter várias instruções <code>return</code> em várias ramificações de um condicional. De fato, é proibido ter um caminho de execução no corpo da função sem nenhum <code>return</code>, ou escrever algum código depois da instrução <code>return</code>. Na verdade, se a máquina alcança o fim da função sem encontrar qualquer <code>return</code>, ela não sabe o real valor que deve retornar a quem chamou a função. Além disto, o <code>return</code> interrompe imediatamente a execução da função (por que se preocupar olhando além quando você sabe o resultado da função?). Então, se existe algum código depois de um <code>return</code>, deve ser um erro e o compilador irá te alertar disto.

source: [!java|scala|c][!java]boolean [/!][!c]int [/!][!scala]def [/!]isFrontFree()[!scala]:Boolean =[/!] { if (isFacingWall() == [!java|scala]true[/!][!c]1[/!]) { return [!java|scala]false[/!][!c]0[/!]; <span class="comment">/* no code allowed here */</span> } else { return [!java|scala]true[/!][!c]1[/!]; <span class="comment">/* here neither */</span> } <span class="comment">/* even here, forget it */</span> }[/!][!python]def isFrontFree(): if isFacingWall() == True: return False <span class="comment"># no code allowed here</span> else return True <span class="comment"># here neither</span> <span class="comment"># even here, forget it</span>[/!]
pt_br: [!java|scala|c][!java]boolean [/!][!c]int [/!][!scala]def [/!]isFrontFree()[!scala]:Boolean =[/!] { if (estáDeFrenteParaParede() == [!java|scala]true[/!][!c]1[/!]) { return [!java|scala]false[/!][!c]0[/!]; <span class="comment">/* proibido colocar código aqui */</span> } else { return [!java|scala]true[/!][!c]1[/!]; <span class="comment">/* nem aqui */</span> } <span class="comment">/* e nem mesmo aqui. desista */</span> }[/!][!python]def livreEmFrente(): if estáDeFrenteParaParede() == True: return False <span class="comment"># proibido colocar código aqui</span> else return True <span class="comment"># nem aqui</span> <span class="comment"># e nem mesmo aqui, desista</span>[/!]

source: You will once again write a function that the buggle will use. Its name must be <code>haveBaggle</code>, and it returns a boolean value indicating whether the row in front of the buggle contains a baggle or not. The buggle will use it to search the first row containing a baggle, and stop here.
pt_br: Você vai mais uma vez escrever uma função que o buggle vai usar. Seu nome deve ser <code>temBaggle</code>, e ela retorna um valor booleano indicando se a linha na frente do buggle contém um baggle ou não. O buggle vai usar isto para buscar a primeira linha contendo um baggle, e parar nela.

source: The easier for this function is to use a boolean variable called <code>seenBaggle</code> indicating whether or not we saw a baggle so far. Its initial value is '[!python]False[/!][!scala|java]false[/!][!c]0[/!]'.
pt_br: A forma fácil de fazer esta função é usar uma variável booleana chamada <code>baggleAvistado</code> indicando se nós vimos ou não um baggle até o momento. O valor inicial é '[!python]False[/!][!scala|java]false[/!][!c]0[/!]'.

source: Then, move 6 steps forward (the world contains 7 cells and we already are on one of them). For each cell, if it contains a baggle, we store true in <code>sawBaggle</code> (and we don't do anything but moving forward if not).
pt_br: Então mova 6 passos para frente (o mundo contém 7 células e nós já estamos em uma delas). Para cada célula, se ela contiver um baggle, vamos guardar true em <code>baggleVisto</code> (e se não, vamos simplesmente andar para frente).

source: At the end, we move back by 6 steps, and we return the value of <code>seenBaggle</code> to the caller.
pt_br: No final, vamos nos mover 6 passos para trás, e retornar o valor de <code>baggleVisto</code> para quem chamou o método.

source: This exercise is a bit different since there is two initial worlds, each with a specific objective. Your code must work for each of them. Observe that the world selection scrolling menu (right below the speed slider) allows to switch the observed world.
pt_br: Este exercício é um pouco diferente já que ele tem dois mundos iniciais, cada um com um objetivo específico. Seu código deve funcionar em ambos. Observe que o menu de seleção de mundo (logo abaixo do controle de velocidade) permite que você alterne entre os mundos.

source: When your function <code>haveBaggle</code> works, proceed to next exercise.
pt_br: Quando sua função <code>temBaggle</code> funcionar, siga para o próximo exercício.

source: Don't you get tired of writing again and again the code to move by a fixed amount of steps? On the other hand, writing <tt>forward2()</tt>, <tt>forward3()</tt>, <tt>forward4()</tt>, as well as <tt>backward2()</tt>, <tt>backward3()</tt>, <tt>backward4()</tt>, and so on does not really help, to say the less.
pt_br: Você não está cansado de escrever o mesmo código várias vezes para se mover uma certa quantidade de passos? Por outro lado, escrever <tt>avançar2()</tt>, <tt>avançar3()</tt>, <tt>avançar4()</tt>, assim como <tt>recuar2()</tt>, <tt>recuar3()</tt>, <tt>recuar4()</tt> e etc também não ajudam, para dizer o mínimo.

source: Luckily, it is possible to pass <b>parameters</b> to your methods. You have to specify their type and name between the parenthesis after the method name. Then, you can use them in the method body as if it were variables defined in there, and which initial value is what the caller specified.
pt_br: Felizmente, é possível passar <b>parâmetros</b> para seus métodos. Você tem que especificar o tipo e nome entre parêntesis depois do nome do método. Então, você pode usá-los no corpo do método como se eles fossem variáveis definidas lá, e com valores iniciais que o "caller" especificou.

source: [!java|c]double [/!]divideByTwo([!java|c]double [/!]x[!scala]: Double[/!])[!scala]: Double =[/!] [!java|scala|c]{[/!][!python]:[/!] return x / 2[!java|c];[/!] [!scala|java|c]}[/!]
pt_br: [!java|c]double [/!]dividirPorDois([!java|c]double [/!]x[!scala]: Double[/!])[!scala]: Double =[/!] [!java|scala|c]{[/!][!python]:[/!] return x / 2[!java|c];[/!] [!scala|java|c]}[/!]

source: As caller, you have to specify the initial value of this "variables" between the call's parenthesis.
pt_br: Como o "caller", você deve especificar o valor inicial destas "variáveis" entre parêntesis na chamada.

source: [!java|c]double [/!][!scala]val [/!]result = divideByTwo(3.14)[!java|c];[/!]
pt_br: [!java|c]double [/!][!scala]val [/!]result = dividirPorDois(3.14)[!java|c];[/!]

source: If you want several parameters, you need to separate them with comas (,) both in the declaration and calls.
pt_br: Se você quiser vários parâmetros, você precisa separar eles com vírgulas (,) tanto na declaração quanto na chamada.

source: [!java|c]double divide(double x, double y) {[/!] [!scala]def divide(x:Double, y:Double): Double = {[/!] [!python]def divide(x, y):[/!] return x / y[!java|c];[/!] [!java|scala|c]}[/!]
pt_br: [!java|c]double dividir(double x, double y) {[/!] [!scala]def dividir(x:Double, y:Double): Double = {[/!] [!python]def dividir(x, y):[/!] return x / y[!java|c];[/!] [!java|scala|c]}[/!]

source: [!java|c]double res = divide(3.14 , 1.5);[/!] [!scala]val res = divide(3.14 , 1.5)[/!] [!python]res = divide(3.14 , 1.5)[/!]
pt_br: [!java|c]double res = dividir(3.14 , 1.5);[/!] [!scala]val res = dividir(3.14 , 1.5)[/!] [!python]res = dividir(3.14 , 1.5)[/!]

source: In [!thelang], you can declare several methods of the same name as long as they don't have the same <b>signature</b>, that is, the same amount of parameters and the same parameters' types.
pt_br: Em [!thelang], você pode declarar vários métodos de mesmo nome desde que eles não tenham a mesma <b>assinatura</b>, ou seja, a mesma quantidade e tipo de parâmetros.

source: Observe that we omitted the <tt>else</tt> branches of each <tt>if</tt>. It works anyway because a <tt>return</tt> interrupts the method execution. If we arrive to the last line of <code>[!java]max(int,int)[/!][!scala]max(Int,Int):Int[/!]</code>, we know that <code>x&lt;=y</code> because otherwise, the <tt>return</tt> of line 2 would have stopped the execution.
pt_br: Observe que nós omitimos os ramos <tt>else</tt> de cada <tt>if</tt>. Isto funciona de qualquer jeito por que um <tt>return</tt> interrompe a execução do método. Se nós chegarmos à última linha de <code>[!java]max(int,int)[/!][!scala]max(Int,Int):Int[/!]</code>, vamos saber que <code>x&lt;=y</code> por que de outra forma, o <tt>return</tt> da linha 2 deveria ter parado a execução.

source: This time, you have to write a <code> [!java|c]move(int stepCount,[!java]boolean[/!][!c]int[/!] forward)[/!] [!scala]move(stepCount: Int,forward: Boolean)[/!] [!python]move(stepCount,forward)[/!] </code> method which moves forward by <code>stepCount</code> steps if <code>forward</code> is true, and moves back of that amount of steps if the boolean is false.
pt_br: Agora você vai ter que escrever um método <code> [!java|c]mover(int contaPassos,[!java]boolean[/!][!c]int[/!] forward)[/!] [!scala]mover(contaPassos: Int,forward: Boolean)[/!] [!python]mover(contaPassos,forward)[/!] </code> que move para a frente <code>contaPassos</code> passos se <code>forward</code> for verdadeiro, e move para trás a mesmas quantidade de passos se o booleano for falso.

source: This time, there is only one world but seven buggles, all sharing the same code. This code should not be really problematic for you to write, actually.
pt_br: Desta vez existe apenas um mundo mas sete buggles, todos compartilhando o mesmo código. Este código não deve te dar muito trabalho para escrever, na verdade.

source: Flower Pot
pt_br: Vaso de Flores
