Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: While the buggle didn't find the path to the escape, it must proceed the following way: pick a random integer between 0 and 2 by using the provided <code>random3()</code> method and make one of the following actions: moving forward if possible, turn left or turn right.
pt_br: Enquanto o buggle não encontra o caminho para a saída, ele deve fazer o seguinte: escolher um número inteiro entre 0 e 2 usando o método <code>random3()</code> fornecido e faz uma das seguintes ações: andar pra frente se possível, virar à esquerda ou virar à direita.

source: You don't believe that it could work? Well, give it a try, you will see... Don't forget to pick up the baggle once you've reached it.
pt_br: Você acha que isto não vai funcionar? bem, experimente e verá... Não esqueça de pegar o baggle quando chegar nele.

source: Following the walls
pt_br: Seguindo as paredes

source: This time, the maze is a bit more complicated. Random won't be enough, we ough to be smart!
pt_br: Neste momento, o labirinto é um pouco mais complicado. Aleatoriedade pode não ser suficiente, sejamos mais espertos!

source: The good news is that this maze is simpler that it seems at the first glance: every wall are connected to each other. To get out of this kind of maze, the buggle only have to follow a wall (the one on its left or the one on its right, it doesn't matter). While keeping a paw on the wall, the buggle must move forward until it finds the maze exit and this biscuit it loves so much.
pt_br: A boa notícia é que este labirinto é mais simples do que pode parecer à primeira vista: cada parede é conectada às outras. para sair deste tipo de labirinto, o buggle tem que simplesmente seguir uma parede (a que fica à sua esquerda ou à sua direita, não importa). Enquanto manter uma pata na parede, o buggle deve se mover para a frente até encontrar a saída do labirinto e o biscoitinho que ele tanto gosta.

source: This works here because there is no island of isolated walls, so our buggle cannot loop around for ever without encountering its baggle.
pt_br: Isto funciona aqui por que não existem ilhas ou paredes isoladas, logo o nosso buggle não vai entrar num loop para sempre sem encontrar seu baggle.

source: The goal of this exercise is to write an algorithm allowing the buggle to get out of this maze.
pt_br: O objetivo deste exercício é escrever um algoritmo que permita que o buggle saia do labirinto.

source: As said earlier, it does not matter whether you decide to follow the left wall or the right one. Simply, the demo follows the left one, so you should do the same in your solution to ease the comparison of your solution and the demo.
pt_br: Como dito anteriormente, não importa se você decide seguir a parede na esquerda ou da direita. Simplesmente, a demonstração segue a da esquerda, logo você deve fazer o mesmo em sua solução para facilitar a comparação de sua solução e da demonstração.

source: Write a method <code>keepHandOnSideWall()</code> which lets the buggle move one step forward while keeping the paw on the wall of the selected side. You must ensure that the buggle always keep the paw on the wall, but also that it won't crash into a wall. You can check the tip for more info on this, but only do so if you're stuck. Try to do it without the tip first.
pt_br: Escreva um método <code>keepHandOnSideWall()</code> que faz o buggle andar uma casa para a frente enquanto mantém a pata na parede do lado selecionado. Você deve garantir que o buggle sempre mantenha a pata na parede, mas também que ele não bata numa parede. Você pode checar a dica para mais informações sobre isto, mas faça isto apenas se você estiver perdido. Tente primeiro fazer sem a dica.

source: Then, write the whole algorithm to traverse the maze step by step (using <code>keepHandOnSideWall()</code>) until it finds the biscuit and the exit. Don't forget to pick the baggle up once you've found it.
pt_br: Então, escreva o algoritmo inteiro para percorrer o labirinto passo a passo (usando <code>keepHandOnSideWall()</code>) até encontrar o biscoito e a saída. Não esqueça de pegar o baggle quando o encontrar.

source: I'm lost, please give me some extra indications
pt_br: Estou perdido, me dê orientações extra

source: When your buggle has a wall on the left, there is three situations to consider, depending on the surrounding walls. The following table depicts each initial situation, and where you should let your buggle end after one step.
pt_br: Quando seu buggle tem uma parede à esquerda, existem três situações a considerar, dependendo das paredes em volta. A tabela a seguir explica cada situação inicial, e onde você deve deixar seu buggle parar após cada passo.

source: Case 1
pt_br: Caso 1

source: Case 2
pt_br: Caso 2

source: Case 3
pt_br: Caso 3

source: Initial situation
pt_br: Situação inicial

source: Where is the next step
pt_br: Onde é o próximo passo

source: If you do a <code>right()</code> in any case at the end of your function, it's possible to write it in 3 lines with a <code>while</code> loop.
pt_br: Se você faz um <code>right()</code> em qualquer caso no final da sua função, é possível escrever ela com 3 linhas com um loop <code>while</code>.

source: Pledge algorithm
pt_br: Algoritmo de Pledge

source: Once again, you thought that your algorithm were good enough to escape the maze, and once again, you buggle is now in a maze where your previous algorithm fails. Just give it a try: copy/paste your code and hit the "Run" button and see your creation fail. The trap is shaped like an upper case "G". The buggle enters the trap and follows the inner border. At some point, it finds the north direction free, run into that direction, and falls again in the trap.
pt_br: Novamente, você pensou que seu algoritmo era bom o suficiente para escapar do labirinto, e novamente, seu buggle está agora num labirinto onde seu algoritmo anterior falhou. Dê a ele uma chance: copie-e-cole seu código e aperte o botão "Rodar" e veja sua criação falhar. A pegadinha é no formato de um "G" maiúsculo. O buggle entra na armadilha e segue a borda interior. Em um determinado momento, ele encontra a direção norte livre, vai nesta direção, e cai de novo na armadilha.

source: The Pledge's algorithm (named after Jon Pledge of Exeter) can solve this maze.
pt_br: O algoritmo de Pledge (em homenagem a Jon Pledge of Exeter) pode resolver este labirinto.

source: This algorithm is a modification of the previous one thought to avoid obstacles. It randomly picks a heading and let the buggle move in that direction. When it encounters an obstacle, a paw (for example the left one) is kept on the wall following the obstacle while counting the turns. When the buggle is back to its original heading and when the sum of the turns is 0, the buggle leaves the obstacle and continues keeping its original heading.
pt_br: Este algoritmo é uma modificação do anterior para evitar obstáculos. Ele pega aleatoriamente uma direção e deixa o buggle ir nesta direção. Quando encontra um obstáculo, uma pata (por exemplo, a da esquerda) é mantida na parede seguindo o obstáculo enquanto conta as curvas. Quando o buggle está de volta à sua direção original e a soma das curvas deu 0, o buggle deixa o obstáculo e continua mantendo sua direção original.

source: Note that the use of "total turning" rather than just the "current direction" allows the algorithm to avoid G-shapped traps. If one proceeds left into the trap, one gets turned around a full 360 degrees by the walls. As we said before, the naive "current direction" algorithm gets into a limit cycle as it leaves the lower rightmost wall heading left and runs into the curved section on the left again.
pt_br: Observe que o uso de "total turning" ao invés de simplesmente o "current direction" permite que o algoritmo evite almadilhas no formato G. Se alguém pega a esquerda para dentro da armadilha, acaba girando 260 graus pelas paredes. Como dissemos antes, o algoritmo simplório "current direction" entra num ciclo limitado à medida em que ele deixa a parede mais à direita apontando para a esquerda e anda para a seção curvada na esquerda de novo.

source: The Pledge's algorithm does not leave the rightmost wall due to the total turning not being zero at that point. It follows the wall all the way around, finally leaving it heading left on the bottom outside
pt_br: O algoritmo de Pledge não deixa a parede mais à direita devido ao total de curvas não ser zero neste ponto. Ele segue a parede na volta toda, deixando finalmente ela apontando para a esquerda no "fundo exterior"

source: <a name="Objective"/>You now have to modify your solution to implement the Pledge algorithm to escape this maze.
pt_br: <a name="Objective"/>Agora você tem que modificar sua solução para implementar o algoritmo de Pledge para escapar deste labirinto.

source: Change your <code>keepHandOnSideWall()</code> method to count the amount of turns done by the buggle (+1 when it turns left, and -1 when it turns right). This counting may require the addition of an <code>angleSum</code> integer value in your program.
pt_br: Mude seu método <code>keepHandOnSideWall()</code> para contar a quantidade de curvas feitas pelo buggle (+1 quando gira para a esquerda, e -1 quando gira para a direita). Esta contagem pode necessitar a adição de um valor inteiro <code>angleSum</code> no seu programa.

source: Write a boolean method <code>isDirectionFree(dir)</code> indicating if the provided direction is free, ie, if you can move in that direction (Note that the demo uses the NORTH direction for that). You can retrieve the current direction of the buggle using the method <code>getDirection()</code>. You can change your direction (without moving) using <code>setDirection(dir)</code>. Don't forget to store the previous direction of your buggle (in a dedicated variable) before checking if your favorite direction is free in order to restore your state afterward.
pt_br: Escreva um método booleano <code>isDirectionFree(dir)</code> indicando se a direção dada está livre, ou seja, se você pode se mover naquela direção (Observe que a demonstração usa a direção NORTH para isto). Você pode recuperar a direção atual do buggle usando o método <code>getDirection()</code>. Você pode mudar sua direção (sem se mover) usando <code>setDirection(dir)</code>. Não esqueça de guardar a direção anterior de seu buggle (numa variável exclusiva) antes de verificar se sua direção favorita está livre para depois recuperar seu estado.

source: You may have to change the rest of your code also, but these changes should remain limited.
pt_br: Você pode ter que mudar o resto de seu código também, mas estas mudanças devem se manter limitadas.

source: Don't forget that if you have a method modifying a global variable (such as angleSum), you should ensure that it declares this variable as global. Without it, the method creates a new variable of the same name, and the global never gets modified.
pt_br: Não esqueça que se você tem um método modificando uma variável global (como angleSum), você deve garantir que ele declara esta variável como global. Sem ele, o método cria uma nova variável de mesmo nome, e a global nunca é modificada.

source: Show an additional tip
pt_br: Mostre uma dica adicional

source: Lost between islands
pt_br: Perdido entre ilhas

source: You thought that your algorithm was enough to escape mazes? Well, not every mazes...
pt_br: Você acha que seu algoritmo é suficiente para escapar de labirintos? Bem, não de todos...

source: The <i>wall follower algorithm</i> we used so far only works if the entry and the exit are placed near to walls connected to the external wall. But if the buggle begins in the middle of the maze, it may exist wall sections disconnected from the external wall.
pt_br: O <i>algoritmo de seguir paredes</i> que usamos até agora só funciona se a entrada e a saída estão próximas de paredes conectadas ao muro externo. Mas se o buggle começa na metade do labirinto, podem existir sessões de paredes desconectadas da parede externa.

source: That is why the previous strategy would let the buggle round around for ever. Indeed, the maze you should now escape from contains islands, and the buggle does not start along one of the external walls. Just give it a try if you want: copy your code over, push the run button and see your previous solution failing miserabily.
pt_br: É por isto que a estratégia anterior pode deixar o buggle dando voltas para sempre. Na verdade, o labirinto do qual você deve escapar agora contém ilhas, e o buggle não começa próximo de um dos muros externos. Experimente se você quiser: copie seu código aqui, aperte o botão rodar e veja sua solução anterior falhar vergonhosamente.

source: The method of following a wall is still good and allow to escape very efficiently some sections of the maze, so we do not want to remove it entierely. Instead, we want to stop following the wall under some conditions. Notice that the baggle lays near to the external border of the maze. So, we want to reach the border and then follow that wall. We need for example to search for the north wall before following it to the baggle.
pt_br: O método de seguir uma parede ainda é bom e permite escapar com muita eficiencia de algumas seções do labirinto, logo nós não precisamos remover ele inteiramente. Ao invés disto, queremos parar de seguir a parede sob certas condições. Observe que o baggle fica próximo da borda externa do labirinto. Logo, queremos chegar na borda e então seguir aquela parede. Precisamos, por exemplo, buscar a parede norte antes de seguí-la até o baggle.

source: To find the north wall, you simply run to the north as long as it's possible, and when facing an obstacle, you avoid it (using previous method).
pt_br: Para encontrar a parede norte, você simplesmente anda para o norte enquanto for possível, e quando encontrar um obstáculo, você deve desviar dele (usando o método anterior).

source: I'm lost now, please give me some extra indications
pt_br: Estou perdido agora, por favor me dê algumas orientações extra

source: Our new run() method will consist in two modes: our buggle will alternate between the "north runner mode" and the "left follower mode". You begin in "north runner mode", and switch to "left follower" when you have a wall at the north (do not forget to make sure you have a wall at your left before switching to "left follower" mode). You switch to "north runner" as soon as your buggle is facing north and is not in front of a wall during its trip around its left wall. The easiest way to write such a state machine is something like
pt_br: Nosso novo método run() consistirá de dois modos: nosso buggle vai alternar entra o "modo de andar para o norte" e o "modo de seguir à esquerda". Você começa no "modo de andar para o norte", e alternar para "seguir à esquerda" quando você tiver uma parede a norte (não esqueça de garantir que você tem uma parede à sua esquerda antes de alternar para o modo "seguir a esquerda"). Você alterna para "andar para o norte" assim que seu buggle estiver olhando para o norte e não estiver em frente a um muro durante sua viagem ao redor de seu muro à esquerda. A forma mais fácil de escrever tal máquina de estado é algo como

source: [!scala]var state=0; state match { case 0 => // North runner ... state = 1; case 1 => // Left follower ... state = 0; case _ => println("This case should not happen. Please fix me") }[/!][!java|c]int state=0; switch (state) { case 0: // North runner ... state = 1; break; case 1: // Left follower ... state = 0; break; }[/!][!python]northRunner = True if northRunner: ... northRunner = False else: # left follower ... northRunner = True[/!]
pt_br: [!scala]var state=0; state match { case 0 => // para o norte ... state = 1; case 1 => // seguir a esquerda ... state = 0; case _ => println("Isto não deveria acontecer. Favor me conserte") }[/!][!java|c]int state=0; switch (state) { case 0: // para o norte ... state = 1; break; case 1: // seguir a esquerda ... state = 0; break; }[/!][!python]northRunner = True if northRunner: ... northRunner = False else: # left follower ... northRunner = True[/!]

source: Don't forget the default case (matching _), or scala will issue an error since your matching would be incomplete.[/!]
pt_br: Não esqueça do caso default (matching _), ou scala vai dar erro já que o seu "matching" vai estar incompleto.[/!]

source: Don't forget to let the buggle pick the baggle at the end of your code.
pt_br: Não esqueça de deixar o buggle pegar o baggle no final do código.

source: You're up. That should be enough for you to figure out how to escape this maze, but if not, you can always request for the tip. But you do not need any more help, do you?
pt_br: Tudo pronto. Isto deve ser o suficiente para você descobrir como sair deste labirinto, e se este não for o caso, você sempre pode pedir uma dica. Mas você não vai precisar, correto?

source: Basic Shortest Path algorithm
pt_br: Algoritmo básico do caminho mais curto

source: To conclude with this introductory lesson to maze solving algorithms, we will investigate another way to find the exit. The buggle in this lesson is a special buggle: he is a jedi. He can feel the Force. This means he is able to feel his environment.
pt_br: Para concluir com esta lição introdutória em algoritmos de resolução de labirintos, vamos investigar outra forma de encontrar a saída. O buggle nesta lição é um buggle especial: ele é um jedi. Ele pode sentir a Força. Isto significa que ele é capaz de sentir o ambiente.

source: Without even leaving his position, he can retrieve information about the world he is leaving in, with the following functions:
pt_br: Sem nem sequer sair da sua posição, ele pode recuperar informações sobre o mundo que está vivendo, com as seguintes funções:

source: <code>getWorldWidth()</code> gives the width of its world.
pt_br: <code>getWorldWidth()</code> da a largura ("width") do mundo.

source: <code>getWorldHeight()</code> gives the height of its world.
pt_br: <code>getWorldHeight()</code> da a altura ("height") do mundo.

source: <code>hasTopWall(x,y)</code> tells whether the cell (x,y) of this world has a wall on top.
pt_br: <code>hasTopWall(x,y)</code> diz se a célula (x,y) deste mundo tem uma parede no topo.

source: <code>hasLeftWall(x,y)</code> tells whether the cell (x,y) of this world has a wall on the left.
pt_br: <code>hasLeftWall(x,y)</code> diz se a célula (x,y) deste mundo tem uma parede na esquerda.

source: <code>hasBaggle(x,y)</code> tells whether the cell (x,y) of this world has a baggle.
pt_br: <code>hasBaggle(x,y)</code> diz se a célula (x,y) deste mundo tem um baggle.

source: <code>setIndication(x,y,i)</code> adds the integer indication <code>i</code> to the cell (x,y).
pt_br: <code>setIndication(x,y,i)</code> adiciona a indicação inteira <code>i</code> à célula (x,y).

source: <code>getIndication(x,y,i)</code> retrieves the integer indication of the cell (x,y) (or 9999 if there is no indication).
pt_br: <code>getIndication(x,y,i)</code> obtém a indicação inteira da célula (x,y) (ou 9999 se não houver indicação).

source: It has to be noted that it is not possible to build a wall on the bottom edge or on the right edge of a cell. Therefore when such wall exists, it means it was built on a sibling cells -- as a top (respectively left) wall on the cell that is located below (respectively at the right of) the current cell.
pt_br: Note que não é possível construir uma parede na borda de baixo ou na borda à direita de uma célula. portanto, se tal parede existe, significa que foi construído nas células vizinhas -- como uma parede na borda de cima (respectivamente da esquerda) da célula que é localizada abaixo (respectivamente à direita) da célula atual.

source: Your buggle should first write the distance to the exit on each cell (or at least the useful ones).
pt_br: Seu buggle deve primeiro escrever a distância para a saída em cada célula (ou pelo menos nas células úteis).

source: For that, find the exit and write 0 there. Then, write 1 on every neighboring cells that is not separated from the exit with a wall. And then mark every cells from which you can reach the exit in 2 steps, and iterate for all cells until all cells are marked.
pt_br: Para isto, encontre a saída e escreva 0 lá. Então, escreve 1 em cada célula vizinha que não esteja separada da saída por uma parede. E então marque cada célula a partir da qual você possa alcançar a saída em 2 passos, e itere para todas as células até que todas as células estejam marcadas.

source: Once the cells are marked, get your jedi buggle to follow the shortest path. Basically the buggle has only to walk on each case with the lesser distance from the exit. You can use the method <code>setDirection(direction)</code> to make your buggle look at the specific direction such as <code>[!scala|java|python]Direction.[/!]NORTH</code> or <code>[!scala|java|python]Direction.[/!]EAST</code>.
pt_br: Uma vez que as células estejam marcadas, leve seu buggle jedi para percorrer a caminho mais curto. Basicamente o buggle tem apenas que andar em cada caso com a menor distância à saída. Você pode usar o método <code>setDirection(direction)</code> para fazer seu buggle virar para a direção específica como <code>[!scala|java|python]Direction.[/!]NORTH</code> ou <code>[!scala|java|python]Direction.[/!]EAST</code>.

source: I'm lost now. Please give me some extra indications.
pt_br: Estou perdido agora. Por favor, me dê algumas indicações extra.

source: Use the Force, Luke!
pt_br: Usa a Força, Luke!

source: Finding the walls to follow
pt_br: Encontrando as paredes para seguir

source: This is exactly the same maze than before, but the buggle does not start at the same location. In particular, it does not have any wall to its left at the beginning.
pt_br: Este é exatamente o mesmo labirinto que o anterior, mas o buggle não inicia na mesma localização. Em particular, não existe nenhuma parede à esquerda dele no início.

source: As a result, the method you wrote for the previous exercise probably don't work for this one. If you use it here with no modification, your buggle probably start looping over the four free cells around its start position (if that's not the case, well, you didn't really stick to the mission on previous exercise. Feel lucky and proceed to the next :)
pt_br: Como resultado, o método que você escreveu para o exercício anterior provavelmente não vai funcionar neste agora. Se você usar ele aqui sem modificações, seu buggle provavelmente vai iniciar rodando nas quatro células ao redor do ponto inicial (se este não é o caso, bem, é por que você não fez o pedido no exercício enterior. Você deu sorte. Agora vá para o próximo exercício :)

source: This is because your <code>keepHandOnSideWall()</code> method has an implicit <b>pre-condition</b>: it works well if and only if the buggle has a wall to its left when you call it. Such pre-condition are very heavily used when programming. Specifying them explicitly helps understanding the code written by other, and they even allow sometimes to prove that the code works correctly.
pt_br: Isto é por que seu método <code>keepHandOnSideWall()</code> tem uma <b>pré-condição</b> implícita: ele funciona bem se e apenas se o buggle tem uma parede na esquerda quando você chama ele. Tais pré-condições são muito usadas em programação. Especificar elas explicitamente ajuda a entender o código escrito por outros, e eles até servem, às vezes, para provar que o código está funcionando corretamente.
