Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: Remember also that the amount of cells in an array can be retrieved using the <code>length</code> attribute. So, if your array is called <code>tab</code>, its size can be retrieved as <code>tab.length</code>. Note that there is no () after <code>length</code>. An attribute is a sort of variable embedded in another object (here, the array).
pt_br: Lembre também que a quantidade de células numa array pode ser recuperada usando o atributo <code>length</code>. Portanto, se sua array é chamada <code>tab</code>, seu temanho será recuperado como <code>tab.length</code>. Observe que não existe um () depois de <code>length</code>. Um atributo é como uma variável dentro de outro objeto (no caso, a array).

source: So, the last value of an array is given by <code>tab[tab.length - 1]</code>.
pt_br: Logo, o último valor de uma array é dado por <code>tab[tab.length - 1]</code>.

source: Remember also that the amount of cells in an array can be retrieved with the <code>len()</code> function. So, if your array is called <code>tab</code>, its size can be retrieved as <code>len(tab)</code>.
pt_br: Lembre também que a quantidade de células numa array pode ser recuperada com a função <code>len()</code>. Logo, se sua array é chamada <code>tab</code>, seu tamanho pode ser recuperado como <code>len(tab)</code>.

source: So, the last value of an array is given by <code>tab[ len(tab) - 1]</code>.
pt_br: Logo, o último valor de uma array é dado por <code>tab[ len(tab) - 1]</code>.

source: Index of the maximum value
pt_br: ìndice do valor máximo

source: In this exercise, you must compute the index of the tab cell containing the biggest value.
pt_br: Neste exercício, você deve calcular o índice da célula da tab contendo o maior valor.

source: For that, fill the <code>indexOfMaximum()</code> method. Its parameter is the array to explore. Should the array contain the searched value several times, you should return the index of the first occurrence.
pt_br: Para isto, complete o método <code>indiceDoMáximo()</code>. Seu parâmetro é a array para explorar. Caso a array contenha o valor buscado várias vezes, você deve retornar o índice da primeira ocorrência.

source: To solve this exercise, you should sweep over the whole array. For each value, if it's bigger than the biggest value you saw so far, you must save this new champion and its position. You will thus need 2 extra variables; the initial value of the champion could be the value of the first cell.
pt_br: Para resolver este exercício, você deve varrer a array completamente. Para cada valor, se ele for maior que o maior até o momento, este passa a ser o novo maior e você guarda o valor e a posição dele. Você precisa de 2 variáveis extras; o valor inicial do maior pode ser o valor da primeira célula.

source: Average value
pt_br: Valor médio

source: The objective of this exercise is to compute the average value of the integer values stored in an array.
pt_br: O objetivo deste exercício é calcular o valor médio dos valores inteiros armazenados numa array.

source: You have to fill the body of the method <code>average()</code> which takes as parameter the array of integers of which it computes and returns the average value. Please note that this method must return an integer.
pt_br: Você tem que preencher o corpo do método <code>media()</code> que pega como parâmetro a array de inteiros da qual ele calcula e retorna o valor médio. Por favor note que este método deve retornar um inteiro.

source: To compute the average value of an integer, it is necessary to traverse the whole array and to compute the sum of all its values (so you will need a variable to store this temporary result), then you have to divide this sum by the size of the array.
pt_br: para calcular o valor médio de um inteiro, é necessário percorrer toda a array e calcular a soma de todos os valores (logo, você precisa de uma variável para armazenar este valor temporário), e por fim dividir esta soma pelo tamanho da array.

source: In Java, you can get the size of an array <code>myarray</code> by consulting its <code>length</code> attribute (in other words, <code>myarray.length</code>). Notice that there is no parenthesis after <code>length</code>.
pt_br: Em Java, você pode obter o tamanho de uma array <code>minhaarray</code> ao consultar seu atributo <code>length</code> (tamanho) (em outras palavras, <code>minhaarray.length</code>). Observe que não existe parêntesis depois do <code>length</code>.

source: In python, retrieving the size of an array <code>myarray</code> is as easy as calling <code>len(myarray)</code>.
pt_br: Em python, recuperar o tamanho de uma array <code>minhaarray</code> é tão fácil como chamar <code>len(myarray)</code>.

source: Maximal value
pt_br: Valor maximal

source: In this exercise, you must compute the maximal value contained in an array. For that, fill the <code>maximum()</code> method, which parameter is the array to explore.
pt_br: Neste exercício, você deve calcular o valor maximal contido numa array. Para isto, preencha o método <code>maximum()</code>, cujo parâmetro é a array para explorar.

source: To compute this value, sweep over the whole parameter. For each value, if it's bigger than the biggest value you saw so far, you must save this value somewhere to remember it afterward. You thus need an extra variable, which can be initialized to the value of the first array cell.
pt_br: Para calcular este valor, percorra o parâmetro todo. Para cada valor, se ele for maior que o maior valor até o momento, você deve gravar este valor em algum lugar para lembrar dele mais tarde. Você vai precisar então de uma variável extra, que pode ser iniciada para o valor da primeira célula do array.

source: Occurrence of a value
pt_br: Ocorrência de um valor

source: In this exercise, you must compute the amount of occurrences of a given value in an array (that is, the amount of time that this value appears in the array). For that, fill the <code>occurrences()</code> method, which returns the number of occurrence of <code>lookingFor</code> in <code>tab</code>.
pt_br: Neste exercício, você deve calcular a quantidade de ocorrências de um dado valor numa array (ou seja, a quantidade de tempo que este valor aparece na array). Para isto, preencha o método <code>occurrences()</code>, que retorna o número de ocorrências de <code>lookingFor</code> em <code>tab</code>.

source: To compute this value, simply sweep over the array counting for the amount of cells containing the searched value. You thus need an extra variable for that.
pt_br: Para calcular este valor, simplesmente parcorra a array contando a quantidade de células contendo o valor procurado. Você vai precisar de uma variável extra para isto.

source: Maxima and Minima
pt_br: Máximo e Mínimo

source: In this exercise, you must return the difference between the maxima (i.e., the largest value of the array) and the minima (i.e., its smallest value). The returned value is then a positive number. Beware, you can only do one traversal of the array to gather all informations that you need.
pt_br: Neste exercício, você deve retornar a diferença entre o máximo (i.e., o maior valor da array) e o mínimo (i.e., o menor valor). O valor retornado é então um número positivo. Mas atenção, você só pode percorrer o array uma vez para obter todas as informações de que necessita.

source: Second Biggest Value
pt_br: Segundo Maior Valor

source: In this exercise, you must compute the second maximal value contained in an array, i.e. the value that becomes the maximum if you remove every instance of the current maximum from the array.
pt_br: Neste exercício, você deve calcular o segundo valor maximal contido numa array, ou seja o valor que se torna máximo se você remover cada instância do máximo atual da array.

source: As usual, you should gather the information in only one traversal of the array. You can assume that the second biggest value actual exists (there is at least two distinct values in the array), and that all values in the array are greater than [!python] -100000000.[/!] [!java|scala]<code>Integer.MIN_VALUE</code> (which is the smallest representable integer existing in [!thelang]).[/!]
pt_br: Como normalmente, você deve obter informações em apenas uma passagem pela array. Você pode assumir que o segundo maior valor "actual" existe (existe pelo menos dois valores distintos na array), e que todos os valores na array são maiores que [!python] -100000000.[/!] [!java|scala]<code>Integer.MIN_VALUE</code> (que é o menor inteiro representável que existe em [!thelang]).[/!]

source: Given an array of integers, return true if .. 1, 2, 3, .. appears in the array somewhere.
pt_br: Dada uma array de inteiros, retorna verdadeiro (true) se .. 1, 2, 3, .. aparece em algum lugar da array.

source: This exercise was converted to PLM from the excellent exercising site http://codingbat.com/
pt_br: Este exercício foi convertido para o PLM do excelente sítio de exercícios http://codingbat.com/

source: Given an array of integers, return the number of times that two 6's are next to each other in the array. Also count instances where the second "6" is actually a 7.
pt_br: Dada uma array de inteiros, retorna o número de vezes no qual dois 6 estão vizinhos na array. Também conta as instâncias onde o segundo "6" é na verdade um 7.

source: Given an array of integers, return the number of 9's in the array.
pt_br: Dada uma array de inteiros, retorna o número de 9's na array.

source: Given an array of integers, return true if one of the first 4 elements in the array is a 9. The array length may be less than 4.
pt_br: Dada uma array de inteiros, retorna verdadeiro (true) se um dos primeiros 4 elementos na array é um 9. O comprimento da array pode ser menor que 4.

source: NoTriples
pt_br: NenhumaTripla

source: Given an array of integers, we'll say that a triple is a value appearing 3 times in a row in the array. Return true if the array does not contain any triples.
pt_br: Dada uma array de inteiros, digamos que uma tripla é um valor que aparece 3 vezes seguidas na array. Retorne verdadeiro se a array não contém nenhuma tripla.

source: Given an array of integers, return true if it contains a 2, 7, 1 pattern -- a value, followed by the value plus 5, followed by the initial value minus 1. So, 2,7,1 is such a pattern because 7 is 5+2 and 1 is 2-1. 3,8,2 is also such a pattern.
pt_br: Dada uma array de inteiros, retorne verdadeiro se ela contém um padrão 2, 7, 1 -- um valor, seguido dele mais 5, seguinte dele menos 1. Então, 2,7,1 é um exemplo deste padrão pois 7 é 5+2 e 1 é 2-1. 3,8,2 é outro exemplo.

source: Additionally the 271 counts even if the "1" differs by 2 or less from the correct value.
pt_br: Acicionalmente, o 271 "counts even" se o "1" difere por 2 ou menos do valor correto.

source: Golomb sequence
pt_br: sequência de Golomb

source: The Golomb sequence is a non-decreasing integer sequence where a(n) is the number of times that n occurs in the sequence, with a(1) = 1.
pt_br: A sequência de Golomb é uma sequência de inteiros não decrescente onde a(n) é o número de vezes que n ocorre na sequência, com a(1) = 1.

source: Since a(1)=1, it means that 1 occurs only once in the sequence, so a(2) must be different. Since the sequence is non-decreasing, a(2) must be greater than 1. Since a(2)>1, the digit 2 must appear more than one time in the sequence. So a(2)=2.
pt_br: Como a(1)=1, significa que 1 ocorre apenas uma vez na sequência, então a(2) deve ser diferente. Uma vez que a sequência é não-decrescente, a(2) deve ser maior que 1. Como a(2)>1, o dígito 2 deve aparecer mais de uma vez na sequência. Logo, a(2)=2.

source: Since a(2)=2, there is two 2 in the sequence, so we know the value of a(3). And so on for the other values of the sequence.
pt_br: Como a(2)=2, existem duas ocorrências de 2 na sequência, logo nós sabemos o valor de a(3). E assim por diante para os outros valores da sequência.

source: Write a function that computes the Nth element of the sequence.
pt_br: Escreva uma função que calcule o N-ésimo elemento da sequência.

source: Buggles' Island
pt_br: Ilha dos Buggles

source: You just received the traveling notes of your old aunt who traveled accross the country of the Buggles' Islands. She wrote down the altitude every kilometer during her trip, resulting in a sequence of numbers as follows.
pt_br: Você acaba de receber as anotações de viagem da sua velha tia que atravessou o país das Ilhas dos Buggles. Ela escreveu a altitude a cada quilômetro durante a viagem, resultando numa sequência de números como segue.

source: Here is a cut of the islands on that path:
pt_br: Aqui está um corte das ilhas por este caminho:

source: /***\ /*\ &lt;-- 2 meters above the see level /***********\ /*******\ &lt;-- 1 meter above the see level *************************** &lt;-- see level | | | | | | | | | | | | | | 0 0 1 1 2 2 1 1 0 1 2 1 1 0 &lt;-- altitude on each point
pt_br: /***\ /*\ &lt;-- 2 metros acima do nível do mar /***********\ /*******\ &lt;-- 1 metro acima do nível do mar *************************** &lt;-- nível do mar | | | | | | | | | | | | | | 0 0 1 1 2 2 1 1 0 1 2 1 1 0 &lt;-- altitude em cada ponto

source: This example is constituted of four levels of island:
pt_br: Este exemplo é constituído de quatro níveis de ilhas:

source: 1 1 2 2 1 1 (the island on the left)
pt_br: 1 1 2 2 1 1 (a ilha da esquerda)

source: 2 2 (the mountain topping the left island)
pt_br: 2 2 (o topo da montanha da ilha da esquerda)

source: 1 2 1 1 (the right island)
pt_br: 1 2 1 1 (a ilha da direita)

source: 2 (the mountain on the right)
pt_br: 2 (a montanha da direita)

source: This can also be visualized this way:
pt_br: Isto também pode ser visualizado desta forma:

source: Could you write a little program to compute the amount of levels in a given sequence of altitudes? Actually, there is an iterative and a recursive solution to that problem.
pt_br: Você poderia escrever um pequeno programa que calculasse a quantidade de níveis numa dada sequência de altitudes? Na verdade, existem uma solução iterativa e uma recursiva para este problema.

source: We will now write our own methods. It somehow comes down to extending the buggle vocabulary by teaching it new tricks.
pt_br: Nós vamos agora escrever nossos próprios métodos. Isto é como extender o vocabulário do buggle ensinando novos truques.

source: For example, we saw in a previous exercise how to ask the buggle to go get the baggle in front of it, and bring it back. If there is several baggles on the board, and if we want to bring all of them on the bottom line, you have to repeat this code several times, or include it in a loop. In any case, you should avoid to duplicate your code to keep it pleasant to read and easily understandable. It would be better if the buggle could obey an <code>goAndGet()</code> order just like it understands a <code>[!c]stepForward()[/!][!scala|java|python]forward()[/!]</code> one.
pt_br: Por exemplo, nós vimos num exercício anterior como pedir ao buggle para pegar o baggle na frente dele, e trazê-lo de volta. Se existem vários baggles no tabuleiro, e se nós queremos trazê-los todos para a linha de baixo, você tem que repetir este código várias vezes, ou incluir ele num loop. Em qualquer caso, você deve evitar duplicar seu código para mantê-lo agradável de ler e fácil de entender. Será melhor se o buggle puder obedecer uma ordem <code>vaiEPega()</code> assim como entende uma <code>[!c]avançarUmPasso()[/!][!scala|java|python]avançar()[/!]</code>.

source: Defining methods
pt_br: Definindo métodos

source: The [!thelang] syntax to write a simple method called <code>goAndGet</code> is the following:
pt_br: A sintaxe de [!thelang] para escrever um método simples chamado <code>vaiEPega</code> é a seguinte:

source: [!java|c]void goAndGet() {[/!][!python]def goAndGet():[/!][!scala]def goAndGet() {[/!] actions()[!java|c];[/!] to()[!java|c];[/!] do()[!java|c];[/!] [!java|scala|c]}[/!]
pt_br: [!java|c]void vaiEPega() {[/!][!python]def vaiEPega():[/!][!scala]def vaiEPega() {[/!] ações()[!java|c];[/!] ações()[!java|c];[/!] eMaisAções()[!java|c];[/!] [!java|scala|c]}[/!]

source: The method body [!java|scala|c](between curly braces)[/!][!python](the indented block)[/!] will be executed when we call the method later on (that is, when we write <code>goAndGet()</code> somewhere in our code). This method body can contain as many instructions as you want, and any construction we saw so far (for, while, if, etc). [!java|c]The <code>void</code> keyword means that this method does not return any result. For example, the <code>isOverBaggle()</code> method does return a result, which is a [!c]int[/!][!java]boolean[/!] indicating whether or not the buggle is located over a baggle. We will soon learn to define such methods too. For now, just write <code>void</code> at this location.[/!]
pt_br: O corpo do método [!java|scala](entre chaves)[/!][!python](o bloco indentado)[/!] será executado quando nós chamarmos o método mais tarde (ou seja, quando nós escrevermos <code>vaiEPega()</code> em algum lugar do código). Este corpo do método pode conter tantas instruções quanto você queira, e qualquer construção que nós queiramos (for, while, if, etc). [!java]A palavra-chave <code>void</code> significa que este método não retorna qualquer resultado. Por exemplo, o método <code>estáSobreBaggle()</code> retorna um resultado, que é um booleano indicando se o buggle está ou não localizado sobre um baggle. Vamos em breve aprender a definir tais métodos também. Por agora, apenas escreva <code>void</code> neste local.[/!]

source: Documenting methods
pt_br: Documentando métodos

source: You should strive to document your code to keep it readable. When you write it, its purpose and limitations are clear to you, but most of the time, this does not last for long. You will soon forget about the details of every specific method, and this day you will be happy to read its documentation. In the following example, we use the specific formalism of [!java]javadoc[/!][!scala]scaladoc[/!][!python]pydoc[/!], a program that extracts the documentation of [!thelang] source code to produce html pages. The main advantage is that it allows to keep the documentation near to the code. So, when you change your code, you have less chances to forget to update the documentation.
pt_br: Você deve se esforçar para documentar seu código para mantê-lo legível. Quando você escreve código, fica claro o objetivo e as limitações, mas na maioria das vezes, isto é esquecido. Você rapidamente esquecerá dos detalhes de cada método específico, e vai chegar o dia em que você ficará feliz em ler a documentação. No exemplo seguinte, nós usamos o formalismo específico de [!java]javadoc[/!][!scala]scaladoc[/!][!python]pydoc[/!], um programa que extrai a documentação do código-fonte de [!thelang] e produz páginas html. A principal vantagem é que ele permite que a documentação fique junto ao código. Então, quando você mudar o código, você tem menos chances de esquecer de atualizar a documentação.

source: [!java|scala][!java]javadoc[/!][!scala]scaladoc[/!] comments begin with the <code>/**</code> marker (with two asterisks). They must be placed right before the method they document for the tool to find them.[/!] [!python]pydoc comments should be placed at the beginning of the method body so that the tool finds them. They should be placed between <code>"""</code>, which mark multi-line strings in python.[/!] The first line should be a brief description of what this method does while any subsequent lines should provide any important details about the method.
pt_br: comentários em [!java|scala][!java]javadoc[/!][!scala]scaladoc[/!] começam com a marca <code>/**</code> (com dois asteriscos). Eles devem ser colocados exatamente antes do método que documentam para a ferramenta encontrá-los.[/!] [!python]comentários pydoc devem ser colocados no começo do corpo do método de forma que a ferramenta possa encontrá-los. Eles devem ser colocados entre <code>"""</code>, que marcam strings multilinhas em python.[/!] A primeira linha deve ser uma breve descrição do que o método faz enquanto que as linhas subsequentes devem fornecer qualquer detalhes importantes sobre o método.

source: [!java|scala]/** * Go, retrieves the baggle in front of the buggle, and brings it back * * Does not check for walls, so be careful to not call it when walls are present. */[/!] [!java]void goAndGet() {[/!] [!scala]def goAndGet() {[/!] [!python]def goAndGet(): """Go, retrieves the baggle in front of the buggle, and brings it back. Does not check for walls, so be careful to not call it when walls are present."""[/!] actions()[!java];[/!] to()[!java];[/!] do()[!java];[/!] [!java|scala]}[/!]
pt_br: [!java|scala]/** * Vai, recupera o baggle na frente do buggle, e trás de volta * * Não verifica se tem paredes, então cuidado para não chamar ele * quando uma parede estiver presente. */[/!] [!java]void vaiEPega() {[/!] [!scala]def vaiEPega() {[/!] [!python]def vaiEPega(): """Vai, recupera o baggle na frente do buggle, e trás de volta. Não verifica se tem paredes, então cuidado para não chamar ele quando uma parede estiver presente."""[/!] ações()[!java];[/!] to()[!java];[/!] do()[!java];[/!] [!java|scala]}[/!]

source: Naming conventions
pt_br: Convenções de nomes

source: Most programming language forbid the use of spaces in method and variable identifiers (=their names). Accented letters are sometimes allowed (as in [!thelang]), but they can lead to portability issues between operating systems and should thus be avoided when possible.
pt_br: A maioria das linguagens de programação proíbe o uso de espaços em indentificadores de métodos e variáveis (=seus nomes). Letras acentuadas são algumas vezes permitidas (como em [!thelang]), mas elas geram problemas de portabilidade entre sistemas operacionais e devem ser evitadas sempre que possível.

source: Across all programming languages, there is two main conventions to name variables and methods. The first one, consists in concatenating all words with only the first letter of each word in upper case. "go and get" becomes goAndGet(). It is called CamelCase because identifiers written this way graphically remind of a camel back. The other convention, called snake_case, is to write every words in lower case, separated with underscores symbols (_). "go and get" becomes go_and_get().
pt_br: Entre todas as linguagens de programação, existem duas convenções para nomear variáveis e métodos. A primeira, consiste em concatenar todas as palavras com apenas a primeria letra de cada palavra em maiúscula. "vai e Pega" se torna vaiEPega(). Isto é chamado "CamelCase" por que identificadores escritos desta forma parecem graficamente com as costas de um camelo. A outra convenção, chamada "snake_case", é escrever todas as palavras em minúsculas, separadas com sublinhados (_). "vai e pega" se torna vai_e_pega().

source: Which convention to use is the topic of heated discussion across developers, but each programming language has its own habits. In Python, Perl and the C language, the snake_case is often used for methods and variables. Java and Scala prefer the lowerCamelCase (the very first letter is lower case) for that.
pt_br: Que convenção usar é o tópico de discussões acaloradas entre desenvolvedores, mas cada linguagem de programação tem seus próprios hábitos. Em Python, Perl e C, o snake_case é normalmente usado para métodos e variáveis. Java e Scala preferemo lowerCamelCase (só a primeira letra inicial é minúscula) para isto.
