Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: You once again have to let the buggle traverse the world numbering the cells on its way, but the goal of this exercise is to write a line traversal. Most of the code you wrote for previous exercise remains usable here. Simply, the method computing the coordinates of the next buggle position has to be correctly updated: if you are at the right of a line, you have to go to the beginning of the next one. If not, you have to go to the right cell.
pt_br: Mais uma vez você terá que deixar o buggle percorrer o mundo numerando as células no caminho, mas o objetivo do exercício é escrever uma linha transversal. A maioria do código que você escreveu para exercícios anteriores continua útil aqui. Simplesmente, o método calculando as coordenadas da próxima posição do buggle tem que ser atualizado corretamente: se você estiver a direita de uma linha, você terá que ir para o começo da próxima. Senão, você terá que ir para a célula da direita.

source: This time, you are asked to traverse the world one diagonal after the other. Have a look at the objective world for more details on the requested traversal order.
pt_br: Agora é para você atravessar o mundo uma diagonal depois da outra. Dê uma olhada no mundo objetivo para maiores detalhes quanto à ordem a percorrer pedida.

source: You may find useful to use an integer variable <code>diag</code> storing the number of the diagonal you are traversing.
pt_br: Pode ser útil usar uma variável inteira <code>diag</code> guardando o número da diagonal que você está atravessando.

source: This time, you have to zigzag on the way up. Have a look at the objective world for more details on the requested traversal order.
pt_br: Desta vez, você vai ter que fazer um zigzag no caminho para cima. Dê uma olhada no mundo objetivo para mais detalhes da ordem a percorrer pedida.

source: Lost in the Moria
pt_br: Perdido em Moria

source: You buggles got stuck in the mines of Moria! Some rocks are blocking the exit, and you will have to clear your way to the exit. Well of course these are only baggles and you could simply walk away, but it will be easier to program the buggles so that they move those "rocks" than convincing them to walk away without solving the problem. Dwarfs are sometimes really stubborns...
pt_br: Seus buggles ficaram presos nas minas de Moria! Algumas pedras estão bloqueando a saída, e você terá que limpar seu caminho para a saída. Bem, é claro que são apenas baggles e você pode simplesmente sair andando, mas será mais fácil programar seu buggle de forma que ele mova estas "pedras" do que convencer seu buggle que ele pode sair andando facilmente sem resolver o problema. Anões podem ser bem teimosos...

source: So, you have to find the first baggle blocking the exit (simply walk to the east until you are over a baggle), take it and move it back to the other side of the tunnel (walk to the west while you are not over a baggle, and then move back one step to the east and drop your baggle), and iterate until you find the exit (that is, the wall to the east side). Afterward, move out as in the objective world. That's only a few more steps away.
pt_br: Bem, você tem que encontrar o primeiro baggle bloqueando a saída (simplemente ande para o leste até que você esteja sobre um baggle), pegue ele e mova para o outro lado do túnel (ande para o oeste enquanto você ainda não estiver sobre um baggle, e então mova-se de volta um passo para o leste e solte seu baggle), e repita até você encontrar a saída (ou seja, a parede com o muro para o lado leste). Depois disto, mova-se para fora como no mundo objetivo. São só mais uns passos.

source: To make things worse, you have to write a program that works for every buggle, even if writing a specific program for each of them would be easier. It seems that using <code>while</code> loops is the only solution to move the buggles correctly.
pt_br: Para piorar ainda mais as coisas, você tem que escrever um programa que funcione para qualquer buggle, mesmo se escrever um programa específico para cada um deles for mais fácil. Parece que usar loops <code>while</code> é a única solução para mover os buggles corretamente.

source: The turmites
pt_br: Os turmites

source: This set of activities lets you play with Langton's ants, that are 2D turing machines. They constitute very simple application problems, achievable by beginners, and open the door to an amazing world.
pt_br: Este conjunto de atividades é para você brincar com formigas de Langton, que são máquinas de Turing 2D. Elas constituem problemas bem simples, bons para iniciantes, e abrem as portas para um mundo fantástico.

source: This mechanism were invented in 1986 by Chris Langton, and later generalized in several ways (as we shall see in the next exercises). It was proven that Turmites and Turing machines are of equal power: An ant's trajectory can be used to compute any boolean circuit, and thus that an ant is capable of universal computation. Put simply, any possible computation can be achieved using a turmite as a computing device. Yet another subject of fascination...
pt_br: Este mecanismo foi inventado em 1986 por Chris Langton, e depois generalizado em várias formas (como veremos nos próximos exercícios). Foi provado que Turmites e máquinas de Turing têm o mesmo poder: Uma trajetória de formiga pode ser usada para calcular qualquer circuito booleano, e logo uma formiga é capaz de qualquer cálculo universal. resumindo, qualquer cálculo possível pode ser alcançado usando uma turmite como dispositivo computacional. Ainda outro assunto fascinante...

source: Multicolor Langton's ants were discovered in 1995 by Propp et Al. Another funny fact is that the ants which name is a list of consecutive pair of identical letters (LL and RR) produce symmetric patterns. This fact was even formally proved.
pt_br: formigas de Langton multicoloridas foram descobertas em 1995 por Propp et Al. Outro fato divertido é que as formigas cujos nomes é uma lista de pares consecutivos de letras idênticas (LL e RR) produzem padrões simétricos. Este fato foi até mesmo provado formalmente.

source: Check the corresponding wikipedia web page, of which this exercise is inspired, for further details.
pt_br: Verifique a página da wikipédia correspondente, na qual este exercício é inspirado, para maiores detalhes.

source: What can I do to improve this PLM universe?
pt_br: O que eu posso fazer para melhorar este universo do PLM?

source: As usual, there are several things that could be done in the code of this universe to improve it:
pt_br: Como sempre, existem várias coisas que podem ser feitas no código deste universo para melhorá-lo:

source: We are probably missing some good exercises. The turmite creator exercise is a bit harsh: we could introduce the patterns in a more friendly manner.
pt_br: Alguns bons exercícios estão provavelmente faltando. O exercício de criador de turmite é um pouco pé-duro: podemos introduzir os padrões de uma forma mais amigável.

source: We may want to write an exercise on the busy beaver, maybe?
pt_br: Quem sabe não escrevemos um exercício sobre os "busy beavers"?

source: Discover the Langton's ants, that are 2D turing machines.
pt_br: Descubra as formigas de Langton, que são máquinas de Turing 2D.

source: These activities are very simple application problems, achievable by beginners, and open the door to an amazing world.
pt_br: Estas atividades são problemas bem simples, bons para iniciantes, e abrema a porta para um mundo fantástico.

source: Langton's ant
pt_br: formiga de Langton

source: In this exercise, you will turn your buggle into a <i>Langton's ant</i>. These artificial little animals are very interesting because they are given simple rules that depend only on their local environment, and after a period of apparent chaotic behavior, a general pattern <i>emerges</i>.
pt_br: Neste exercício, você vai transformar seu buggle numa <i>formiga de Langton</i>. Estes pequenos animais artificiais são bastante interessantes por que eles recebem regras simples que dependem apenas do seu ambiente local, e depois de um período de aparente comportamento caótico, um padrão geral <i>surge</i>.

source: The rules are absolutely trivial: to compute what the next step should be, you should check the current color of the ground (using <code>getGroundColor()</code>). If it's white, change it to black, turn right and move forward by one cell. If the ground is currently black, change it to white, turn left and move forward by one cell.
pt_br: As regras são absolutamente triviais: para calcular qual o próximo passo, você verifica a cor atual do chão (usando <code>getGroundColor()</code>). Se for branco, mude para preto, vire à direita e mova uma célula. Se for preto mude para branco, vire a esquerda e ande uma célula.

source: It's hard to come up with simpler rules isn't it? Well, let's go and code it now. You have to complete the <code>step()</code> method, which encodes the behavior of the ant at each step. You will probably use the <code>getGroundColor()</code> method to retrieve the color of the cell on which the ant is currently. Colors of interest are simply named <code>Color.black</code> and <code>Color.white</code>.
pt_br: Difícil encontrar regras mais simples, não é? Bem, vamos em frente codificar isto agora. Você precisa completar o método <code>step()</code>, que codifica o comportamento da formiga em cada passo. Você vai provavelmente usar o método <code>getCorDoChão()</code> para recuperar a cor da célula na qual a formiga está no momento. Cores úteis são nomeadas simplesmente de <code>Cor.preto</code> e <code>Cor.branco</code>.

source: To compare colors, you cannot use the equal signs (==), because these things are not scalar values but objects. Instead, you need to write something like the following:
pt_br: Para comparar cores, você não pode usar o símbolo de igualdade (==), pois estas coisas não são valores escalares, mas objetos. Ao invés disto, você precisa escrever algo como o seguinte:

source: Color c /* = some initialization */; if (c.equals(Color.black)) { /* that's equal */ } else { /* that was not equal */ }
pt_br: Cor c /* = alguma inicialização */; if (c.equals(Cor.preto)) { /* é igual */ } else { /* não é igual */ }

source: Changing the ground color is not difficult, but a bit long: you have to change the brush color of your buggle, set the brush down (to mark the current cell -- with <code>brushDown()</code>), and set the brush back up (with <code>brushUp()</code>) to avoid further issues when the buggle will move. You are naturally free of organizing your code the way you want, but you may want to write a <code>setGroundColor(color)</code> method to factorize things a bit.
pt_br: mudar a cor do chão não é difícil, mas meio demorado: você tem que mudar a cor do pincel de seu buggle, baixar o pincel (para marcar a célula atual -- com <code>abaixarPincel()</code>), e levantar o pincel de novo (com <code>levantarPincel()</code>) para evitar problemas quando o buggle se mexer. Você é, naturalmente, livre para organizar seu código da forma que quiser, mas você deve querer escrever um método <code>setCorDoChão(color)</code> para separar um pouco as coisas.

source: As you can see from the execution of this exercise, the interest in this algorithm is that after about 10000 steps of relative chaotic behavior, the ant start building a regular pattern. This emergence of a regular pattern from the chaos is rather fascinating, isn't it? Move on to the next exercise to see more of them.
pt_br: Como você pode ver da execução deste exercício, o interessante neste algoritmo é que depois de uns 10000 passos de comportamento relativamente caótico, a formiga começa a construir um padrão regular. O surgimento deste padrão regular em meio ao caos é bastante fascinante, não acha? Mova para o próximo exercício para ver mais disto.

source: Multicolor Langton's ant
pt_br: formiga de Langton multicolorida

source: There is several ways to extend the concept of Langton's ant. In this exercise, we explore first one, using more than two colors. It remains very similar to the base case: the behavior at each step still depends on the ground color, but you have more than 2 possibilities. It allows to have more than one kind of ant, depending on what you decide to do for each color. For example, the ant LRL takes 3 colors. It turns left on the first color, right on the second one and left on the third color. According to this definition, the basic ant is a RL (since it turns right on white cells and left on black ones).
pt_br: Existem várias formas de extender o conceito de formiga de Langton. Neste exercício, vamos explorar a primeira, usando mais que duas cores. Ela se mantem muito similar ao caso base: o comportamento em cada passo ainda depende da cor do chão, mas você tem mais que duas possibilidades. Você pode ter mais que um tipo de formiga, dependendo do que você decide fazer para cada cor. Por exemplo, a formiga LRL recebe 3 cores. Ela vira a esquerda na primiera cor, a direita na segunda e a esquerda na terceira. De acordo com esta definição, a formiga básica é uma RL (já que ela vira a direita em células brancas e a esquerda em pretas).

source: Some of these ants draw fascinating patterns (switch the world to see them): LLRR build a symmetric figure resembling loosely to a ball, LRRRRRLLR draws a square, LLRRRLRLRLLR draws a convoluted regular pattern after a period of seemingly chaotic behavior, and RRLLLRLLLRRR seems to fill a hour glass...
pt_br: Algumas destas formigas desenham padrões fascinantes (alterne o mundo para vê-los): LLRR constrói uma figura simétrica semelhante a uma bola, LRRRRRLLR desenha um quadrado, LLRRRLRLRLLR desenha um padrão regular convolucionado depois de um período de aparente caos, e RRLLLRLLLRRR parece preencher uma ampulheta...

source: Changing your buggle into a generic Langton's ant is not very complicated, although it is not completely trivial. As previously, you have to write a <code>step</code> function. But this time, it receives two arrays as parameters. The first one defines the rules to follow depending on the ground color while the second one gives the sequence of colors to use. For example, the basic ant would have [!java]<code>{'R', 'L'}</code> and <code>{Color.white, Color.black}</code>[/!] [!python]<code>['R', 'L']</code> and <code>[Color.white, Color.black]</code>[/!] [!scala]<code>Array('R', 'L')</code> and <code>Array(Color.white, Color.black)</code>[/!] as arguments.
pt_br: Transformar seu buggle numa formiga de Langton genérica não é muito complicado, embora não seja totalmente trivial. Como anteriormente, você tem que escrever uma função <code>step</code>. Mas desta vez, ela recebe duas arrays como parâmetros. A primeira define as regras para seguir dependendo da cor do chão enquanto a segunda dá a sequência de cores a usar. Por exemplo, a formiga básica deve ter [!java]<code>{'R', 'L'}</code> e <code>{Cor.branco, Cor.preto}</code>[/!] [!python]<code>['R', 'L']</code> e <code>[Cor.branco, Cor.preto]</code>[/!] [!scala]<code>Array('R', 'L')</code> e <code>Array(Cor.branco, Cor.preto)</code>[/!] como argumentos.

source: At each step, you thus have to apply the following pseudo-code:
pt_br: Em cada passo, você deve então ter que aplicar o seguinte pseudo-código:

source: Find the position of the ground color in the color sequence;
pt_br: Encontre a posição da cor do chão na sequência de cores;

source: Turn left or right depending on the content of the rule array at that position;
pt_br: Vire a esquerda ou direita dependendo do conteúdo da array de regras nesta posição;

source: Mark the current ground with the next color in the sequence (the last color being followed by the first one);
pt_br: Marque o chão com a próxima cor na sequência (a cor seguinte à última é a primeira);

source: Move forward by one step.
pt_br: ande um passo para frente.

source: You now should have enough information to succeed.
pt_br: Você agora tem informação o suficiente para conseguir.

source: This exercise explores a new way to extend the concept of Langton's ant. Now, the behavior of the ant not only depends on the color on the ground, but also on its internal state (represented by an integer value). The idea of changing the ant into such an automata naturally comes from the Turing machine concept. This explains the name of these new animals, which is a portemanteau of <i>Turing</i> and <i>Termite</i> (if you don't know what a Turing machine is, you should run to wikipedia, because it is simply impossible to be a real computer scientist before that).
pt_br: Este exercício explora uma nova forma de extender o conceito de formiga de Langton. Agora, o comportamento da formiga não depende apenas da cor no chão, mas também de seu estado interno (representado por um valor inteiro). A ideia de transformar a formiga em um autômato vem naturalmente do conceito de máquina de Turing. Isto explica o nome destes novos animais, que é um amálgama de <i>Turing</i> e <i>Termite</i> (se você não sabe o que uma máquina de Turing é, vá na wikipédia, por que é impossível ser um cientista da computação de verdade sem conhecê-la).

source: Once again, you just have to write the <code>step()</code> method, in charge of doing one turmite's step. Once again, you should first find the rank of the current's cell ground color in the color sequence. But this time, the <code>rule</code> data depends both on the current color and the current state. <code>rule</code> actually contains 3 information in each situation: the color to write, the move to do, and the next state value. For example, [!java|python]rule[1][0][/!][!scala]rule(1)(0)[/!] contains the informations to use when <code>state==1</code> and <code>color==0</code>. In other worlds, you can retrieve the information relative to your current situation by using <code>[!java|python]rule[state][currentColor][/!][!scala]rule(state)(currentColor)[/!]</code>.
pt_br: Novamente, você tem que simplesmente escrever o método <code>step()</code>, encarregado de fazer o turmite dar um passo. Novamente, você deve primeiro encontrar o rank da cor do chão da célula atual na sequência de cores. Mas agora, os dados de <code>rule</code> (regras) dependem tanto da cor atual quanto do estado atual. A <code>rule</code> na verdade contém 3 informações em cada situação: a cor que a escreve, o movimento a fazer e o valor do próximo estado. Por exemplo, [!java|python]rule[1][0][/!][!scala]rule(1)(0)[/!] contém as informações para usar quando <code>state==1</code> e <code>color==0</code>. Em outros mundos, você pode recuperar a informação relativa à sua situação atual usando <code>[!java|python]rule[state][currentColor][/!][!scala]rule(state)(currentColor)[/!]</code>.

source: Each such information set contains 3 values. The first one is the rank of the color to write on the ground. The second is the move to do, with the following notation: 0=stop, 1=noturn, 2=left, 4=u-turn, 8=right. Note that if the command is stop, you shouldn't even move forward on that step (but you shouldn't stop your program either: the next steps can do something else in a future state). Finally, the third integer is the next <code>state</code> value to go into after this iteration.
pt_br: Cada um destes conjuntos de informações contém 3 valores. O primeiro é o rank da cor para escrever no chão. O segundo é o movimento para fazer, com a seguinte notação: 0=stop, 1=noturn, 2=left, 4=u-turn, 8=right. Observe que se o comando é stop, você não pode se mover nem para a frente neste passo (mas você não pode parar o programa também: os próximos passos podem fazer algo mais num estado futuro). Finalmente, o terceiro inteiro é o próximo valor do <code>state</code> a ir dentro da próxima iteração.

source: Since these arbitrary notations are somehow difficult to remember, you should define a set of constants that you should use instead of the direct numerical values. Their names could be NOTURN, LEFT, RIGHT and so on. [!scala]Just declare them using the keyword <code>val</code> instead of <code>var</code>. You should always use <code>val</code> instead of <code>var</code> when possible anyway.[/!] [!java]The modifiers <code>final static</code> before their type is the way to mark variables as constant in Java. You should write for example <code>static final int NOTURN=1;</code> Sorry for the complexity of this notation. [/!] [!python]By convention, such constant variables are written in upper case in python. Technically, you can still modify them, but that would be a very bad idea.[/!] You should write them out of any method so that they are globally visible.
pt_br: Uma vez que estas notações arbitrárias são de certa forma difíceis de lembrar, você deve definir um conjunto de constantes que você deve usar no lugar dos valores numéricos diretos. Seus nomes podem ser NOTURN, LEFT, RIGHT etc. [!scala]Simplesmente declare elas usando keyword <code>val</code> no lugar de <code>var</code>. Você deve sempre usar <code>val</code> no lugar de <code>var</code> quando possível de qualquer forma.[/!] [!java]Os modificadores <code>final static</code> antes do seu tipo é a forma de marcar variáveis como constantes em Java. Você deve escrever, por exemplo, <code>static final int NOTURN=1;</code> Desculpe pela complesxidade desta notação. [/!] [!python]Por convenção, tais variáveis constantes são escritas em maiúsculas no python. Tecnicamente, você ainda pode modificá-las, mas isto é uma má ideia.[/!] Você deve escrevê-las fora de qualquer método para que elas se tornem visíveis globalmente.

source: Using such constants greatly help making the code easier to read. Compare the next two code chunks:
pt_br: Usar tais constantes ajuda em muito a fazer o código mais legível. Compare os dois blocos de código a seguir:

source: This is much more easier to read (although longer) than the following:
pt_br: Isto é muito mais fácil de se ler (embora seja mais longo) do que o seguinte:

source: Finally, you probably want to write a <code>elif</code> branch for the <code>STOP</code> condition too. Having a <code>else</code> branch displaying an error message such as "unknown case" is a good practice: it makes your assumptions about your code more explicit, and you will get an error message if they fall short. When doing so, the next problem is that you have nothing to do in the <code>STOP</code> case, but python do not allows you to write empty <code>elif</code> branches. You should use the <code>pass</code> instruction as a placeholder: it says python that you have a branch here, and that it does not contain anything.
pt_br: Finalmente, você provavelmente vai querer escrever um ramo <code>elif</code> para a condição <code>STOP</code> também. Ter um ramo <code>else</code> mostrando uma mensagem de erro tal como "unknown case" é uma boa prática: faz as suas suposições sobre seu código mais explícitas, e você tem uma mensagem de erro se elas falharem. Quando fizer isto, o próximo problema vai ser que você não tem nada para fazer no caso do <code>STOP</code>, mas python não permite que você escreva ramos <code>elif</code> vazios. Você deve usar a instrução <code>pass</code> como substituto: ela diz ao python que você tem um ramo aqui, e que ele não faz nada.

source: You should probably use a [!java]switch case[/!][!scala]pattern matching[/!] construct to keep your code readable. If you can't remember what it is, check <a href="plm://lessons.welcome/bdr.BDR2">this exercise</a>.
pt_br: Provavelmente você deve usar uma construção [!java]switch case[/!][!scala]pattern matching[/!] para manter seu código legível. Se você não lembra o que é isto, veja <a href="plm://lessons.welcome/bdr.BDR2">este exercício</a>.

source: Bibliographical notes
pt_br: Notas bibliográficas
