Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: Interestingly enough, determining the best gap sequence for shell sort turns into a research issue of our century in computer science. For example, an article of 2001 introduces the following sequence, which seems to be optimal in practice for arrays of size up to 10^5: {1, 4, 10, 23, 57, 132, 301, 701, 1750} (Marcin Ciura, Best Increments for the Average Case of Shellsort, 13th International Symposium on Fundamentals of Computation Theory, LNCS 2001; Vol. 2138).
pt_br: Um fato interessante: Determinar a melhor sequência de intervalos para o shell sort se tornou um tema de pesquisa de nosso século em ciência da computação. Por exemplo, um artigo de 2001 introduz a seguinte sequência, que parece ser a melhor na prática para arrays de tamanho até 10^5: {1, 4, 10, 23, 57, 132, 301, 701, 1750} (Marcin Ciura, Best Increments for the Average Case of Shellsort, 13th International Symposium on Fundamentals of Computation Theory, LNCS 2001; Vol. 2138).

source: In this exercise we will implement another classical algorithm: selection sort.
pt_br: Neste exercício vamos implementar outro algoritmo clássico: selection sort.

source: The idea is simply to select for each cell of the array the smallest value from the part not already sorted. Thus for the first cell, it takes the smallest value over the whole array. For the second one, it takes the second smallest value, which is the smallest value from the cell not already sorted. You of course don't have to sort the last cell of the array, that is already sorted when you consider it.
pt_br: A ideia é simplesmente selecionar para cada célula da array o menor valor da parte ainda não ordenada. Então para a primeira célula, pegamos o menor valor da array toda. Para a segunda, pegamos o segundo menor valor, que é o menor valor das células ainda não ordenadas.

source: More generally, for the cell N, it looks the cell M in [N;len] containing the smallest possible value of the interval. Then, it swaps the content of cell N with the one of cell M.
pt_br: De forma mais geral, para a célula N, ele busca a célula M em [N;len] contendo o menor valor possível do intervalo. Então, alterna o conteúdo da célula N com o da célula M.

source: Existing variations
pt_br: Variações existentes

source: Another classical algorithm which idea is based on the selection of good elements is HeapSort, but it uses a heap data structure which we did not see yet. Simply remember that HeapSort provides a O(n log n) performance in worst case, which is why it is a very interesting algorithm in practice.
pt_br: Outro algoritmo clássico cuja ideia é baseada na seleção de bons elementos é o HeapSort, mas ele usa uma estrutura de dados heap que ainda não vimos. Simplesmente lembre que o HeapSort fornece um desempenho O(n log n) no pior caso, que é o motivo para ele ser bem interessante na prática.

source: We saw that CocktailSort improve a bit for turtles (i.e. small values near to the end of the array), but it is still possible to achieve better. ComboSort comes down to providing them a short cut: instead of comparing adjacent values, we compare values separated by a gap bigger than 1. That way, turtles will traverse <i>gap</i> cells at each traversal. Naturally, we have to apply the algorithm with decreasing gaps, and finish with <i>gap=1</i> to ensure that the array is correctly sorted afterward. Choosing the right gap and how to decrease it is a difficult question, but in practice, dividing it by 1.3 after each traversal leads to good performance. Here is the corresponding pseudo-code:
pt_br: Vimos que CocktailSort melhora um pouco as coisas para as tartarugas (i.e. pequenos valores próximos do fim da array), mas ainda é possível fazer melhor. ComboSort vem para fornecer a elas um atalho: ao invés de comparar valores adjacentes, comparamos valores separados por um intervalo ("gap") maior que 1. Desta forma, as tartarugas vão percorrer <i>gap</i> células em cada passagem. Naturalmente, temos que aplicar o algoritmo com distâncias decrescentes, e terminar com <i>gap=1</i> para garantir que a array está corretamente ordenada ao final. Escolher a distância correta e como diminuí-la é uma questão difícil, mas na prática, dividir por 1.3 depois de cada passagem leva a uma boa performance. Aqui está o pseudo-código correspondente:

source: One tricky part is that we want to divide gap, that is an integer (of type Int), by 1.3, that is a Double. The type system of scala won't let us do this, because such discrepancy usually denotes a programmer error. As this is not an error this time, we have to convert gap to Double for the time of the operation, and then convert the result back to Int to store it into gap. This should be written this way:
pt_br: Um detalhe perigoso é que temos que dividir o intervalo, que é um inteiro (ou do tipo Int), por 1.3, que é um Double. O sistema de tipos do scala não nos deixa fazer isto, por que tal discrepância normalmente significa um erro de programação. Como isto não é um erro neste caso, vamos ter que converter o intervalo para Double para o momento da operação, e então converter o resultado de volta para Int para armazená-lo no intervalo. Isto deve ser escrito desta forma:

source: This is rather verbose, but actually, this notation is not very complex. And remember that the type checker is your friend. It's picky and sometimes annoying (as on this one), but it often catches weird bugs that would have been a pain to debug if not catch by the type checker. And since the Scala's authors are pragmatic, the previous expression can be simplified:
pt_br: Isto é meio exagerado, mas na verdade, esta notação não é muito complexa. E lembre que o verificador de sintaxe é seu amigo. Ele às vezes é chato e irritante (como neste caso), mas frequentemente pega bugs esquisitos que seriam trabalhosos para depurar se não fosse o verificador de sintaxe. E como os autores do Scala são pragmáticos, a expressão anterior pode ser simplificada:

source: <code>toDouble</code> and <code>toInt</code> are just shortcuts for the corresponding expressions <code>asInstanceOf[Double]</code> and <code>asInstanceOf[Int]</code>. It's not very generic, but it's very handy.
pt_br: <code>toDouble</code> e <code>toInt</code> são apenas atalhos para as expressões correspondentes <code>asInstanceOf[Double]</code> e <code>asInstanceOf[Int]</code>. Não é muito genérico, mas é bem prático.

source: This algorithm was invented by Wlodek Dobosiewicz in 1980, and later rediscovered and popularized by Stephen Lacey and Richard Box, who described it in Byte Magazine in April 1991.
pt_br: Este algoritmo foi inventanndo por Wlodek Dobosiewicz em 1980, e depois redescoberto e popularizado por Stephen Lacey e Richard Box, que o descreveram na Byte Magazine em Abril de 1991.

source: The authors of this algorithm observed that the performance is increased if we make sure that the last values of the gap are (11, 8, 6, 4, 3, 2, 1) rather than (9, 6, 4, 3, 2, 1) or (10, 7, 5, 3, 2, 1). Rework the code of CombSort to ensure just after the gap update that if it is 9 or 10, we should use 11 instead.
pt_br: Os autores deste algoritmo observaram que o desempenho é aumentado se nos certificarmos que os últimos valores do intervalo são (11, 8, 6, 4, 3, 2, 1) ao invés de (9, 6, 4, 3, 2, 1) ou (10, 7, 5, 3, 2, 1). Retrabalhar o código do CombSort para garantir apenas que depois da atualização do intervalo que se ele for 9 ou 10, devemos usar 11.

source: The Gnome sort is similar to insertion sort, but the elements are moved in position by a serie of swaps just like in bubble sort. It is named after the supposed behavior of garden gnomes when they sort flower pots. Here is a description of the algorithm by its author:
pt_br: O Gnome sort é similar ao insertion sort, mas os elementos são movidos de poisção por uma série de trocas que se parecem com o bubble sort. O nome veio do suposto comportamento que gnomos de jardim tem quando ordenam vasos de flores. Aqui está uma descrição do algoritmo por seu autor:

source: Gnome Sort is based on the technique used by the standard Dutch Garden Gnome (Du.: tuinkabouter). Here is how a garden gnome sorts a line of flower pots. Basically, he looks at the flower pot next to him and the one immediately after ; if they are in the right order he steps one pot forward, otherwise he swaps them and steps one pot backwards. Boundary conditions: if there is no previous pot, he steps forwards; if there is no pot next to him, he is done. <i>—Dick Grune</i>
pt_br: Gnome Sort é baseado na técnica usada pelo gnomo de jardim holandês padrão (em holandês: tuinkabouter). Aqui está como um gnomo de jardim ordena uma fileira de potes de flores. Basicamente, ele procura pela pote de flor próximo a ele e o anterior; se eles estão na ordem correta ele vai para a frente em direção ao próximo pote, caso contrário ele troca os potes e vai pra trás. Condições de contorno: se não existe um pote anterior, ele vai pra frente; se não existe um pote próximo, ele termina. <i>—Dick Grune</i>

source: The Dutch Flag Problem
pt_br: O problema da bandeira holandesa

source: This problem was first proposed by E.W Dijkstra in 1976 (in the chapter 14 of his book "A Discipline of Programming"). It is a very classical variation of the sorting algorithms since then. It is sometimes useful in real life, but it became famous for its pedagogical properties: its complexity is not trivial, but not complex either. It can easily be formally proven, but it's not absolutely trivial either.
pt_br: Este problema foi proposto primeiro por E.W Dijkstra em 1976 (no capítulo 14 de seu livro "A Discipline of Programming"). É uma variação clássica de algoritmos de ordenação desde então. Ele é às vezes útil em vida real, mas se tornou famosos por suas propriedades pedagógicas: sua complexidade não é trivial, mas não é muito complexo. Pode ser provados formalmente com facilidade, mas não é de forma alguma trivial.

source: A temporal view could be welcomed.
pt_br: Uma visão temporal pode ser bem-vinda.

source: Other exercises, for example with 2 colors only or with more than 3 colors, could generalize the proposed approach.
pt_br: Outros exercícios, por exemplo com 2 cores apenas ou com mais de 3 cores, podem generalizar a abordagem proposta.

source: This problem could be solved recursively.
pt_br: Este problema pode ser resolvido recursivamente.

source: This is a classical sorting problem, constituting a variation over the insertion sort.
pt_br: Este é um problema de ordenação clássico, constituindo uma variação do insertion sort.

source: Your work is to sort all the colors of the Dutch flag, and the only provided primitive is to exchange two given lines. In addition, you should not create any additional variables (but a few indices).
pt_br: Seu trabalho é ordenar todas as cores da bandeira holandesa, e a única primitiva fornecida é trocar duas linhas dadas. Adicionalmente, você não deve criar quaisquer variáveis adicionais (exceto alguns índices).

source: If you think carefully, this can be done in linear time, where you sort a line at each iteration of the loop. You may want to check again the <a href="plm://lessons.sort.basic/insertion.AlgInsertionSort">insertion sort</a>, of which the Dutch Flag sort is a variation. The main difference is that you have 3 insertion points, not only one...
pt_br: Se você pensar com carinho, isto pode ser feito em tempo linear, onde você ordena uma linha a cada iteração do loop. Você pode querer dar mais uma olhada no <a href="plm://lessons.sort.basic/insertion.AlgInsertionSort">insertion sort</a>, do qual o Dutch Flag sort é uma variação. A principal diferença é que você tem 3 pontos de inserção, e não apenas um...

source: I need an hint to start
pt_br: Preciso de uma dica para começar

source: Do a traversal over your data, saving 3 indices:
pt_br: Atravesse seus dados, guardando 3 índices:

source: <code>afterBlue</code> is initialized to 0. Make sure that every cell below <code>afterBlue</code> is filled with blue elements.
pt_br: <code>afterBlue</code> é iniciado como 0. Certifique-se de que cada célula abaixo de <code>afterBlue</code> é preenchida com elementos azuis.

source: <code>whiteRed</code> is initialized to size-1. Make sure that every cell after <code>whiteRed</code> is filled with red elements.
pt_br: <code>whiteRed</code> é iniciado como size-1. Certifique-se de que cada célula depois de <code>whiteRed</code> é preenchida com elementos vermelhos.

source: <code>beforeWhite</code> is initialized to size-1. Make sure that every cell after <code>beforeWhite</code> and before <code>whiteRed</code> is filled with white elements.
pt_br: <code>beforeWhite</code> é iniciado com size-1. Certifiqeu-se de que cada célula depois de <code>beforeWhite</code> e antes de <code>whiteRed</code> é preenchida com elementos brancos.

source: Note that the unsorted cells are always between <code>afterBlue</code> and <code>beforeWhite</code>.
pt_br: Observe que as células não-ordenadas ficam sempre entre <code>afterBlue</code> e <code>beforeWhite</code>.

source: At each step of your traversal, check the color of the cell at <code>afterBlue</code> and do the required exchanges. The loop ending condition is when <code>afterBlue</code> becomes larger than <code>beforeWhite</code>.
pt_br: Em cada passo de sua travessia, verifique a cor da célula em <code>afterBlue</code> e faça as mudanças necessárias. A condição de fim de loop é quando <code>afterBlue</code> se torna maior que <code>beforeWhite</code>.

source: Provided values
pt_br: Valores fornecidos

source: The colors are represented through the following constants: BLUE, WHITE and RED. You can use them directly in your code.
pt_br: As cores são representadas através das seguintes constantes: BLUE, WHITE e RED. Você pode usá-las diretamente em seu código.

source: Provided functions
pt_br: Funções fornecidas

source: This world is very simple, with only 5 provided functions.
pt_br: Este mundo é bem simples, com apenas 5 funções fornecidas.

source: [!java|c]void [/!]swap([!java|c]int [/!]x[!scala]:Int[/!], [!java|c]int [/!]y[!scala]:Int[/!])
pt_br: [!java|c]void [/!]alterna([!java|c]int [/!]x[!scala]:Int[/!], [!java|c]int [/!]y[!scala]:Int[/!])

source: Swap the lines number <code>x</code> and <code>y</code>.
pt_br: Troca as linhas de número <code>x</code> com a de número <code>y</code>.

source: [!java|c]int [/!]getSize() [!scala]:Int[/!]
pt_br: [!java|c]int [/!]getTamanho() [!scala]:Int[/!]

source: Returns the amount of lines on this flag.
pt_br: Retorna a quantidade de linhas desta bandeira.

source: [!java|c]int [/!]getColor([!java|c]int [/!]line[!scala]:Int[/!]) [!scala]:Int[/!]
pt_br: [!java|c]int [/!]getCor([!java|c]int [/!]linha[!scala]:Int[/!]) [!scala]:Int[/!]

source: Returns the color of the given line.
pt_br: Retorna a cor da linha dada.

source: [!java]boolean [/!][!c]int [/!]isSorted() [!scala]:Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]estáOrdenado() [!scala]:Boolean[/!]

source: Returns whether the flag is sorted.
pt_br: Retorna verdadeiro se a bandeira estiver ordenada.

source: [!java]boolean [/!][!c]int [/!]isSelected() [!scala]:Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]estáSelecionado() [!scala]:Boolean[/!]

source: Returns whether the current world is selected in the interface.
pt_br: Retorna verdadeiro se o mundo atual estiver selecionado na interface.

source: This universe is very simple, with only five functions provided.
pt_br: Este universo é bastante simples, com apenas cinco funções fornecidas.

source: [!java|c]int [/!]getStackSize() [!scala]:Int[/!]
pt_br: [!java|c]int [/!]getTamanhoDaPilha() [!scala]:Int[/!]

source: Returns the size of the stack, that is the amount of pancakes it contains.
pt_br: Retorna o tamanho da pilha, ou seja, a quantidade de panquecas nela.

source: [!java|c]int [/!]getPancakeRadius([!java|c]int [/!]rank[!scala]:Int[/!]) [!scala]:Int[/!]
pt_br: [!java|c]int [/!]getRaioPanqueca([!java|c]int [/!]rank[!scala]:Int[/!]) [!scala]:Int[/!]

source: Returns the radius of the pancake passed as argument, with the rank of the top-most pancake being 0.
pt_br: Retorna o raio da panqueca passado como argumento, com o rank da panqueca mais acima sendo 0.

source: [!java]boolean [/!][!c]int [/!]isPancakeUpsideDown([!java|c]int [/!]rank[!scala]:Int[/!]) [!scala]:Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]panquecaDeCabeçaPraBaixo([!java|c]int [/!]rank[!scala]:Int[/!]) [!scala]:Boolean[/!]

source: Returns whether the pancake passed as argument upside-down, that is, if its burned side is on top. As usual, the top-most pancake is of rank 0.
pt_br: Retorna se a panqueca passada como argumento está de cabeça para baixo, ou seja, se o lado queimado está para cima. Como sempre, a panqueca mais acima é a de rank 0.

source: Flips the <code>amount</code> first pancakes composing the stack, from the top of it.
pt_br: Vira as primeiras <code>amount</code> panquecas que compõe a pilha, do topo dela.

source: [!java]boolean [/!][!c]int [/!]isSorted() [!scala]:Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]estáOrdenado() [!scala]:Boolean[/!]

source: Returns whether the pancake stack is correctly sorted.
pt_br: Retorna verdadeiro se a pilha de panquecas estiver corretamente ordenada.

source: [!java]boolean [/!][!c]int [/!]isSelected() [!scala]:Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]selecionado() [!scala]:Boolean[/!]

source: Pancake Sorting
pt_br: Ordenação da panqueca

source: This activity is inspired by a problem first introduced in 1975 by Harry Dweighter in the American Mathematical Monthly. The question is not only to sort the pancakes, but to determine <code>f(n)</code> the <i>minimal</i> amount of flips mandated to sort any stack of size <code>n</code>.
pt_br: Esta atividade é inspirada por um problema introduzido pela primeira vez em 1975 por Harry Dweighter no American Mathematical Monthly. A pergunta não é apenas ordenar panquecas, mas determinar <code>f(n)</code> a quantidade <i>minima</i> de viradas necessárias para ordenar qualquer pilha de tamanho <code>n</code>.

source: This problem is now famous because Bill Gates authored (with C. Papadimitriou) his only scientific publication in 1979 on this topic, providing a faster algorithm and proving that <code>17n/16 ≤ f(n) ≤ (5n+5)/3</code>. This was the only publication of Bill Gates before he invented Windows and became rich.
pt_br: Este problema é agora famoso por que Bill Gates escreveu (com C. Papadimitriou) sua única publicação científica em 1979 neste tópico, fornecendo um algoritmo mais rápido e provando que <code>17n/16 ≤ f(n) ≤ (5n+5)/3</code>. Este foi a única publicação de Bill Gates antes dele inventar o Windows e ficar rico.

source: Then, David X. Cohen, the inventor of the Futurama comics with many mathematical references, introduced the variant with burnt pancakes and studied its complexity with Manuel Blum in 1993.
pt_br: Então, David X. Cohen, o inventor dos quadrinhos Futurama com muitas referências matemáticas, introduziu a variante com panquecas queimadas e estudou sua complexidade com Manuel Blum em 1993.

source: An article of 2012 (by L. Bulteau, G. Fertin and I. Rusu) proved that determining the minimal amount of flips to sort the stack is a NP-complete problem. Naturally, the stack sorting problem is not NP-complete since it can be solved in 2n-3 steps with the naive algorithm and (5n+5)/3 steps with the Gates algorithm. That's determining the minimal amount of steps that is NP.
pt_br: Um artigo de 2012 (de L. Bulteau, G. Fertin e I. Rusu) provou que determinar a quantidade mínima de viradas para ordenar a pilha é um problema NP-completo. Naturalmente, o problema de ordenar a pilha não é NP-complete pois pode ser resolvido em 2n-3 passos com o algoritmo simplório e (5n+5)/3 passos com o algoritmo de Gates. É a determinação da quantidade mínima de passos que é NP.

source: Further information can be found on the wikipedia page, as usual.
pt_br: Mais informações podem ser encontradas na página da wikipédia, como sempre.

source: This activity is also integrated to CSIRL (my repository of <i>free</i> unplugged activities to introduce computer science, available at http://www.loria.fr/~quinson/Mediation/SMN/), and it may be interesting to run the unplugged activities before implementing these algorithms in PLM.
pt_br: Esta atividade também é integrada ao CSIRL (meu repositório de atividades offline <i>livres</i> para introdução de ciência da computação, disponível em http://www.loria.fr/~quinson/Mediation/SMN/), e pode ser interessante executar as atividades offline antes de implementar estes algoritmos no PLM.

source: A temporal view similar to the sorting universe could be helpful
pt_br: Uma visão temporal similar ao universo da ordenação pode ser útil

source: Other exercises, for example on the Roti sorting, with a pile of Roti that have to touch the grill on each face (see http://en.wikipedia.org/wiki/Pancake_sorting#The_identical_pancake_stack).
pt_br: Outros exercícios, por exemplo sobre Roti sorting, com uma pilha de Roti que tem que tocar a grelha em ambos os lados (see http://en.wikipedia.org/wiki/Pancake_sorting#The_identical_pancake_stack).

source: The pancake problem
pt_br: O problema da panqueca

source: Help the poor psychorigid pancakes' chef to sort its pancake stack!
pt_br: Ajude o pobre chef das panquecas psychorigid a ordenar sua pilha de panquecas!

source: This funny problem leads to algorithms that are somewhat more challenging to implement. You are supposed to master the bases of programming and some sorting algorithms to take this lesson.
pt_br: Este problema divertido leva a algoritmos que são de certa forma mais desafiadores de implmentar. Espera-se que você domine as bases da programação e de algoritmos de ordenação para fazer esta lição.

source: The pancake sorting problem is a simple puzzle where you have a set of pancakes, each of differing size. The chef cooking the pancake is a bit psychorigid: he hates when the pancakes are not correctly sorted on the plate. He loves when they are correctly ordered, with the small ones over the larger ones. As every pancake maker, he masters the pancake flipping with his spatula. He can flip the pancake on top of the stack, or even several pancakes at once. The thing is that he has only one plate and the table is too dirty to place pancakes on it, even temporary. The only allowed operation is to flip some pancakes that are on top of the stack.
pt_br: O problema da ordenação da panqueca é um quebra-cabeças simples onde você tem um conjunto de panquecas, cada uma de tamanhos diferentes. O chef que cozinha as panquecas é um pouco psicorígido: ele odeia quando as panquecas não estão corretamente ordenadas no prato. Ele adora quando elas estão corretamente ordenadas, com as pequenas sobre as grandes. Como todo fazedor de panquecas, ele é mestre em virar a panqueca com a espátula. Ele pode virar a panqueca do topo da pilha, ou até mesmo várias panquecas de uma vez. O problema é que ele tem apenas um prato e a mesa está muito suja para colocar as panquecas nela, mesmo temporariamente. A única operação permitida é virar algumas panquecas que estão no topo da pilha.

source: Your work is to help this poor guy sorting his stack by flipping the pancakes. Each pancake is defined by its radius and rank within the stack, with the top-most pancake is at rank 0, and the one below at rank 1.
pt_br: Seu trabalho é ajudar este pobre coitado a ordenar a pilha dele virando as panquecas. Cada panqueca é definida pelo raio e rank dentro da pilha, onde a panqueca de cima está com rank 0, e a próxima com rank 1.
