Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: According to wikipedia, turmites were invented independently by the end of the eighties. It has been shown that turmites in general are exactly equivalent in power to one-dimensional Turing machines with an infinite tape, as either can simulate the other. This means that absolutely any program that you can think of could theoretically be computed on this device...
pt_br: De acordo com a wikipédia, os turmites foram inventados independentemente no final dos anos oitenta. Foi provado que turmites em geral são exatamente equivalentes em capacidade a máquinas de turing uni-dimensionais com uma fita infinita, pois um pode simular o outro. Isto significa que qualquer programa que você possa conceber pode teoricamente ser executado neste dispositivo...

source: Creating Turmites
pt_br: Criando Turmites

source: This exercise allows you to build your own turmites. To pass the exercise, you should simply write a <code>init()</code> method which initializes the <code>rule</code> to use the following transitions table (from wikipedia), set the buggle initial position at (8;33), and ask for 8342 steps.
pt_br: Este exercício permite que você construa seus próprios turmites. Para passar neste exercício, você deve simplesmente escrever um método <code>init()</code> que inicializa a <code>rule</code> para usar a seguintes tabela de transições (da wikipédia), configure a posição inicial em (8;33), e peça por 8342 passos.

source: Current color
pt_br: Cor atual

source: Write color
pt_br: Escrever cor

source: Next state
pt_br: Próximo estado

source: Current state
pt_br: Estado atual

source: where the direction to turn is one of <b>L</b> (90° left), <b>R</b> (90° right), <b>N</b> (no turn) and <b>U</b> (180° U-turn).
pt_br: Onde a direção para virar é <b>L</b> (90° à esquerda), <b>R</b> (90° à direita), <b>N</b> (não vira) e <b>U</b> (meia-volta).

source: Going further
pt_br: Indo mais além

source: This exercise is naturally an excuse to let you experiment with your own turmites. Feel free to change the transition table and the amount of steps to experiment by yourself. To that extend, you may find the Ed Pegg Jr's library useful. If you find new interesting patterns, send them per email so that we can integrate them to this list!
pt_br: Este exercício é naturalmente uma desculpa para deixar você experimentar com seus próprios turmites. Sinta-se à vontade para mudar a tabela de transições e a quantidade de passos por conta própria. Nesta altura, você pode se interessar pela biblioteca de Pegg Jr. Se você encontrar novos padrões interessantes, envie-os por email para que eles possam integrar a lista!

source: In addition, wikipedia is desperately missing some good looking colorful turmites: only black and white ones are depicted. You should consider submitting your creations directly to the free encyclopedia.
pt_br: Adicionalmente, a wikipédia está precisando desesperadamente de alguns turmites coloridos bem apresentáveis: apenas os preto e branco estão descritos. Você deveria considerar a possibilidade de enviar suas criações diretamente para a enciclopédia livre.

source: Here are some 2-color turmites, extracted from http://demonstrations.wolfram.com/Turmites/ [!python|scala]They are not written using the [!thelang] syntax, but converting them should be easy.[/!]
pt_br: Aqui estão alguns turmites de 2 cores, extraídos de http://demonstrations.wolfram.com/Turmites/ [!python|scala]Eles não foram escritos usando o sintaxe de [!thelang], mas convertê-los não deve ser difícil.[/!]

source: {{{1, RIGHT , 0}, {0, LEFT , 0}}} # 1: Langton's ant {{{1, RIGHT , 0}, {0, NOTURN, 0}}} # 2: binary counter {{{0, LEFT , 1}, {1, RIGHT , 1}}, {{1, NOTURN, 0}, {1, NOTURN, 1}}} # 3: (filled triangle) {{{0, NOTURN, 1}, {0, LEFT , 1}}, {{1, RIGHT , 0}, {0, NOTURN, 1}}} # 4: spiral in a box {{{0, RIGHT , 1}, {0, LEFT , 0}}, {{1, LEFT , 1}, {0, RIGHT , 0}}} # 5: stripe-filled spiral {{{0, RIGHT , 1}, {0, LEFT , 0}}, {{1, LEFT , 1}, {1, NOTURN, 0}}} # 6: stepped pyramid {{{0, RIGHT , 1}, {0, NOTURN, 1}}, {{1, RIGHT , 1}, {1, LEFT , 0}}} # 7: contoured island {{{0, RIGHT , 1}, {0, RIGHT , 1}}, {{1, NOTURN, 0}, {0, RIGHT , 1}}} # 8: woven placemat {{{0, RIGHT , 1}, {1, RIGHT , 1}}, {{1, LEFT , 1}, {1, LEFT , 0}}} # 9: snowflake-ish {{{1, LEFT , 0}, {0, NOTURN, 1}}, {{0, LEFT , 0}, {0, LEFT , 1}}} # 10: slow city builder {{{1, LEFT , 0}, {1, RIGHT , 1}}, {{0, RIGHT , 0}, {0, LEFT , 1}}} # 11: framed computer art {{{1, LEFT , 0}, {1, RIGHT , 1}}, {{0, RIGHT , 1}, {1, LEFT , 0}}} # 12: balloon bursting (makes a spreading highway) {{{1, LEFT , 1}, {0, LEFT , 0}}, {{1, NOTURN, 0}, {0, NOTURN, 0}}} # 13: makes a horizontal highway {{{1, LEFT , 1}, {0, LEFT , 0}}, {{1, RIGHT , 1}, {1, RIGHT , 0}}} # 14: makes a 45 degree highway {{{1, LEFT , 1}, {0, LEFT , 1}}, {{1, RIGHT , 1}, {0, LEFT , 0}}} # 15: makes a 45 degree highway {{{1, LEFT , 1}, {0, NOTURN, 0}}, {{1, NOTURN, 0}, {1, RIGHT , 0}}} # 16: spiral in a filled box {{{1, LEFT , 1}, {0, RIGHT , 0}}, {{0, LEFT , 0}, {0, LEFT , 0}}} # 17: glaciers {{{1, LEFT , 1}, {1, LEFT , 1}}, {{1, RIGHT , 1}, {0, NOTURN, 0}}} # 18: golden rectangle! {{{1, LEFT , 1}, {1, RIGHT , 0}}, {{0, LEFT , 0}, {0, LEFT , 0}}} # 19: fizzy spill {{{1, LEFT , 1}, {1, RIGHT , 1}}, {{1, NOTURN, 0}, {0, NOTURN, 1}}} # 20: nested cabinets {{{1, NOTURN, 1}, {0, LEFT , 1}}, {{1, RIGHT , 0}, {1, NOTURN, 1}}} # 21: (cross) {{{1, NOTURN, 1}, {0, NOTURN, 0}}, {{0, RIGHT , 0}, {1, LEFT , 0}}} # 22: saw-tipped growth {{{1, NOTURN, 1}, {0, NOTURN, 1}}, {{1, RIGHT , 1}, {0, NOTURN, 0}}} # 23: curves in blocks growth {{{1, NOTURN, 1}, {0, RIGHT , 0}}, {{0, LEFT , 0}, {0, LEFT , 0}}} # 24: textured growth {{{1, NOTURN, 1}, {0, RIGHT , 1}}, {{1, LEFT , 0}, {1, RIGHT , 0}}} # 25: (diamond growth) {{{1, NOTURN, 1}, {1, LEFT , 0}}, {{1, RIGHT , 1}, {0, NOTURN, 0}}} # 26: coiled rope {{{1, RIGHT , 0}, {0, LEFT , 1}}, {{1, LEFT , 0}, {0, NOTURN, 1}}} # 27: (growth) {{{1, RIGHT , 0}, {0, LEFT , 1}}, {{1, LEFT , 0}, {0, RIGHT , 1}}} # 28: (square spiral) {{{1, RIGHT , 0}, {1, RIGHT , 1}}, {{0, NOTURN, 0}, {0, NOTURN, 1}}} # 29: loopy growth with holes {{{1, RIGHT , 1}, {0, LEFT , 1}}, {{1, NOTURN, 0}, {0, NOTURN, 0}}} # 30: Lanton's Ant drawn with squares {{{1, RIGHT , 1}, {0, RIGHT , 0}}, {{0, LEFT , 1}, {1, LEFT , 0}}} # 31: growth with curves and blocks {{{1, RIGHT , 1}, {0, RIGHT , 0}}, {{0, NOTURN, 0}, {1, RIGHT , 1}}} # 32: distracted spiral builder {{{1, RIGHT , 1}, {0, RIGHT , 1}}, {{1, NOTURN, 0}, {1, NOTURN, 1}}} # 33: cauliflower stalk (45 deg highway) {{{1, RIGHT , 1}, {1, LEFT , 1}}, {{1, RIGHT , 1}, {0, RIGHT , 0}}} # 34: worm trails (eventually turns cyclic!) {{{1, RIGHT , 1}, {1, NOTURN, 0}}, {{1, NOTURN, 0}, {0, NOTURN, 1}}} # 35: eventually makes a two-way highway! {{{1, RIGHT , 1}, {1, RIGHT , 0}}, {{0, NOTURN, 0}, {0, NOTURN, 0}}} # 36: almost symmetric mould bloom {{{1, RIGHT , 1}, {1, RIGHT , 0}}, {{0, RIGHT , 0}, {1, NOTURN, 1}}} # 37: makes a 1 in 2 gradient highway {{{1, RIGHT , 1}, {1, RIGHT , 1}}, {{1, LEFT , 1}, {0, RIGHT , 0}}} # 38: immediately makes a 1 in 3 highway {{{0, RIGHT , 1}, {1, RIGHT , 1}}, {{0, LEFT , 2}, {0, LEFT , 0}}, {{1, RIGHT , 2}, {1, LEFT , 0}}} # 39: squares and diagonals growth {{{1, LEFT , 1}, {0, NOTURN, 0}}, {{0, RIGHT , 2}, {1, LEFT , 0}}, {{1, RIGHT , 1}, {1, NOTURN, 0}}} # 40: streak at approx. an 8.1 in 1 gradient {{{1, LEFT , 1}, {0, NOTURN, 2}}, {{0, RIGHT , 2}, {1, NOTURN, 1}}, {{1, RIGHT , 1}, {1, NOTURN, 0}}} # 41: streak at approx. a 1.14 in 1 gradient {{{1, LEFT , 1}, {1, LEFT , 1}}, {{1, NOTURN, 0}, {0, NOTURN, 2}}, {{0, LEFT , 1}, {1, NOTURN, 1}}} # 42: maze-like growth {{{1, LEFT , 2}, {0, RIGHT , 0}}, {{1, LEFT , 0}, {0, RIGHT , 0}}, {{0, LEFT , 0}, {0, LEFT , 1}}} # 43: growth by cornices {{{1, RIGHT , 0}, {0, RIGHT , 2}}, {{0, LEFT , 0}, {0, RIGHT , 0}}, {{0, NOTURN, 1}, {1, LEFT , 0}}} # 44: makes a 1 in 7 highway {{{1, RIGHT , 1}, {0, LEFT , 0}}, {{1, RIGHT , 2}, {0, NOTURN, 0}}, {{1, LEFT , 0}, {0, LEFT , 0}}} # 45: makes a 4 in 1 highway
pt_br: {{{1, RIGHT , 0}, {0, LEFT , 0}}} # 1: formiga de Langton {{{1, RIGHT , 0}, {0, NOTURN, 0}}} # 2: contador binário {{{0, LEFT , 1}, {1, RIGHT , 1}}, {{1, NOTURN, 0}, {1, NOTURN, 1}}} # 3: (triâgulo preenchido) {{{0, NOTURN, 1}, {0, LEFT , 1}}, {{1, RIGHT , 0}, {0, NOTURN, 1}}} # 4: espiral numa caixa {{{0, RIGHT , 1}, {0, LEFT , 0}}, {{1, LEFT , 1}, {0, RIGHT , 0}}} # 5: espiral stripe-filled {{{0, RIGHT , 1}, {0, LEFT , 0}}, {{1, LEFT , 1}, {1, NOTURN, 0}}} # 6: pirâmide inclinada {{{0, RIGHT , 1}, {0, NOTURN, 1}}, {{1, RIGHT , 1}, {1, LEFT , 0}}} # 7: ilha contoured {{{0, RIGHT , 1}, {0, RIGHT , 1}}, {{1, NOTURN, 0}, {0, RIGHT , 1}}} # 8: woven placemat {{{0, RIGHT , 1}, {1, RIGHT , 1}}, {{1, LEFT , 1}, {1, LEFT , 0}}} # 9: floco de neve {{{1, LEFT , 0}, {0, NOTURN, 1}}, {{0, LEFT , 0}, {0, LEFT , 1}}} # 10: construtor de cidades lento {{{1, LEFT , 0}, {1, RIGHT , 1}}, {{0, RIGHT , 0}, {0, LEFT , 1}}} # 11: framed computer art {{{1, LEFT , 0}, {1, RIGHT , 1}}, {{0, RIGHT , 1}, {1, LEFT , 0}}} # 12: balloon bursting (makes a spreading highway) {{{1, LEFT , 1}, {0, LEFT , 0}}, {{1, NOTURN, 0}, {0, NOTURN, 0}}} # 13: makes a horizontal highway {{{1, LEFT , 1}, {0, LEFT , 0}}, {{1, RIGHT , 1}, {1, RIGHT , 0}}} # 14: makes a 45 degree highway {{{1, LEFT , 1}, {0, LEFT , 1}}, {{1, RIGHT , 1}, {0, LEFT , 0}}} # 15: makes a 45 degree highway {{{1, LEFT , 1}, {0, NOTURN, 0}}, {{1, NOTURN, 0}, {1, RIGHT , 0}}} # 16: spiral in a filled box {{{1, LEFT , 1}, {0, RIGHT , 0}}, {{0, LEFT , 0}, {0, LEFT , 0}}} # 17: glaciers {{{1, LEFT , 1}, {1, LEFT , 1}}, {{1, RIGHT , 1}, {0, NOTURN, 0}}} # 18: golden rectangle! {{{1, LEFT , 1}, {1, RIGHT , 0}}, {{0, LEFT , 0}, {0, LEFT , 0}}} # 19: fizzy spill {{{1, LEFT , 1}, {1, RIGHT , 1}}, {{1, NOTURN, 0}, {0, NOTURN, 1}}} # 20: nested cabinets {{{1, NOTURN, 1}, {0, LEFT , 1}}, {{1, RIGHT , 0}, {1, NOTURN, 1}}} # 21: (cross) {{{1, NOTURN, 1}, {0, NOTURN, 0}}, {{0, RIGHT , 0}, {1, LEFT , 0}}} # 22: saw-tipped growth {{{1, NOTURN, 1}, {0, NOTURN, 1}}, {{1, RIGHT , 1}, {0, NOTURN, 0}}} # 23: curves in blocks growth {{{1, NOTURN, 1}, {0, RIGHT , 0}}, {{0, LEFT , 0}, {0, LEFT , 0}}} # 24: textured growth {{{1, NOTURN, 1}, {0, RIGHT , 1}}, {{1, LEFT , 0}, {1, RIGHT , 0}}} # 25: (diamond growth) {{{1, NOTURN, 1}, {1, LEFT , 0}}, {{1, RIGHT , 1}, {0, NOTURN, 0}}} # 26: coiled rope {{{1, RIGHT , 0}, {0, LEFT , 1}}, {{1, LEFT , 0}, {0, NOTURN, 1}}} # 27: (growth) {{{1, RIGHT , 0}, {0, LEFT , 1}}, {{1, LEFT , 0}, {0, RIGHT , 1}}} # 28: (square spiral) {{{1, RIGHT , 0}, {1, RIGHT , 1}}, {{0, NOTURN, 0}, {0, NOTURN, 1}}} # 29: loopy growth with holes {{{1, RIGHT , 1}, {0, LEFT , 1}}, {{1, NOTURN, 0}, {0, NOTURN, 0}}} # 30: Lanton's Ant drawn with squares {{{1, RIGHT , 1}, {0, RIGHT , 0}}, {{0, LEFT , 1}, {1, LEFT , 0}}} # 31: growth with curves and blocks {{{1, RIGHT , 1}, {0, RIGHT , 0}}, {{0, NOTURN, 0}, {1, RIGHT , 1}}} # 32: distracted spiral builder {{{1, RIGHT , 1}, {0, RIGHT , 1}}, {{1, NOTURN, 0}, {1, NOTURN, 1}}} # 33: cauliflower stalk (45 deg highway) {{{1, RIGHT , 1}, {1, LEFT , 1}}, {{1, RIGHT , 1}, {0, RIGHT , 0}}} # 34: worm trails (eventually turns cyclic!) {{{1, RIGHT , 1}, {1, NOTURN, 0}}, {{1, NOTURN, 0}, {0, NOTURN, 1}}} # 35: eventually makes a two-way highway! {{{1, RIGHT , 1}, {1, RIGHT , 0}}, {{0, NOTURN, 0}, {0, NOTURN, 0}}} # 36: almost symmetric mould bloom {{{1, RIGHT , 1}, {1, RIGHT , 0}}, {{0, RIGHT , 0}, {1, NOTURN, 1}}} # 37: makes a 1 in 2 gradient highway {{{1, RIGHT , 1}, {1, RIGHT , 1}}, {{1, LEFT , 1}, {0, RIGHT , 0}}} # 38: immediately makes a 1 in 3 highway {{{0, RIGHT , 1}, {1, RIGHT , 1}}, {{0, LEFT , 2}, {0, LEFT , 0}}, {{1, RIGHT , 2}, {1, LEFT , 0}}} # 39: squares and diagonals growth {{{1, LEFT , 1}, {0, NOTURN, 0}}, {{0, RIGHT , 2}, {1, LEFT , 0}}, {{1, RIGHT , 1}, {1, NOTURN, 0}}} # 40: streak at approx. an 8.1 in 1 gradient {{{1, LEFT , 1}, {0, NOTURN, 2}}, {{0, RIGHT , 2}, {1, NOTURN, 1}}, {{1, RIGHT , 1}, {1, NOTURN, 0}}} # 41: streak at approx. a 1.14 in 1 gradient {{{1, LEFT , 1}, {1, LEFT , 1}}, {{1, NOTURN, 0}, {0, NOTURN, 2}}, {{0, LEFT , 1}, {1, NOTURN, 1}}} # 42: maze-like growth {{{1, LEFT , 2}, {0, RIGHT , 0}}, {{1, LEFT , 0}, {0, RIGHT , 0}}, {{0, LEFT , 0}, {0, LEFT , 1}}} # 43: growth by cornices {{{1, RIGHT , 0}, {0, RIGHT , 2}}, {{0, LEFT , 0}, {0, RIGHT , 0}}, {{0, NOTURN, 1}, {1, LEFT , 0}}} # 44: makes a 1 in 7 highway {{{1, RIGHT , 1}, {0, LEFT , 0}}, {{1, RIGHT , 2}, {0, NOTURN, 0}}, {{1, LEFT , 0}, {0, LEFT , 0}}} # 45: makes a 4 in 1 highway

source: Langton's ants may not share the expressiveness power of the turmites, but they remain fascinating too. You can experiment with them using the initLangton() method, provided in your template, that allows to build a Turmite transition table from a Langton's ant name. Tiny changes in the ant may result huge changes. For example, "RRL" does not seem to lead to any constructed pattern, even after a million steps, but "RLL" starts building a very simple highway pattern after less than 100 steps!
pt_br: formigas de Langton podem não compartilhar do poder de expressão dos turmites, mas ainda assim são fascinantes. Você pode experimentar elas usando o método initLangton(), fornecido no seu template, que permite contruir uma tabela de transição do nome da formiga de Langton. Pequenas mudanças na formiga podem resultar em grandes mudanças. Por exemplo, "RRL" parece não levar a nenhum padrão, mesmo após um milhão de passos, mas, mas "RLL" começa a construir um padrão de estrada muito simples depois de menos de 100 passos!

source: Quite a lot of Langton's ants build highways: RL, of course, but also RLRLRLLRLR (about 2500 steps). The chaotic behavior of ants before the highway can be very short (as with RLL that only need 100 steps to converge) or very long, as with LLLLLLRRLRRR which seems chaotic for more than 500,000 steps before build the highway or even RRLLLRRRLRRR which needs 1170000 to start converging. Some are narrow, and others are very large, such as RRLRLLRLRR (200,000 steps). This ant is also notable since it is somehow squarish even before the highway start where most others do not show anything notable before their highway.
pt_br: Muitas das formigas de Langton constróem estradas: RL, claro, mas também RLRLRLLRLR (em cerca de 2500 passos). O comportamento caótico das formigas antes da estrada pode ser bastante curto (como no caso RLL que precisa de apenas 100 passos para convergir) ou muito longo, como LLLLLLRRLRRR que parece caótico até mais de 500.000 de passos antes de contruir a estrada, ou até mesmo RRLLLRRRLRRR que precisa de 1.170.000 para começar a convergir. Umas são estreitas, e outras bem largas, como em RRLRLLRLRR (200,000 passos). Esta formiga é também notável pois é meio quadrada mesmo antes da estrada começar, enquanto que as outras não exibem nada de especial antes da estrada.

source: Some ants fill solid sectors, such as RRLLLRLLLRRR (16,000 steps), RRLLLRLLLRRR (30,000 steps), RRLLLRRRRRLR (125,000 steps) or RRLRLLRRRRRR (20,000 steps). Some even fill the whole space (RRLRR after 3000 steps). Some of my personal favorite ones are the ones where the ant seem to be bouncing within a box that gets bigger on each bump, such as LRRRRRLLR (30,000 steps). LRRRRLLLRRR is even more impressing since the bounces within the box are regular and since it converges more rapidly to its stable behavior (15,000 steps are enough).
pt_br: Algumas formiga preenchem setores sólidos, como RRLLLRLLLRRR(16,000 passos), RRLLLRLLLRRR (30,000 passos), RRLLLRRRRRLR (125,000 passos) ou RRLRLLRRRRRR (20,000 passos). Algumas preenchem até mesmo todo o plano (RRLRR depois de 3000 passos). algumas das minhas favoritas são aquelas onde as formigas parecem ricochetear desntro de uma caixa que vai ficando maior em cada batida, como LRRRRRLLR (30,000 passos). LRRRRLLLRRR é ainda mais impressionante pois as ricocheteadas dantro da caixa são regulares e também por que ela converge mais rapidamente para o seu comportamento estável (15,000 passos são suficientes).

source: Finally, some ants are just build artistic patterns. You should check this video for some beautiful ones: http://www.youtube.com/watch?v=1X-gtr4pEBU. If you want to convert them into your code, you have to shift them by one: For example, the one depicted at 3:42 is not RRLRLRLLRL, but RLRLRLLRLR (the first visible move should be read as last one).
pt_br: Finalmente, algumas formigas fazem padrões simplesmente artísticos. Você pode verificar este vídeo com alguns deles: http://www.youtube.com/watch?v=1X-gtr4pEBU. Se você quiser convertê-los em código, você tem que transladar um caractere: por exemplo, aquele descrito no minuto 3:42 não será RRLRLRLLRL, mas sim RLRLRLLRLR (o primeiro movimento visível deve ser lido como o último).

source: As you can see by exploring the above set of turmites, they are usually not as colorful as the ants, but this may be because very few colors suffice to exhibit complex behaviors. For example, there is a specific class of turmites called <i>busy beavers</i> which are turmites that write a lot of things before stopping (busy beavers are usually classical turing machines, but the idea fits perfectly to turmites too). There is a sort of international competition where people strive to find the turmite that covers the biggest area before stopping. The web page is here: http://code.google.com/p/ruletablerepository/wiki/TwoDimensionalTuringMachines
pt_br: Como você pode ver ao explorar o conjunto de turmites acima, elas não são tão coloridas quanto as formigas, mas isto pode ser por que poucas cores são o suficientes para exibir comportamentos complexos. Por exemplo, existe uma classe específica de turmites chamada <i>busy beavers</i> que são turmites que escrevem várias coisas antes de parar (busy beavers normalmente são máquinas de turing clássicas, mas a ideia encaixa perfeitamente em turmites também). Existe um tipode competição internacional onde as pessoas tentam encontrar o turmite que cobre a maior área antes de parar. A página é esta: http://code.google.com/p/ruletablerepository/wiki/TwoDimensionalTuringMachines

source: Turmite universe
pt_br: Universo dos Turmites

source: This universe is very similar to the buggle one, but you will probably not use all buggles methods. So, this page only recap the buggle methods that you will use.
pt_br: Este universo é bastante similar ao dos buggles, mas você provavelmente não vai usar nenhum método dos buggles. Então, esta página apenas repacitula os métodos do buggle que você vai usar.

source: [!java|c]void [/!][!c]stepForward()[/!][!java|python|scala]forward()[/!] or [!java|c]void [/!]forward([!java|c]int [/!]steps[!scala]:Int[/!])
pt_br: [!java|c]void [/!][!c]avançarUmPasso()[/!][!java|python|scala]avançar()[/!] ou [!java|c]void [/!]avançar([!java|c]int [/!]passos[!scala]:Int[/!])

source: [!java|c]void [/!][!c]stepBackward()[/!][!java|python|scala]backward()[/!] or [!java|c]void [/!]backward([!java|c]int [/!]steps[!scala]:Int[/!])
pt_br: [!java|c]void [/!][!c]voltarUmPasso()[/!][!java|python|scala]voltar()[/!] ou [!java|c]void [/!]voltar([!java|c]int [/!]passos[!scala]:Int[/!])

source: Sorting World
pt_br: Mundo da ordenação

source: This world provides tools to experiment with the sorting algorithms. It can be used in two different ways: the first one is naturally to write the required sorting algorithms. But it is also possible to simply use the demo mode of each exercise to observe the behavior of sorting algorithms. It helps understanding the differences between each of them.
pt_br: Este mundo fornece ferramentas para experimentar com algoritmos de ordenação. Ele pode ser usado de duas formas diferentes: a primeira é naturalmente para escrever os algoritmos de ordenação necessários. Mas também é possível simplesmente usar o modo de demonstração de cada exercício para observar o comportamento de algoritmos de ordenação. Isto ajuda a entender as diferenças entre cada um deles.

source: Methods available to sorting algorithms
pt_br: Métodos disponíveis para algoritmos de ordenação

source: <b>Method</b>
pt_br: <b>Método</b>

source: <b>Action</b>
pt_br: Ação

source: <b>Cost</b>
pt_br: Custo

source: [!java|c]int [/!]getValueCount() [!scala]:Int[/!]
pt_br: [!java|c]int [/!]getQuantidadeDeValores() [!scala]:Int[/!]

source: Returns the amount of values in the array
pt_br: Retorna a quantidade de valores na array

source: none
pt_br: nenhum

source: [!java]boolean [/!][!c]int [/!]isSmaller([!java|c]int [/!]i[!scala]:Int[/!], [!java|c]int [/!]j[!scala]:Int[/!]) [!scala]:Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]éMenor([!java|c]int [/!]i[!scala]:Int[/!], [!java|c]int [/!]j[!scala]:Int[/!]) [!scala]:Boolean[/!]

source: Returns true if the content of cell i is strictly smaller than the one of cell j
pt_br: Retorna verdadeiro se o conteúdo da célula i é estritamente menor que o da célula j

source: two reads
pt_br: duas leituras

source: [!java]boolean [/!][!c]int [/!]isSmallerThan([!java|c]int [/!]i[!scala]:Int[/!], [!java|c]int [/!]value[!scala]:Int[/!])[!scala] :Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]éMenorQue([!java|c]int [/!]i[!scala]:Int[/!], [!java|c]int [/!]value[!scala]:Int[/!])[!scala] :Boolean[/!]

source: Returns true if the content of cell i is strictly smaller than the <code>value</code>
pt_br: Retorna verdadeiro se o conteúdo da célula i é estritamente menor que <code>valor</code>

source: one read
pt_br: uma leitura

source: [!java|c]void [/!]swap([!java|c]int [/!]i[!scala]:Int[/!], [!java|c]int [/!]j[!scala]:Int[/!])
pt_br: [!java|c]void [/!]alternar([!java|c]int [/!]i[!scala]:Int[/!], [!java|c]int [/!]j[!scala]:Int[/!])

source: Swaps the content of cell i and the one of cell j
pt_br: Alterna ("swap") o conteúdo da célula i com o da célula j

source: two reads, two writes
pt_br: duas escritas, duas leituras

source: [!java|c]void [/!]copy([!java|c]int [/!]from[!scala]:Int[/!], [!java|c]int [/!]to[!scala]:Int[/!])
pt_br: [!java|c]void [/!]copia([!java|c]int [/!]de[!scala]:Int[/!], [!java|c]int [/!]para[!scala]:Int[/!])

source: Copy the content of cell 'from' into the cell 'to'
pt_br: Copia o conteúdo da célula 'de' para a célula 'para'

source: one read, one write
pt_br: uma leitura, uuma escrita

source: [!java|c]int [/!]getValue([!java|c]int [/!]idx[!scala]:Int[/!])
pt_br: [!java|c]int [/!]getValor([!java|c]int [/!]idx[!scala]:Int[/!])

source: Returns the value of cell idx
pt_br: Retorna o valor da célula idx

source: [!java|c]void [/!]setValue([!java|c]int [/!]idx[!scala]:Int[/!], [!java|c]int [/!]value[!scala]:Int[/!])
pt_br: [!java|c]void [/!]setValor([!java|c]int [/!]idx[!scala]:Int[/!], [!java|c]int [/!]valor[!scala]:Int[/!])

source: Sets cell 'idx' to the <code>value</code>
pt_br: Coloca na célula 'idx' o <code>valor</code>

source: one write
pt_br: uma escrita

source: [!java]boolean [/!][!c]int [/!]isSelected() [!scala]:Boolean[/!]
pt_br: [!java]boolean [/!][!c]int [/!]selecionado() [!scala]:Boolean[/!]

source: Returns whether the current world is selected in the graphical interface.
pt_br: Retorna verdadeiro se o mundo atual está selecionado na interface gráfica.

source: History view
pt_br: Visão do histórico
