Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: Fixing the problem should be very easy. Simply make sure that the pre-condition of <code>keepHandOnSideWall()</code> is verified before calling it. For that, update your code to first look for a wall on its left before the big <code>while</code> loop.
pt_br: Consertar o problema deve ser bem fácil. Simplesmente garanta que a pré-condição de <code>keepHandOnSideWall()</code> seja verificada antes do chamado. Para isto, atualize seu código para primeiro olhar para uma parede à sua esquerda antes do loop <code>while</code> maior.

source: This universe introduces a little programming puzzle which can somehow be used to introduce programmation to non-reading kids since it is programmed graphically. The goal of each board is to light up all the lights. Your robot understands the following orders:
pt_br: Este universo introduz um pequeno quebra-cabeças de programação que pode num certo sentido ser usado para introduzir programação para crianças que não sabem ler uma vez que é programado graficamente. O objetivo de cada de cada tabuleiro é ligar todas as luzes. Seu robô entende as seguintes ordens:

source: <b>Move forward</b>
pt_br: <b>Mover para frente</b>

source: Cannot be done if the destination cell is of another height than source cell
pt_br: Não pode ser feito se a célula de destino é de outra altura que a célula de origem

source: <b>Jump forward</b>
pt_br: <b>Pular pra frente</b>

source: Can only be done if the destination cell is one step higher than source cell, or if destination is lower than source. Cannot be used for plain moves.
pt_br: Só pode ser feito se a célula de destino está um passo mais alto que a célula de origem, ou se o destino é mais baixo que a origem. Não pode ser usado para movimentos "plain".

source: <b>Turn left</b>.
pt_br: <b>Virar à esquerda</b>.

source: <b>Turn right</b>.
pt_br: <b>Virar à direita</b>.

source: <b>Switch the light</b>.
pt_br: <b>trocar a luz</b>.

source: Turn it on if it was off, and off if it was on. No effect if the cell does not contain any light.
pt_br: Liga se estiver desligada, e desliga se estiver ligada. Sem efeito se a célula não contém nenhuma luz.

source: <b>Call function 1</b>.
pt_br: <b>Chamar função 1</b>.

source: <b>Call function 2</b>.
pt_br: <b>Chamar função 2</b>.

source: Please note that this world is not completely suited to small kids since the main difficulty comes from the fact that your are highly limited in the amount of instructions you can give to your robot. Advanced levels thus require to write sound functions, and are often above the capacities of small kids.
pt_br: Por favor observe que este mundo não é completamente adequada para crianças pequenas uma vez que a principal dificuldade vem do fato de que a quantidade de instruções é muito limitada. Níveis avançados então necessitam escrever alguns sons, e estão acima das capacidades de crianças pequenas.

source: This game is heavily inspirated from a flash game of the same name, which can for example be played on kongregate.com. It was written by Danny Yaroslavski (Coolio-Niato), the original idea being of Matt Chase.
pt_br: Este jogo é fortemente inspirado num jogo em flash de mesmo nome, que pode por exemplo ser jogado em kongregate.com. Foi escrito por Danny Yaroslavski (Coolio-Niato), e a ideia original é de Matt Chase.

source: This lesson introduces a little programming puzzle inspired from a flash game.
pt_br: Esta lição introduz um pequeno quebra-cabeças de programação inspirado num jogo em flash.

source: See the <i>About this world</i> dialog for more details.
pt_br: Veja o diálogo <i>Sobre este mundo</i> para mais detalhes.

source: This lesson constitutes a little brain teaser for programmers. You have to instruct your robot to turn off all lights. The trick is that you program your robot graphically, and that you are limited in the amount of instructions.
pt_br: Esta lição constitui um pequeno "brain teaser" para programadores. Você tem que instruir seu robô a desligar todas as luzes. O truque é que você programa seu robô graficamente, e você tem uma quantidade limitada de instruções.

source: No previous experience is expected to take this lesson.
pt_br: Espera-se experiência prévia para fazer esta lição.

source: Welcome
pt_br: Bem-vindo

source: Welcome to the lightbot world. This is merely a programmer puzzle rather than a real lesson (although some use it to teach programming). The robot is not programmed in Java, but rather graphically. You can see the existing orders in the documentation using the <i>About this world</i> menu.
pt_br: Bem-vindo ao mundo lightbot. Este é apenas um quebra-cabeça de programador ao invés de uma lição real (embora algumas pessoas usem isto para ensinar programação). O robô não é programado em Java, mas sim graficamente. Você pode ver as ordens existentes na documentação usando o menu <i>Sobre este mundo</i>.

source: The goal of each board is simply to switch on every lights of the board using your little robot.
pt_br: O objetivo de cada tabuleiro é simplesmente ligar cada luz do tabuleiro usando seu pequeno robô.

source: This is a introduction exercise, which should be solvable by only moving forward and switching the light, using respectively
pt_br: Este é um exercício introdutório, que pode ser resolvido simplesmente movendo para frente e apertando o interruptor, usando respectivamente

source: and
pt_br: e

source: Turn around
pt_br: Virar

source: Now, you probably need to turn in addition (using
pt_br: Agora, você provavelmente precisa virar adicionalmente (usando

source: Jump
pt_br: Pular

source: You can also jump using
pt_br: Você também pode pular usando

source: to pass obstacles. You can either jump one level up or any amount of levels down, but you cannot jump to go on a cell of the same height.
pt_br: para passar obstáculos. você pode tanto pular um nível ou qualquer quantidade de níveis para baixo, mas você não pode pular para uma célula de mesma altura.

source: Stairs
pt_br: Degraus

source: Can you pass these stairs?
pt_br: Você pode passar estes degraus?

source: Higher
pt_br: Mais alto

source: Let's go higher
pt_br: Vamos mais alto

source: You can use
pt_br: Você pode usar

source: to call respectively the first and second functions. Define their code in their own tab.
pt_br: chamar respectivamente as primeira e segunda funções. Defina seu código na sua própria aba.

source: This is great if you get out of space in your main function
pt_br: Isto é muito bom se você ficar sem espaço na sua função principal

source: Repetitive tasks
pt_br: Tarefas repetitivas

source: Functions are also of great use for repetitive tasks
pt_br: Funções também são muitos úteis para tarefas repetitivas

source: Calling functions from functions
pt_br: Chamando funções de dentro de funções

source: It is perfectly okay to call a function from within a function!
pt_br: Não tem nada de errado em chamar uma função de dentro de uma função!

source: Castle
pt_br: Castelo

source: You're getting good at this...
pt_br: Você está ficando bom nisto...

source: Wall
pt_br: Parede

source: Ready to climb the wall?
pt_br: Preparado para subir a parede?

source: Sea
pt_br: Mar

source: You now have to surf these waves of lamps.
pt_br: Agora você vai ter que surfar neste mar de lâmpadas.

source: Escher Castle
pt_br: Castelo de Escher

source: This one aint easy.
pt_br: Este não é fácil.

source: Close to 10
pt_br: Próximo de 10

source: Given 2 int values, return whichever value is nearest to the value 10, or return 0 in the event of a tie. [!java|scala]Note that Math.abs(n) returns the absolute value of a number.[/!] [!python]Note that math.fabs(n) returns the absolute value of a number. This function can only be used if you imported the math module.[/!]
pt_br: Dados dois valores int, retorne o valor que for mais próximo do 10, ou retorne 0 no caso de um empate. [!java|scala]Note que Math.abs(n) retorna o valor absoluto de um número.[/!] [!python]Note que math.fabs(n) retorna o valor absoluto de um número. Esta função só pode ser usada se você importar o módulo math.[/!]

source: Count Teen
pt_br: Contar Adolescentes

source: We'll say that a number is "teen" if it is in the range 13..19 inclusive. Given 4 int values, return the amount of teen ones.
pt_br: Vamos dizer que um número é "adolescente" se ele estiver no intervalo 13..19 inclusive. Dados 4 valores int, retorne a quantidade de adolescentes.

source: Diff 21
pt_br: Diferença 21

source: Given an int n, return the absolute difference between n and 21, except return double the absolute difference if n is over 21.
pt_br: Dado um int n, retorne a diferença absoluta entre n e 21, exceto se n for maior que 21, onde neste caso você retorna a diferença absoluta.

source: Has Teen
pt_br: Tem Adolescente

source: We'll say that a number is "teen" if it is in the range 13..19 inclusive. Given 3 int values, return true if 1 or more of them are teen.
pt_br: Diremos que um número é "adolescente" se ele está entre 13..19 inclusive. dados 3 valores int, retorne true se 1 ou mais deles são teen.

source: Icy Hot
pt_br: Frio Quente

source: Given two temperatures, return true if one is less than 0 and the other is greater than 100.
pt_br: Dadas duas temperaturas, retorne true se uma é menor que 0 e a outra é maior que 100.

source: Given 2 int values, return true if either of them is in the range 10..20 inclusive.
pt_br: Dados 2 valores int, retorne true se qualquer um deles estiver no intervalo 10..20 inclusive.

source: Given 2 int values, return true if they are both in the range 30..40 inclusive, or they are both in the range 40..50 inclusive.
pt_br: Dados 2 valores int, retorne true se eles estão ambos no intervalo 30..40 inclusive, ou se eles estão ambos no intervalo 40..50 inclusive.

source: LastDigit
pt_br: Último Dígito

source: Given two non-negative int values, return true if they have the same last digit, such as with 27 and 57. Note that the % "mod" operator computes remainders, so 17 % 10 is 7.
pt_br: Dados dois valores int não-negativos, retorne true se eles tem o mesmo dígito final, como com 27 e 57. Note que o operador % "mod" calcula os restos, logo, 17 % 10 is 7.

source: This exercise was converted to PLM from the excellent exercising site http://javabat.com/
pt_br: Este exercício foi convertido para o PLM do excelente sítio de exercícios http://javabat.com/

source: We'll say that a number is "teen" if it is in the range 13..19 inclusive. Given 2 int values, return true if one or the other is teen, but not both.
pt_br: Diremos que um número é "teen" se ele está no intervalo entre 13..19 inclusive. Dados 2 valores, retorne true se um ou o outro é teen, mas não ambos.

source: Boolean operations are one of the very basic task in programming. As long as you cannot write a not so simple boolean test under the minute, you probably will have a very bad time writing a real program.
pt_br: Operações booleanas são algumas das mais básicas tarefas em programação. Enquanto você não puder escrever um teste booleano não muito simples em menos de um minuto, você provavelmente terá dificuldades em escrever programas do mundo real.

source: That is why this lesson provides you a bunch of such exercises, so that you can get trained in this.
pt_br: É por isto que esta lição fornece vários exercícios deste tipo, de forma que você fique treinado nisto.

source: Given 2 positive int values, return the larger value that is in the range 10..20 inclusive, or return 0 if neither is in that range.
pt_br: Dados 2 valores int positivos, returne o maior valor que está no intervalo 10..20 inclusive, ou retorne 0 se nenhum dos dois estiver neste intervalo.

source: Note that Math.max(Int,Int):Int and Math.min(Int,Int):Int return the maximum and minimum of two integers
pt_br: Observe que Math.max(Int,Int):Int e Math.min(Int,Int):Int retornam o máximo e o mínimo de dois inteiros

source: We have two monkeys, a and b, and the parameters aSmile and bSmile indicate if each is smiling. We are in trouble if they are both smiling or if neither of them is smiling. Return true if we are in trouble.
pt_br: Temos dois macacos, a e b, e os parâmetros aSmile e bSmile indicam se cada um está sorrindo. Teremos problemas se os dois estiverem sorrindo ou nenhum deles estiver sorrindo. Retorne true se estivermos com problemas.

source: Given an int n, return true if it is within 10 of 100 or 200. [!java|scala]Note that Math.abs(n) returns the absolute value of a number.[/!] [!python]Note that math.fabs(n) returns the absolute value of a number. This function can only be used if you imported the math module.[/!]
pt_br: Dado um int n, retorna true se ele estiver entre 10 a 100 ou 200. [!java|scala]Note que Math.abs(n) retorna o valor absoluto de um número.[/!] [!python]Note que math.fabs(n) retorna o valor absoluto de um número. Esta função só pode ser usada se você importar o módulo math.[/!]

source: We have a loud talking parrot. The "hour" parameter is the current hour time in the range 0..23. We are in trouble if the parrot is talking and the hour is before 7 or after 20. Return true if we are in trouble.
pt_br: Temos um papagaio muito barulhento. o parâmetro "hora" é a hora atual no intervalo 0..23. Estamos com problemas se o papagaio fala e a hora for antes de 7 ou depois de 20. Retorne true se estivermos com problemas.

source: Positive Negative
pt_br: Positivo Negativo

source: Given 2 int values, return true if one is negative and one is positive. Unless negative is true, then they both must be negative.
pt_br: Dados 2 valores int, retorne true se um é negativo e o outro é positivo. A menos que o negativo seja verdadeiro, neste caso ambos devem ser negativos.

source: The parameter weekday is true if it is a weekday, and the parameter vacation is true if we are on vacation. We sleep in if it is not a weekday or we're on vacation. Return true if we sleep in.
pt_br: O parâmetro dia da semana é true se estivermos num dia de semana, e o parâmetro vacation (férias) é true se estivermos de férias. Nós dormimos de manhã se não for dia de semana ou se estivermos de férias. Retorne true se dormimos de manhã.

source: Sum Double
pt_br: Soma dupla

source: Given two int values, return their sum. Unless the two values are the same, then return double their sum.
pt_br: Dados dois valores int, retorne sua soma. A menos que dois valores sejam os mesmos, neste caso retorne o dobro de sua soma.

source: AlarmClock
pt_br: Despertador

source: Given a day of the week encoded as 0=Sun, 1=Mon, 2=Tue, ...6=Sat, and a boolean indicating if we are on vacation, return a string of the form "7:00" indicating when the alarm clock should ring. Weekdays, the alarm should be "7:00" and on the weekend it should be "10:00". Unless we are on vacation -- then on weekdays it should be "10:00" and weekends it should be "off".
pt_br: Dado o dia da semana, codificado da seguinte forma: 0=Domingo, 1=Segunda, 2=Terça, ... 6=Sábado, e um booleano férias indicando se estamos de férias, retorne uma cadeia de caracteres da forma "7:00" indicando de que horas devemos botar o despertador. Nos dias da semana, devemos nos acordar às 7h e nos finais de semana às 10h. Durante as férias, devemos nos acordar de 10h e nos finais de semana desligar o despertador.

source: AnswerCell
pt_br: secretária eletrônica

source: Your cell phone rings. Return true if you should answer it. Normally you answer, except in the morning you only answer if it is your mom calling. In all cases, if you are asleep, you do not answer.
pt_br: Seu celular toca. Retorne true se você deve atender. Normalmente você responde, exceto de manhã, quando você só atende sua mãe. De qualquer forma, se você estiver dormindo, você não responde.

source: BlueTicket
pt_br: bilhete azul

source: You have a blue lottery ticket, with ints a, b, and c on it. This makes three pairs, which we'll call ab, bc, and ac. Consider the sum of the numbers in each pair. If any pair sums to exactly 10, the result is 10. Otherwise if the ab sum is exactly 10 more than either bc or ac sums, the result is 5. Otherwise the result is 0.
pt_br: Você tem um bilhete de loteria azul, com os inteiros a, b e c. Eles fazem três pares que chamaremos de ab, bc e ac. Considere a soma dos números de cada par. Se a soma de um dos pares vale exatamente 10, o resultado é 10. Senão, se a soma ab vale exatamente 10 mais bc ou ac, o resultado é 5. Senão, o resultado é 0.

source: CaughtSpeeding
pt_br: Radar de velocidade

source: You are driving a little too fast, and a police officer stops you. Write code to compute the result, encoded as an int value: 0=no ticket, 1=small ticket, 2=big ticket. If speed is 60 or less, the result is 0. If speed is between 61 and 80 inclusive, the result is 1. If speed is 81 or more, the result is 2. Unless it is your birthday -- on that day, your speed can be 5 higher in all cases.
pt_br: Você está dirigindo um pouco rápido demais é um guarda te pára. Escreva o código para calcular o resultado, codificado na forma de um inteiro: 0=sem multa, 1=multa leve, 2=multa pesada. Se sua velocidade é inferior a 60, o resultado é 0. Se a velocidade está entre 61 e 80 (inclusive), o resultado é 1. Se a velocidade é 81 ou maior, o resultado é 2. Todos estes casos são para dias que não são seu aniversário. No seu dia de aniversário sua velocidade pode ser maior em 5 em todos os casos.

source: CigarParty
pt_br: Festa dos charutos

source: DateFashion
pt_br: Encontro elegante

source: You and your date are trying to get a table at a restaurant. The parameter "you" is the stylishness of your clothes, in the range 0..10, and "date" is the stylishness of your date's clothes. The result getting the table is encoded as an int value with 0=no, 1=maybe, 2=yes. If either of you is very stylish, 8 or more, then the result is 2 (yes). With the exception that if either of you has style of 2 or less, then the result is 0 (no). Otherwise the result is 1 (maybe).
pt_br: Você e seu par estão tentando conseguir uma mesa no restaurante. O parâmetro "you" (você) é o nível de elegância de suas roupas, no intervalo 0..10, e "date" (par) é o nível de elegância de seu par. O resultado da tentativa de obter uma mesa é codificado como um valor inteiro com 0=no (não), 1=maybe (talvez), 2=yes (sim). Se um de vocês está muito elegante, 8 ou mais, o resultado é 2 (yes). Com uma exceção. se um dos dois tem um estilo de 2 ou menos o resultado é 0 (no). Caso contrário o resultado é 1 (maybe).

source: According to Wikipedia, Fizz buzz is a group word game for children to teach them about division. Players take turns to count incrementally, replacing any number divisible by three with the word "Fizz", and any number divisible by five with the word "Buzz". Any number that is divisible by both three and five is replaced with the string "Fizz Buzz".
pt_br: De acordo com a Wikipedia, Fizz buzz é um jogo de "group word" para crianças para ensinar divisão. Os jogadores jogam em turnos numéricos que vão aumentando, substituindo qualquer número divisível por três com a palavra "Fizz", e qualquer número divisível por cinco com a palavra "Buzz". Qualquer número que é divisível tanto por 3 quanto por 5 é substituído pela palavra "Fizz Buzz".

source: Unchanged numbers are simply returned as a string. [!java|scala]The easiest for that is to use that [!thelang] idiomatic: <code>""+a</code>[/!] [!python]The function <code>str(a)</code> changes an integer <code>a</code> into a string.[/!]
pt_br: números que não são substituídos são simplesmente retornados como uma string. [!java|scala]O eito mais fácil é usar esta construção em [!thelang]: <code>""+a</code>[/!] [!python]A função <code>str(a)</code> transforma um inteiro <code>a</code> numa string.[/!]

source: GreenTicket
pt_br: bilhete verde

source: You have a green lottery ticket, with ints a, b, and c on it. If the numbers are all different from each other, the result is 0. If all of the numbers are the same, the result is 20. If two of the numbers are the same, the result is 10.
pt_br: Você tem um bilhete de loteria verde, com os inteiros a, b e c inscritos nele. Se os números são todos diferentes uns dos outros, o resultado é 0. Se todos os números são idênticos, o resultado é 20. Se dois dos números são os mesmos, o resultado é 10.

source: In1To10
pt_br: De 1 a 10

source: Given a number n, return true if n is in the range 1..10, inclusive. Unless "outsideMode" is true, in which case return true if the number is less or equal to 1, or greater or equal to 10.
pt_br: Seja um número n, retorne verdadeiro se n está no intervalo [1,10]. Exceto se "outsideMode" é verdadeiro, e neste caso retorne verdadeiro se o número é menor ou igual a 1 ou maior ou igual a 10.

source: InOrderEqual
pt_br: Em ordem crescente

source: Given three ints, a b c, return true if they are in strict increasing order, such as 2 5 11, or 5 6 7, but not 6 5 7 or 5 5 7. However, with the exception that if "equalOk" is true, equality is allowed, such as 5 5 7 or 5 5 5.
pt_br: Dados três inteiros, a b c, retorne verdadeiro se eles estão em ordem estritamente crescente, como 2 5 11, ou 5 6 7, mas não 6 5 7 ou 5 5 7. Entretanto, com a exceção de se "equalOk" for verdadeiro, igualdade é permitida, como 5 5 7 ou 5 5 5.

source: InOrder
pt_br: Na ordem

source: Given three ints, a b c, return true if b is greater than a, and c is greater than b. However, with the exception that if "bOk" is true, b does not need to be greater than a.
pt_br: Dados três inteiros, a b c, retorne verdadeiro se b é maior que a, e c é maior que b. Entretanto, com a exceção que se "bOk" é verdadeiro, b não precisa ser maior que a.

source: LastDigit 2
pt_br: Último dígito 2

source: Given three ints, a b c, return true if two or more of them have the same rightmost digit. The ints are non-negative. Note: the % "mod" operator computes the remainder, e.g. 17 % 10 is 7.
pt_br: Dados três inteiros, a b c, retorne verdadeiro se dois ou mais deles tem o mesmo último dígito. Os inteiros são não-negativos. Nota: o operador % "mod" calcula o resto, e.g. 17 % 10 is 7.

source: LessBy10
pt_br: Menor por 10

source: Given three ints, a b c, return true if one of them is 10 or more less than one of the others.
pt_br: Dados três inteiros, a b c, retorne verdadeiro se um deles é 10 ou menor que um dos outros.

source: Boolean (even more) fun
pt_br: (mais) diversão com booleanos

source: A very good introduction to this type is available here: http://codingbat.com/doc/java-if-boolean-logic.html
pt_br: Uma ótima introdução a este tipo está disponível em: http://codingbat.com/doc/java-if-boolean-logic.html

source: Given two int values, return whichever value is larger. However if the two values have the same remainder when divided by 5, then the return the smaller value. However, in all cases, if the two values are the same, return 0. Note: the % "mod" operator computes the remainder, e.g. 7 % 5 is 2.
pt_br: Sejam dois valores inteiros, retorne o maior dos dois. Entretanto, se os dois valores possuem o mesmo resto quando divididos por 5, retorne o menor dos dois. Entretanto, em todo caso, se os dois valores forem iguais, retorne 0. Nota: o operador % "mod" calcula o resto, i.e. 7 % 5 vale 2.

source: NearTen
pt_br: Próximo de dez

source: Given a non-negative number "num", return true if num is within 2 of a multiple of 10. Note: (a % b) is the remainder of dividing a by b, so (7 % 5) is 2.
pt_br: Seja um inteiro positivo "num", retorne verdadeiro se num está a uma diferença de 2 ou menos de um múltiplo de 10. Nota: ( a % b ) é o resto da divisão de a por b. Logo, (7 % 5) vale 2.

source: RedTicket
pt_br: Bilhete vermelho
