Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: Your buggle decided to flower a bit the pot it lives in. You have to help it reproducing the drawing of its dreams (check the "Objective" tab to see it).
pt_br: Seu buggle decidiu plantar umas flores no pote onde vive. Você tem que ajudar ele a reproduzir o desenho dos sonhos dele (verifique a aba "Objetivo" para ver o sonho).

source: For that, you have to write a <code>growFlowers()</code> method that does not take any parameter and does not return any result. As the pattern is a bit complex, you should try to decompose this drawing in sub-steps so that your code remains short and easy to read. A method to draw one flower of the color passed in parameter sounds like a good start, but it is probably not enough.
pt_br: Para isto, você tem que escrever um método <code>growFlowers()</code> que não recebe parâmetros e nem retorna nenhum resultado. Como o padrão é um pouco complexo, você deve tentar decompor este desenho em sub-passos de forma que seu código permaneça curto e fácil de ler. Um método para desenhar uma flor da cor passada como parâmetro parece um bom começo, mas provavelmente não é o suficiente.

source: For your information, this drawing uses five colors that are listed below. [!java|scala|c]The data type of these constants is <code>Color</code>, that naturally describes a particular color.[/!]
pt_br: Para sua informação, este desenho usa cinco cores que estão listadas abaixo. [!java|scala|c]o tipo de dados destas constantes é <code>Cor</code>, que naturalmente descreve uma cor particular.[/!]

source: Flower Display Case
pt_br: Vitrine de flores

source: Whao! That's not a little pot anymore! That's a huge large flower display case! Your buggle can't help but starts flowering this gorgeous place. You should help it to prevent that it bumps into a wall...
pt_br: Uau! isto não é mais um potinho! É uma grande vitrine de flores! Seu buggle mal pode esperar para começar a florir este belo lugar. Você deve ajudá-lo a não bater nas paredes...

source: PS: the newly used color is <code>Color.BLUE</code>.
pt_br: PS: a cor recentemente usada é <code>Cor.AZUL</code>.

source: Colorful drawing
pt_br: Desenho colorido

source: If you observe carefully the picture to draw, it is constituted of four parts depicting a sort of V using a different color. A possible decomposition is to write a method in charge of drawing a V of the specified color from the current position. Its prototype can be:
pt_br: Se você observar cuidadosamente a figura para pintar, ela é constituída de quatro partes descrevendo um tipo de V usando uma cor diferente. Uma decomposição possível é escrever um método responsável por pintar um V de uma cor específica a partir da posição atual. Seu protótipo pode ser:

source: [!java|c]void [/!]makeV([!java|c]Color [/!]c[!scala]: Color[/!])[!python] <span class="comment"># parameter c is of type Color</span>[/!]
pt_br: [!java|c]void [/!]fazerV([!java|c]Cor [/!]c[!scala]: Cor[/!])[!python] <span class="comment"># parâmetro c é do tipo Cor</span>[/!]

source: The <code>Color</code> data type naturally describes a particular color. Your code should probably call <code>makeV</code> with the following arguments (a different color for each call):
pt_br: O tipo de dados <code>Cor</code> descreve obviamente uma cor particular. Seu código provavelmente vai chamar <code>fazerV</code> com os seguintes argumentos (uma cor diferente para cada chamada):

source: [!java|scala|python]Color.[/!]YELLOW
pt_br: [!java|scala|python]Cor.[/!]AMARELO

source: [!java|scala|python]Color.[/!]RED
pt_br: [!java|scala|python]Cor.[/!]VERMELHO

source: [!java|scala|python]Color.[/!]BLUE
pt_br: [!java|scala|python]Cor.[/!]AZUL

source: [!java|scala|python]Color.[/!]GREEN
pt_br: [!java|scala|python]Cor.[/!]VERDE

source: In <code>makeV()</code>, you should use the <code>setBrushColor()</code> method (predefined in the buggle) to change the color of the buggle's brush, as well as <code>brushUp()</code> and <code>brushDown()</code> to change the brush position.
pt_br: Em <code>makeV()</code>, você deve usar o método <code>setBrushColor()</code> (pré-definido no buggle) para mudar a cor do pincel do buggle, assim como <code>levantarPincel()</code> e <code>abaixarPincel()</code> para mudar a posição do pincel.

source: It may be wise to write the <code>makeV()</code> so that it places directly the buggle in position for the next V.
pt_br: É recomendável escrever o código do <code>fazerV()</code> de forma que ele deixe o buggle na posição para o próximo V.

source: Your turn now. I'm sure you can imagine the other methods you need to keep your code simple and pleasant to read. Complete the method <code>run()</code> that should be called automatically (once). [!java]the <code>public</code> keyword means more or less that anybody can call this method, which is good because the PLM infrastructure calls it directly.[/!]
pt_br: Agora é sua vez. tenho certeza de que você pode imaginar os outros métodos necessários para manter seu código simples e agradável de ler. Complete o método <code>run()</code> que será chamado automaticamente (uma vez). [!java]a palavra-chave <code>public</code> significa mais ou menos que todo mundo pode chamar este método, o que é bom pois a infraestrutura do PLM chama ele diretamente.[/!]

source: Larger colorful drawing
pt_br: Um desenho colorido maior

source: You thus have to declare even more methods to use the repetitions of the pattern and factorize your code. Another solution is to <i>parametrize</i> your functions to reuse the code you wrote previously by changing the size.
pt_br: Você agora tem que declarar ainda mais métodos para usar as repetições de padrões e fatorizar seu código. Outra soução é <i>parametrizar</i> suas funções para reusar o código que você escreveu previamente mudando o tamanho.

source: Your turn...
pt_br: Sua vez...

source: Another Colorful Pattern
pt_br: Outro padrão colorido

source: Here is yet another exercise where you have to reproduce the pattern provided in the "Objective" tab.
pt_br: Aqui está outro exercício onde você tem que reproduzir o padrão fornecido na aba "Objetivo".

source: This one is a bit more difficult than the one seen previously. Look for repeating patterns, even if the color changes, and write a method drawing each of them.
pt_br: Este é um pouco mais difícil do que o anterior. Procure por padrões de repetição, mesmo se a cor mudar, e escreva um método desenhando cada um deles.

source: Good luck!
pt_br: Boa Sorte!

source: Now that your <code>isFacingTrail()</code> method is working, it's time to write the code to organize the hunting party. Copy/paste your code from the previous exercise, and complete the <code>hunt()</code> method.
pt_br: Agora que seu método <code>estáDeFrenteParaRastro()</code> está funcionando, é hora de escrever o código para organizar a festa da caçada. Copie-e-cole seu código do exercício anterior e complete o método <code>caçar()</code>.

source: Following a track is not very difficult: move forward as long as you have the track in front of you. If there is not track in front of you anymore, check whether the rest of the track is on your left or on your right, and follow it further.
pt_br: Seguir uma trilha não é difícil: avance até você ter a trilha em frente a você. Se não houver trilha mais trilha em frente a você, verifique se o restante da trilha está a sua esquerda ou à sua direita, e vá nesta direção.

source: To ensure that you don't mix the track you come from with the one in front of you, the easier is to erase the track when you follow it. Use the method <code>brushDown()</code> to put your brush down and mark the ground, and <code>brushUp()</code> to move it up again.
pt_br: Para garantir que você não misture o caminho de onde você veio com o para onde você vai, a forma mais fácil é apagar o caminho por onde você passa. Use o método <code>abaixarPincel()</code> para abaixar seu pincel e marcar o chão, e <code>levantarPincel()</code> para levantá-lo de novo.

source: Finally, do not forget to capture your prey once you found it (using <code>pickupBaggle()</code>).
pt_br: Finalmente, não esqueça de capturar sua presa quando encontrá-la (usando <code>pickupBaggle()</code>).

source: <a name="Objectives"> Complete the <code>hunt()</code> method. You probably want to copy over the <code>isFacingTrail()</code> method that you wrote in previous exercise. </a>
pt_br: <a name="Objetivos"> Complete o método <code>caçar()</code>. Você não gostaria de copiar o método <code>estáDeFrenteParaRastro()</code> que você escreveu no exercício anterior?</a>

source: Your buggle is super happy! It just found the green dribbling trail, certainly left by a big yummy slug. At its end, the buggle is certain to entertain itself with this appetizing slug (represented as a baggle).
pt_br: Seu buggle está super-feliz! Ele acabou de encontrar o rastro verde e úmido, certamente deixado por um apetitosa e grande lesma. No seu final, o buggle tem certeza de que vai se divertir com est deliciosa lesma (representada por um baggle).

source: To reach that goal, you had to write a boolean method <tt>isFacingTrail</tt>, which determines whether we are facing a green cell or not. Of course, if we are facing a wall, it should return false without bumping into it. You should make sure that this method has no <b>side effect</b>, i.e. that it does not change the state of the calling buggle nor of its world.
pt_br: Para atingir este objetivo, você tem que escrever um método booleano <tt>estáDeFrenteParaRastro</tt>, que determina se estamos virados para uma célula verde ou não. Obviamente, se nós estivermos virados para uma parede, ele deve retornar falso sem "bumping" nela. Você deve se certificar que este método não tem <b>efeitos colaterais</b>, i.e. que ele não muda o estado do "calling buggle" ou do mundo.

source: Your tool to that end is the <code>getGroundColor()</code> that returns the color of the current cell. Just go to the cell you want to test and run that function. [!java]You cannot test whether this color is equal to <code>Color.green</code> with an <code>==</code> sign but instead you have to write something like <code>getGroundColor().equals(Color.green)</code>. This is because green is an <i>object</i> in Java, and <code>.equals()</code> is the way to go to test equality between Java objects.[/!] [!python|scala|c]So you just have to test whether the returned color is equal to the value <code>[!scala|python]Color.green[/!][!c]GREEN[/!]</code>, that represents the green color.[/!]
pt_br: Sua ferramenta para este objetivo é o <code>getCorDoChão()</code> que retorna a cor da célula atual. Simplesmente vá para a célula que você quer testar e execute esta função. [!java]Você não pode testar se esta cor é igual a <code>Cor.verde</code> com um símbolo de <code>==</code> mas sim escrever algo como <code>getCorDoChão().equals(Cor.verde)</code>. Isto acontece por que verde é um <i>objeto</i> em Java, e <code>.equals()</code> é a forma de testar igualdade entre objetos Java.[/!] [!python|scala]Então você tem que testar se a cor retornada é igual ao valor <code>Cor.verde</code>, que representa a cor verde.[/!]

source: Complete the <code>isFacingTrail()</code> method (which gets called automatically).
pt_br: Complete o método <code>estáDeFrenteParaRastro()</code> (que será chamado automaticamente).

source: Slugs and Snails
pt_br: Lesmas e Caracóis

source: Yuhu! This time, your buggle found the tracks of much more preys! In the first world, that's a yummy Kitty Slug (leaving a pink trail) while on the second world, that's a big fat snail that awaits your buggle at the end of the orange trail.
pt_br: Iuhu! Desta vez, seu buggle encontrou trilhas com muitas presas! No primeiro mundo, era uma bela lesma deliciosa (que deixava um rastro rosa) e no segundo mundo, uma grande e gordo caracol que esperava seu buggle no final do rastro laranja.

source: You have to copy/paste your code again, and change it so that your methods take the color of the trail to follow as a parameter. Beside of this, your code should work as earlier.
pt_br: Você tem que copiar/colar seu código de novo, e mudá-lo de forma que seus métodos fiquem com a cor do rastro para seguir como um parâmetro. E mesmo assim, seu código deve funcionar como antes.

source: Don't get lost on false leads! <code>The hunt()</code> method was given a parameter to tell you which color to follow (and it is not the same in all worlds). Add a parameter to your <code>isFacingTrail()</code> method to only follow the requested color, as the other colors lead to dead ends...
pt_br: Cuidado para não seguir pistas falsas! O método <code>hunt()</code> recebe um parâmetro para dizer que cor seguir (e não é o mesmo em todos os mundos). Adicione um parâmetro ao seu método <code>isFacingTrail()</code> para apenas seguir a cor requisitada, pois as outras cores vão levar a becos sem saída...

source: After these races, it's time to party! For that, we will teach the buggles to play Dance Revolution, this game beloved of some students: The player has to move the feet on the carpet according to the instructions presented on the screen, and following the music. But before that, we have some details to study first.
pt_br: Depois destas corridas, é hora de festejar! Para isto, vamos ensinar os buggles a jogar Dance Revolution, este jogo amado por alguns estudantes: O jogador tem que mover os pés num carpete de acordo com as instruções apresentadas na tela, e seguir a música. Mas antes disto, temos alguns detalhes para estudar primeiro.

source: Conditionals without curly braces
pt_br: Condicionais sem colchetes

source: There is one detail we omitted about the conditional syntax: if a branch contains only one instruction, then the curly braces become optional. So, the two chunk of code are equivalent:
pt_br: Existe um detalhe que nós omitimos sobre a sintaxe do condicional: se um ramo contém apenas uma instrução, então o colchetes se torna opcional. Portanto, estes dois pedaços de código são equivalentes:

source: if (<b>condition</b>) <b>whatToDoIfTheConditionIsTrue();</b> else <b>whatToDoElse();</b>
pt_br: if (<b>condição</b>) <b>oQueFazerSeACondiçãoÉVerdadeira();</b> else <b>oQueFazerCasoContrário();</b>

source: Actually, you can do the same for loops body that are reduced to one instruction only. But beware, this becomes dangerous if you chain the <tt>if</tt> instructions like this:
pt_br: Na verdade, você pode fazer o mesmo em corpos de loop que se reduzem a apenas uma instrução. Mas cuidado, isto se torna perigoso se sua cadeia de instruções <tt>if</tt> parece com isto:

source: if (isOverBaggle()) if (x == 5) left(); else right(); [!c]stepForward();[/!][!java|scala]forward();[/!]
pt_br: if (estáSobreBaggle()) if (x == 5) esquerda(); else direita(); [!c]avançarUmPasso();[/!][!java|scala]avançar();[/!]

source: In fact, it does not turn right when there is no baggle on the ground AND x equals 5, but when the buggle found a baggle on the ground and x equals anything but 5. Putting this otherwise, the buggle understands the previous code as if it were written the following way (note that the <tt>else</tt> were moved to the right):
pt_br: De fato, não é para virar à direita quando não existe baggle no chão E x é igual a 5, mas quando o buggle encontra um baggle no chão e x é diferente de 5. Colocando de outra forma, o buggle entende o código anterior como se ele fosse escrito da seguinte forma (note que o <tt>else</tt> foi movido para a direita):

source: if (isOverBaggle()) if (x == 5) left(); else right(); [!c]stepForward();[/!][!java|scala]forward();[/!]
pt_br: if (estáSobreBaggle()) if (x == 5) esquerda(); else direita(); avançar();

source: The first lesson of this is that the indentation is very important to help humans understanding, even if it does not change the actual meaning of the code. We could have written the following code and obtain the same result. But if you want a human to read and review your code, you really want to indent it correctly. That's for example the case if you want a professor to read it (to grade it or to answer a question about it), or if you want to reuse your code later, or even if you need to debug your code yourself.
pt_br: A primeira lição a tirar daí é que identação é muito importante para ajudar os humanos a entender, mesmo que não mude o significado do código. Nós poderíamos ter escrito o seguinte código e teríamos obtido o mesmo resultado. Mas se você quer que um humano leia e revise seu código, você vai com certeza querer indentar ele corretamente. Este é o caso, por exemplo, se você quer que um professor leia ele (para dar nota ou tirar uma dúvida), ou se você quiser reutilizar seu código mais tarde, ou mesmo se você quiser depurar você mesmo seu código.

source: if (isOverBaggle()) if (x == 5) left(); else right(); [!c]stepForward();[/!][!java|scala]forward();[/!]
pt_br: if (estáSobreBaggle()) if (x == 5) esquerda(); else direita(); [!c]avançarUmPasso();[/!][!java|scala]avançar();[/!]

source: The second lesson is that a <tt>else</tt> branch always connects to the closest <tt>if</tt>. This may be a bit troublesome in some case, and it may be easier to add more braces than strictly needed to remove any ambiguity.
pt_br: A segunda lição é que o ramo do <tt>else</tt> sempre se conecta ao <tt>if</tt> mais próximo. Isto pode se tornar confuso em alguns casos, e torna-se mais fácil adicionar mais chaves do que o estritamente necessário para remover quaisquer ambiguidades.

source: Chaining conditionals
pt_br: Encadeando condicionais

source: You sometimes want to ask the buggle something similar to:
pt_br: Algumas vezes você quer perguntar ao buggle algo similar a:

source: if it's raining, take an umbrella; if not, and if it's a hot day, take a bottle of water; if not and if it's July 4th, take an American flag
pt_br: se está chovendo, pegue um guarda-chuva; se não, e se está quente, pegue uma garrafa de água; se não e se hoje é 4 de Julho, pegue uma bandeira dos estados unidos

source: The trap is that we want at most one of these actions to be taken. That is to say, if it's raining a very hot July 4th, we don't want the buggle to get outside with an umbrella, some water and a flag, but simply with an umbrella. The following code is thus WRONG.
pt_br: O armadilha é que nós queremos que pelo menos uma destas ações sejam feitas.É como dizer, se está chovendo num 4 de Julho quente, não queremos que o buggle vá para fora com um guarda-chuva, água e um bandeira, mas simplesmente com um guarda-chuva. O código seguinte está, então, ERRADO.

source: [!scala|c|java]if (rainy()) takeUmbrella(); if (hot()) takeWater(); if (todayIsJuly4th()) takeFlag();[/!][!python]if rainy(): takeUmbrella() if hot(): takeWater() if todayIsJuly4th(): takeFlag()[/!]
pt_br: [!scala|c|java]if (chovendo()) pegueGuarda-Chuva(); if (quente()) pegueAgua(); if (hoje4Julho()) pegueBandeira();[/!][!python]if chovendo(): pegueGuarda-Chuva() if quente(): pegueAgua() if hoje4Julho(): pegueBandeira()[/!]

source: Indeed, since the conditions are evaluated one after the other, there is a risk that you go to the July 4th march on a rainy day. Instead, we should use something like this to ensure that once we found a true condition, we won't evaluate the next ones.
pt_br: Na verdade, já que as condições são calculadas uma depois da outra, existe um risco de que você vá para a marcha de 4 de Julho num dia chuvoso. Na verdade, nós devemos usar algo como isto para garantir que uma vez que encontremos a condição verdadeira, não passemos para as próximas.

source: [!java|scala|c]if (rainy()) { takeUmbrella(); } else { if (hotDay()) { takeWater(); } else { if (todayIsJuly4th()) { takeFlag(); } } }[/!][!python]if rainy(): takeUmbrella() else: if hotDay(): takeWater() else: if todayIsJuly4th(): takeFlag()[/!]
pt_br: [!java|scala|c]if (chuvoso()) { pegarGuardaChuva(); } else { if (diaQuente()) { pegarAgua(); } else { if (jogoDaCopa()) { pegarBandeira(); } } }[/!][!python]if chuvoso(): pegarGuardaChuva() else: if diaQuente(): pegarAgua() else: if jogoDaCopa(): pegarBandeira()[/!]

source: Unfortunately, such a cascade of conditionals is quite difficult to read. It is better to [!java|scala|c]omit the curly braces for the <tt>else</tt> statements. Some languages even introduce a specific construct for these <tt>else if</tt>, but not [!thelang].[/!] [!python]change the sub-blocks using the <code>elif</code> keyword to mark explicitly these "else if" branches.[/!]
pt_br: Infelizmente, tal cascata de condicionais é bastante difícil de ler. É melhor [!java|scala|c]omitir as chaves para as assertivas <tt>else</tt>. Algumas linguagens até mesmo introduzem uma construção específica para estes <tt>else if</tt>, mas não [!thelang].[/!] [!python]mudar os sub-blocos usando a palavra-chave <code>elif</code> para marcar explicitamente estes ramos "else if".[/!]

source: [!c|java|scala]if (rainy()) { takeUmbrella(); } else if (hotDay()) { takeWater(); } else if (todayIsJuly4th()) { takeFlag(); }[/!][!python]if rainy(): takeUmbrella() elif hotDay(): takeWater() elif todayIsJuly4th(): takeFlag()[/!]
pt_br: [!c|java|scala]if (chuvoso()) { pegarGuardaChuva(); } else if (diaQuente()) { pegarAgua(); } else if (jogoDaCopa()) { pegarBandeira(); }[/!][!python]if chuvoso(): pegarGuardaChuva() elif diaQuente(): pegarAgua() elif jogoDaCopa(): pegarBandeira()[/!]

source: Graffiti in the Buggle World
pt_br: Grafitagem no mundo dos Buggles

source: Buggles can tag graffitis on the ground of their world. For that, they use the four following methods:
pt_br: Os buggles podem grafitar no chão de seu mundo. Para isto, use os quatro métodos seguintes:

source: <code>[!c]int[/!][!java]boolean[/!] isOverMessage()[!scala]:Boolean[/!]</code>: returns <code>[!c]1[/!][!java|scala]true[/!][!python]True[/!]</code> if and only if there is a message on the ground.
pt_br: <code>[!c]int[/!][!java]boolean[/!] estaSobreMensagem()[!scala]:Boolean[/!]</code>: returns <code>[!c]1[/!][!java|scala]true[/!][!python]True[/!]</code> se e somente se existe uma mensagem no chão.

source: <code>[!c]char*[/!][!java]String[/!] readMessage()[!scala]: String[/!]</code>: returns the message written on the ground (or an empty string if nothing is written).
pt_br: <code>[!c]char*[/!][!java]String[/!] lerMensagem()[!scala]: String[/!]</code>: retorna a mensagem lida no chão (ou uma string vazia se não há nada escrito ).

source: <code>[!java|c]void[/!] writeMessage([!c]char*[/!][!java]String [/!]msg[!scala]: String[/!])</code>: writes the specified message down on the ground. If there is already a message on the ground, the new content is added at the end of the existing message.
pt_br: <code>[!java|c]void[/!] escreverMensagem([!c]char*[/!][!java]String [/!]msg[!scala]: String[/!])</code>: escreve a mensagem especificada no chão. Se já existe uma mensagem no chão, a nova é adicionada no final da mensagem existente.

source: <code>[!java|c]void [/!]clearMessage()</code>: clears what is written on the ground.
pt_br: <code>[!java|c]void [/!]limparMensagem()</code>: limpa o que está escrito no chão.

source: The goal is then to organize a BDR game between the buggles by teaching them to move according to the instructions written on the ground. These instructions are messages written on the ground, with the following signification:
pt_br: O objetivo é então organizar um jogo de BDR entre os buggles ensinando eles a se mover de acordo com as instruções escritas no chão. Estas instruções são mensagens escritas no chão, com o seguinte significado:

source: Message
pt_br: Mensagem

source: What to do
pt_br: O que fazer

source: Mnemonic
pt_br: Mnemônico

source: Turn right and move one step forward
pt_br: Vire a direita (R de right) e mova um passo a frente

source: Right
pt_br: Direita
