Repository: BuggleInc/PLM
Catalog: l10n/missions/*.po
Languages: pt_br

source: It is not enough to sort the array to pass the exercises. Your solution must strictly follow the expected behavior of each exercise. This is enforced by checking that your algorithm needs the same amount of read and write operations to sort the array. When they don't match, understanding the difference between your code and the expected solution can reveal very difficult.
pt_br: É suficiente ordenar a array para resolver os exercícios. Sua solução deve seguir estritamente o comportamento esperado em cada exercício. Isto é reforçado verificando que seu algoritmo precisa da mesma quantidade de operações de leitura e escrita para ordenar a array. Quando estas quantidades não coincidem, compreender a diferença entre seu código e a solução esperada pode se mostrar bem difícil.

source: To help in this process, it is possible to graphically explore the history of your sorting algorithm. Switch to the Objective view and use the contextual menu (right click) to switch from the view of the current state to the view of its history.
pt_br: Para ajudar neste processo, é possível explorar graficamente o histórico do algoritmo de ordenação. Alternar para a visão Objetivo e usar o menu de contexto (clique com botão direito) para alternar da visão do estado atual para a visão do histórico.

source: The history view is a bit hairly at the first glance, but actually rather simple: The time flows from left to right on this graph, and each row is a cell of your array. The curved lines that go navigate between rows represent a given data value. When two lines cross, this means that two values were swapped at this time stamp; A line fork represent a value copy; When a value is magenta and followed by an interrogation mark (?), it was read using getValue(); If the value is red and followed with an exclamation point (!), it was written using setValue().
pt_br: A visão do histórico é um pouco bagunçada à primeira vista, mas na verdade é bem simples: o tempo anda da esquerda para a direita neste gráfico, e cada linha é uma célula de sua array. As linhas curvas que navegam entre linhas representam um certo valor de um dado. Quando duas linhas se cruzam, significa que dois valores foram alternados neste momento; uma bifurcação numa linha representa uma cópia de valor; quando um valor é magenta e seguido de uma interrogação (?), foi lido usando getValor(); Se o valor é vermelho e seguido de uma exclamação (!), foi escrito com setValor().

source: This view, inspired from Aldo Cortesi, reveals very helpful understand the inner behavior of sorting algorithms.
pt_br: Esta visão, inspirada por Aldo Cortesi, se mostra muito útil para entender o comportamento interno de algoritmos de ordenação.

source: Sorting Algorithms
pt_br: Algoritmos de Ordenação

source: This lesson allows to experiment with some classical sorting algorithms (and some less common variant of them). The goal is two fold: you can first better understand the idea of these algorithms by writing them yourself. But even if you don't code the algorithms, you can use the demo mode to organize "races" between these algorithms to experiment in practice what the different asymptotical complexity mean.
pt_br: Esta lição permite a experimentação com alguns algoritmos de ordenação clássicos (e algumas variações menos comuns deles). E temos um duplo objetivo: você pode primeiro compreender melhor a ideia destes algoritmos escrevendo eles por si só. Mas mesmo se você não codificar os algoritmos, você pode usar o modo de demonstração para organizar "corridas" entre os algoritmos para experimentar na prática o que significam diferentes complexidades assintóticas.

source: More exercises are planned for the future, on recursive sorting algorithms (such as QuickSort and MergeSort) or using other microworlds to apply these algorithms to other contexts.
pt_br: Mais exercícios estão previstos para o futuro, sobre os algoritmos de ordenação recursivos (como o QuickSort e o MergeSort) ou usando outros micromundos para aplicar estes algoritmos a outros contextos.

source: Other graphical representations could be proposed, such as the ones presented at <a href="http://sorting.at/">http://sorting.at/</a>.
pt_br: Outras representações gráficas podem ser propostas, como aquelas apresentadas em <a href="http://sorting.at/">http://sorting.at/</a>.

source: This lesson allows to experiment with some classical sorting algorithms (and some less common variant of them :)
pt_br: Esta lição permite a experimentação com alguns algotimos de ordenação clássicos (e algumas variantes menos comuns deles :)

source: You are supposed to master the bases of programming to take this lesson.
pt_br: Para fazer esta lição você deve dominar as bases da programação.

source: Welcome to the sorting universe. It allows you to experiment with the existing sorting algorithms. The list of buildins that you can use in your algorithms is available in the world reference documentation ("Help"-&gt;"About this world").
pt_br: Bem vindo ao universo da ordenação. Ele permite que você experimente os algoritmos de ordenação existentes. A lista de "buildins" que você pode usar nos seus algoritmos está disponível na documentação de referência do mundo ("Ajuda"-&gt;"Sobre este mundo").

source: It is not enough to sort the array to pass the exercises. Your solution must strictly follow the expected behavior of each exercise. This is enforced by checking that your algorithm needs the same amount of read and write operations to sort the array.
pt_br: Não é suficiente ordenar a array para passar nos exercícios. Sua solução deve seguir estritamente o comportamento esperado em cada exercício. Isto é reforçado verificando que seu algoritmo precisa da mesma quantidade de operações de escrita e leitura para ordenar a array.

source: When your algorithm diverges from the expectation, understanding the difference between your code and the expected solution can reveal very difficult. To help in this process, it is posible to graphically explore the history of your sorting algorithm. Switch to the Objective view and use the contextual menu (right click) to switch from the the view of the current state to the view of its history.
pt_br: Quando seu algoritmo divergge das expectativas, entender a diferença entre seu código e a solução esperada pode ser muito difícil. Para ajudar neste processo, é possível explorar graficamente a história de seu algoritmo de ordenação. Alterne para a visão Objetivo e use o menu contextual (clique com o botão direito) para alternar da visão do estado atual para a visão de seu histórico.

source: First attempt at BubbleSort
pt_br: Primeira tentativa no BubbleSort

source: This first sorting algorithm is the most simple one: Bubble sort consists in progressively moving up the smaller elements of the array, as if they were air bubbles moving up to the surface of a liquid. The algorithm traverse the array, and compare any pair of adjacent elements. If two adjacent elements are wrongly sorted, they are swapped. Once the array was completely traversed, the operation starts again from the beginning. When no elements were sorted after a full traversal, it means that the array is completely sorted: the algorithm can stop. Bubble sort is studied because of its simplicity, but it is almost never used in practice because of its bad performance (O(n^2) on average).
pt_br: O primeiro algoritmo de ordenação é o mais simples: Bubble sort consiste em progressivamente mover o menor elemento da array, como se fossem bolhas de ar subindo para a superfície de um líquido. O algoritmo percorre a array e compara qualquer par de elementos adjacentes. Se dois elementos adjacentes estiverem fora de ordem, eles são alternados. Quando a array estiver completamente percorrida, a operação começa de novo do começo. Quando nenhum elemento for ordenado após uma passagem completa, significa que a array está completamente ordenada: e o algoritmo pode parar. Bubble sort é estudado por causa da sua simplicidade, mas quase nunca é usado na prática por causa de seu baixo desempenho (O(n^2) em média).

source: Show Tip (Pseudo-code)
pt_br: Mostrar Dica (Pseudo-código)

source: The pseudo-code of the BubbleSort algorithm is the following:
pt_br: O pseudo-código do algoritmo BubbleSort é o seguinte:

source: do: For each i in [0,len-2] If cells i and i+1 must be swapped, do it while we swapped something during last traversal
pt_br: faça: Para cada i em [0,len-2] Se a célula i e i+1 devem ser alternadas, alterne enquanto algo foi alternado na última passagem

source: If you look carefully at the behavior of BubbleSort, a first easy optimization appears: after one traversal, the last element of the array must be the biggest of all since the traversal moved it up like a bubble to its position. More generally, after N traversal, we know that the N last elements of the array are already sorted. It is thus not necessary to compare them again during the subsequent traversals. For now, we will have as many traversal as there is in the array.
pt_br: Se você olhar atentamente para o comportamento do BubbleSort, uma primeira e fácil otimização aparece: depois de uma travesia, o último elemento da array é o maior de todos pois a travessia moveu ele para cima como uma bolha para a sua posição. Mais geralmente, depois de N travessias, sabemos que os últimos N elementos da array já estão ordenados. Portanto não é necessário compará-los de novo durante travessias subsequentes. Por agora, vamos ter tantas travessias quantos elementos na array.

source: The pseudo-code of the BubbleSort2 algorithm is the following:
pt_br: O pseudo-código do algoritmo BubbleSort2 é o seguinte:

source: For all i in [len-2,0] (traversing from biggest to smallest) For all j in [0, i] If cells j and j+1 must be swapped, do it
pt_br: Para todo i em [len-2,0] (percorrendo do maior para o menor) Para todo j em [0, i] Se células j e j+1 devem ser trocadas, troque

source: When we run this algorithm, it is quite disappointing to see that it runs approximately at the same speed than the basic version of BubbleSort. This is a graphical effect only since only value changes are graphically represented. Since this variation avoids some useless comparisons, it does exactly the same amount of swaps that the basic version. It is thus quite logical that the graphical interface draws this version at the same pace than the base version. But the statistics on the amount of reads show that we saved about the fourth of the amount of reads, which is not bad.
pt_br: Quando rodamos este algoritmo, é bastante desapontador ver que ele executa aproximadamente na mesma velocidade que a versão básica do BubbleSort. Isto é um elemento gráfico apenas já que apenas mudanças de valores são representadas graficamente. Como esta variação evita algumas comparações inúteis, ela faz exatamente a mesma quantidade de trocas que a versão básica. É portanto bastante lógico que a interface gráfica desenhe esta versão no mesmo ritmo que a versão básica. Mas as estatísticas da quantidade de leituras mostram que economizamos cerca de um quarto das leituras, o que não é nada mal.

source: From the asymptotic complexity point of view, there is absolutely no difference: this variation is still in O(n^2) on average (our gain is only on the constant term, ignored when computing the asymptotic complexity).
pt_br: Do ponto de vista da complexidade asimtótica, não existe nenhuma diferença: Esta variação ainda é O(n^2) no caso médio (nosso ganho é apenas no termo constante, ignorado quando se está calculando a complexidade asimtótica).

source: Let's now reintroduce the little optimization we removed at previous step: if a traversal does not swap any element, it means that the array is already sorted. In that case, we want to stop the whole sorting process.
pt_br: Vamos agora reintroduzir a pequena otimização que fizemos no passo anterior: se uma passagem não troca nenhum elemento, significa que a array já está ordenada. Neste caso, vamos parar todo o processo de ordenação.

source: [!java|python|c]For that, simply use the <code>break</code> keyword, which breaks the current loop. Beware, if you have several nested loops, this will apply to the internal one.[/!] [!scala]For that, simply quit the current function by calling <code>return</code> with no associated value.[/!]
pt_br: [!java|python|c]Para isto, simplesmente use a palavra-chave <code>break</code>, que interrompe o loop atual. Cuidado, se você tem vários loops aninhados, isto só vai ter efeito no mais interno.[/!] [!scala]Para isto, simplesmente saia da função atual chamando <code>return</code> sem nenhum valor associado.[/!]

source: If you want, this tip shows the pseudo-code.
pt_br: Se você quiser, esta dica mostra o pseudo-código.

source: For all i in [len-2,0] (traversing from biggest to smallest) For all j in [0, i] If cells j and j+1 must be swapped, do it If traversal on j did not swap anything, break the for loop
pt_br: para todo i em [len-2,0] (percorrendo do maior para o menor) Para todo j em [0, i] Se células j e j+1 devem ser trocadas, troque Se ao percorrer j não fez nenhuma troca, pare o loop

source: This optimization is even more disappointing: it only provide a gain of a few percents on the amount of reads over BubbleSort2.
pt_br: Esta otimização é ainda mais desapontadora: ela só dá um ganho de alguns porcento sobre o BubbleSort2 no total de leituras.

source: To improve further the BubbleSort algorithm, we need to look closer its behavior. One can notice that big elements are moved very quickly in position while small ones move very slowly to their destination. They are thus traditionally referred to as "rabbits" and "turtles" respectively for big fast values and small slow ones.
pt_br: Para melhorar ainda mais o algoritmo BubbleSort, precisamos ver seu comportamente bem de perto. Você pode perceber que os elementos grandes se movem bem rápido enquanto os pequenos se movem lentamente para seus destinos. Eles são então tradicionalmente chamados de "coelhos" e "tartarugas" respectivamente para valores grandes e rápidos e valores pequenos e lentos.

source: To help the turtles moving faster, the cocktail sort traverse alternatively the array from right to left and from left to right. Here is the pseudo-code:
pt_br: Para ajudar as tartarugas a se mover rápido, o cocktail sort percorre alternativamente a array da direita para a esquerda e da esquerda para a direita. Aqui está o pseudo-código:

source: One can see that cocktail sort achieves exactly the same amount of swaps than the bubble sort, but improves slightly on read amount. It is however still worse than BubbleSort2 to that extend.
pt_br: Podemos perceber que cocktail sort alcança exatamente a mesma quantidade de trocas que o bubble sort, mas melhora levemente na quantidade de leituras. Entretanto, ele é ainda pior que o BubbleSort2 neste assunto.

source: We will now apply to CocktailSort the same optimization than BubbleSort2 did to BubbleSort. We must remember the limits of the array part not being sorted yet, and traverse it alternatively from left to right and from right to left:
pt_br: Vamos agora aplicar ao CocktailSort a mesma otimização que o BubbleSort2 faz no BubbleSort. Devemos lembrar que os limites da parte do array que não está ordenada ainda, e percorrer ela alternativamente da esquerda para a direita e da diretia para a esquerda:

source: CocktailSort (take 3)
pt_br: CocktailSort (3o tempo)

source: Even if the asymptotic complexity of CocktailSort2 is the same than the one of BubbleSort, it seem to perform better in practice. It is even possible to improve a bit further by stopping it if the first traversal didn't found anything to swap, without achieving the downwards traversal. Likewise, we can stop if the upward traversal found something to swap, but not the downwards one.
pt_br: Mesmo se a complexidade assintótica de CocktailSort2 for a mesma do BubbleSort, Ele parece melhor na prática. É até mesmo possível melhorar um pouco mais parando ele na primeira rodada que não encontrar nada para alternar, se realizar a rodada para baixo. Da mesma forma, podemos parar se a rodada para cima encontrar algo para alternar mas a rodada para baixo não.

source: This sorting algorithm is quite simple to understand and write, even if it is not as efficient as possible. Its asymptotic complexity is in O(n2), but it is more efficient in practice (linear in best case, ie when the array is already sorted, and N2/4 on average).
pt_br: Este algoritmo de ordenação é muito simples de entender e escrever, mesmo se não for o mais eficiente possível. Sua complexidade assintótica é O(n2), mas ele é mais eficiente na prática (linear no melhor caso, ie quando a array já está ordenada, e N2/4 no caso médio).

source: The idea is to traverse all elements of the array, and to insert each of them into its proper position in the already sorted part of the array. When we look at an element x, the situation is the following: any elements to the left of the array are already sorted, and we have to insert x at its position in the array.
pt_br: A ideia é percorrer todos os elementos da array, e inserir cada um deles em sua posição correta numa parte já ordenada da array. Quando nós olhamos para um elemento x, a situação é a seguinte: qualquer elemento da esquerda da array já está ordenado, e temos que inserir x na sua posição na array.

source: Once this is done, the situation is the following:
pt_br: Uma vez isto feito, a situação é a seguinte:

source: The pseudo-code of this algorithm is thus the following:
pt_br: O pseudo-código deste algoritmo é então o seguinte:

source: Naturally, you should use a loop to write the big permutation within the given loop. Writing it this way would be really ... counter-productive.
pt_br: Naturalmente, você deve usar um loop para escrever a grande permutação dentro do loop. Escrever ela desta forma deve ser na verdade ... improdutivo.

source: If you've always wondered what computer science researchers do nowadays, here is part of the answer: They improve fundamental algorithms so that others can write efficient programs.
pt_br: Se você já se perguntou o que cientistas da computação fazem nos dias de hoje, aqui está uma parte da resposta: Eles melhoram algoritmos fundamentais para que outras pessoas possam escrever programas eficientes.

source: Other variation of insertion sort
pt_br: Outra variação do insertion sort

source: TreeSort builds a binary search tree to sort them. It leads to a O(n log(n)) on average, but O(n^2) in worst cases. We won't study this algorithm here since understanding its behavior requires to know what a binary tree is, what is beyond our present goals.
pt_br: TreeSort constrói uma árvore de busca binária para ordená-la. Ele consegue O(n log(n)) no caso médio, mas O(n^2) nos piores casos. Não vamos estudar este algoritmo aqui pois para entendê-lo temos que entender o que uma árvore binária é, o que está além de nossos objetivos atuais.

source: There is other variations over the insertion sort, such as PatienceSort which builds piles of values and sort each pile afterward. This algorithm presents a 0(n log(n)) timing worst case and a 0(n) space complexity. LibrarySort (proposed in 2004) also trades a bit space in exchange for time since it provide a time complexity of O(n log(n)) but needs to store some more data.
pt_br: Existem variações do insertion sort, tais como o PatienceSort que constrói pilhas de valores e ordena cada pilha depois. Este algoritmo apresenta um tempo 0(n log(n)) no pior caso e uma complexidade de espaço de 0(n). LibrarySort (proposto em 2004) também troca um pouco de espaço por tempo já que tem uma complexidade de tempo de O(n log(n)) mas precisa armazenar um pouco mais de dados.

source: Wikipedia provides a detailled description of all these algorithms we cannot present here because of time constraints.
pt_br: A Wikipédia fornece uma descrição detalhada de cada um destes algoritmos que não apresentamos aqui devido a limitações de tempo.

source: This algorithm is named after its author, Donald Shell, who published it in 1959. It can be seen as an application of the CombSort idea (let elements having a long path to travel take shortcuts) to the insertion sort (CombSort is a variation of BubbleSort). Instead of comparing adjacent values during the insertion sort, it compares values separated by a bigger gap. The bigger the gap, the faster the elements are moved to their final destination, but also the less precise is this move. It is thus mandatory to apply the algorithm with a serie of decreasing gaps. At the last step, when the gap is one, InsertionSort is used, but onto an array which is almost already sorted by previous steps.
pt_br: Este algoritmo é batizado em homenagem a seu autor, Donald Shell, que o publicou em 1959. Ele pode ser visto como uma aplicação da ideia do CombSort (faça com que elementos que tem um longo caminho pegarem atalhos) ao insertion sort (CombSort é uma variação do BubbleSort). Ao invés de comparar valores adjacentes durante o insertion sort, ele compara valores separados por um intervalo maior. Quanto maior o intervalo, mais rápido os elementos se movem para seu destino final, mas também menos preciso fica o movimento. É portanto essencial que o algoritmo vá sendo aplicado numa série de intervalos cada vez menor. No último passo, quando o intervalo for 1, o InsertionSort será usado, mas numa array que estará praticamente ordenada pelos passos anteriores.

source: Donald Shell propose <code>len/2</code> as initial value of the gap, and then to divide it by 2 at each step. The pseudo-code is thus the following:
pt_br: Donald Shell propôs <code>len/2</code> como o valor inicial do intervalo, e ir dividindo por 2 a cada passo. O pseudo-código é o seguinte:

source: Just like in CombSort, the sequence of values taken by the gap is crucial for Shell sort performance. In some rare pathological cases, the sequence we used above can lead to a O(n^2) performance. Other sequences were proposed: the Hibbard's increments of 2k − 1 lead to a complexity of O(n^(3/2)) in worst cases. Pratt's increments 2^i3^j lead to a O(nlog(n)log(n) performance in worst cases. The existance of a sequence leading to a O(n log(n)) was precluded by Poonen, Plaxton, and Suel. Thanks to this performance, ShellSort is a valid candidate for array of several hundred thousands when correctly implemented.
pt_br: Assim como no CombSort, a sequência de valores pega pelo intervalo é crucial para a performance do Shell sort. Em alguns casos patológicos raros, a sequência que usamos pode levar a uma performance O(n^2). Outras sequências foram propostas: os incrementos de Hibbard de 2k − 1 levam a uma complexidade de O(n^(3/2)) em casos ruins. incrementos de Pratt 2^i3^j levam a uma performance de O(nlog(n)log(n) nos piores casos. A existência de uma sequência levando a O(n log(n)) foi excluída por Poonen, Plaxton e Suel. Graças a esta performance, ShellSort é um candidato válido para arrays de várias centenas de milhares quando corretamente implementado.

source: In our case, the array are ways too small to benefit of these optimizations. If you ever need to do so, take as initial gap the biggest value of the targeted serie still smaller than the array size, and then use decreasing values of the serie.
pt_br: No nosso caso, a array é pequena demais para se beneficiar destas otimizações. Se você ainda assim quiser, tome o intervalo inicial como o maior valor da série alvo ainda menor que o tamanho do array, e então use valores decrescentes da série.
