Repository: BuggleInc/PLM
Catalog: lib/l10n/*.po
Languages: fr

source: More information on Langton's ant
fr: Plus d'informations sur la fourmi de Langton

source: As you can see from the execution of this exercise, the interest in this algorithm is that after about 10000 steps of relative chaotic behavior, the ant start building a regular pattern. This emergence of a regular pattern from the chaos is rather fascinating, isn't it?
fr: Comme vous pouvez le constater avec l'exécution de cet exercice, l'intérêt dans cet algorithme est qu'après environ 10 000 pas de comportement relativement chaotique, la fourmi commence à suivre un schéma régulier. L'émergence de ce schéma régulier à partir du chaos est réellement fascinant, n'est-ce pas ?

source: This mechanism were invented in 1986 by Chris Langton, and later generalized in several ways (as we shall see in the next exercises). It was proven in 2000 that the ant's trajectory can be used to compute any boolean circuit, and thus that the ant is capable of universal computation (ie, any possible computation can be achieved using the ant as a computing device). Yet another subject of fascination...
fr: Ce mécanisme a été inventé en 1986 par Chris Langton, et généralisé après de plusieures façons (comme nous le verrons dans les prochains exercices). Il a été prouvé en 2000 que la trajectoire de la fourmi peut être utilisée pour calculer n'importe quel circuit booléen, et que la fourmi est capable de calcul universel ( ie, n'importe quel calcul possible peut être réalisé en utilisant la fourmi comme instrument de calcul). Encore un autre sujet de fascination...

source: Check the corresponding wikipedia web page, of which this exercise is inspired, for further details.
fr: Consultez la page correspondante sur Wikipedia, à partir de laquelle cet exercice est inspiré, pour d'avantages de détails.

source: Multicolor Langton's ant
fr: La fourmi de Langton multicolore

source: There is several ways to extend the concept of Langton's ant. In this exercise, we explore first one, using more than two colors. It remains very similar to the base case: the behavior at each step still depends on the ground color, but you have more than 2 possibilities. It allows to have more than one kind of ant, depending on what you decide to do for each color. For example, the ant LRL takes 3 colors. It turns left on the first color, right on the second one and left on the third color. According to this definition, the basic ant is a RL (since it turns right on white cells and left on black ones).
fr: Il y a plusieures façons de changer le concept de la fourmi de Langton. Dans cet exercice, nous allons tout d'abord étudier le fait d'utiliser plus de deux couleurs. Cela reste très similaire au cas de base : le comportement à chaque pas dépendra toujours de la couleur du sol, mais vous aurez plus de deux possibilitées. Cela permet d'avoir plus qu'une seule sorte de fourmi, selon ce que l'on décide de faire pour chaque couleur. Par exemple, la fourmi LRL reconnait trois couleurs. Elle tourne à gauche sur la première, à droite sur la seconde et à gauche sur la troisième. Selon cette définition, la fourmi de base est de type RL ( puisqu'elle tourne à droite sur les cases blanches et à gauche sur les noires).

source: Some of these ants draw fascinating patterns (switch the world to see them): LLRR build a symmetric figure resembling loosely to a ball, LRRRRRLLR draws a square, LLRRRLRLRLLR draws a convoluted regular pattern after a period of seemingly chaotic behavior, and RRLLLRLLLRRR seems to fill a hour glass...
fr: Certaines de ces fourmis dessinent des schémas fascinants ( changez de monde pour les voir ):LLRR construit une figure symétrique ressemblant vaguement à une balle. LRRRRRLLR dessine un carré, LLRRRLRLRLLR dessine un schéma régulier tordu après une période ressemblant à un comportement chaotique, et RRLLLRLLLRRR semble remplir un sablier...

source: Changing your buggle into a generic Langton's ant is not very complicated, although it is not completely trivial. As previously, you have to write a <code>step</code> function. But this time, it receives two arrays as parameters. The first one defines the rules to follow depending on the ground color while the second one gives the sequence of colors to use. For example, the basic ant would have <code>{'R', 'L'}</code> and <code>{Color.white, Color.black}</code> as arguments.
fr: Métamorphoser votre buggle en une fourmi de Langton générique n'est pas très compliqué, même si ce n'est pas complètement trivial. Comme précédemment, vous avez à écrire une fonction <code>step</code>. Mais cette fois, elle reçoit deux tableaux comme paramètres. Le premier définit les règles à suivre selon la couleur du sol tandis que le deuxième done la séquence de couleur à utiliser. Par exemple, la fourmi de base aurait <code>{'R', 'L'}</code> et <code>{Color.white, Color.black}</code> comme arguments.

source: At each step, you thus have to apply the following pseudo-code:
fr: A chaque pas, vous avez toujours à appliquer le pseudo-code suivant :

source: Find the position of the ground color in the color sequence;
fr: Trouver la position de la couleur du sol dans la séquence de couleur;

source: Turn left or right depending on the content of the rule array at that position;
fr: Tourner à gauche ou à droite selon le contenu du tableau de règle à cette position;

source: Mark the current ground with the next color in the sequence (the last color being followed by the first one);
fr: Marquer le sol de la case courante avec la prochaine couleur dans la séquence ( la dernière couleur est suivie par la première);

source: Move forward by one step.
fr: Avancer d'un pas

source: You now should have enough information to succeed.
fr: Vous devriez maintenant avoir assez d'informations pour réussir.

source: Bibliographical notes
fr: Notes bibliographiques

source: According to wikipedia, multicolor Langton's ants were discovered in 1995 by Propp et Al. Another funny fact is that the ants which name is a list of consecutive pair of identical letters (LL and RR) produce symmetric patterns. This fact was even formally proved.
fr: Selon Wikipedia, les fourmis de Langton multicolores ont été découvertes en 1995 par Propp et Al. Un autre fait amusant est que les fourmis dont le nom est une paire de lettres identiques (LL et RR) produisent des dessins symétriques. Ce fait a même été prouvré formellement.

source: This exercise explores a new way to extend the concept of Langton's ant. Now, the behavior of the ant not only depends on the color on the ground, but also on its internal state (represented by an integer value). The idea of changing the ant into such an automata naturally comes from the Turing machine concept. This explains the name of these new animals, which is a portemanteau of <i>Turing</i> and <i>Termite</i> (if you don't know what a Turing machine is, you should run to wikipedia, because it is simply impossible to be a real computer scientist before that).
fr: Cette exercice explore une nouvelle façon d'étendre le concept de la fourmi de Langton. Maintenant, le comportement de la fourmi ne dépend plus seulement de la couleur du sol, mais aussi de son état interne ( représenté par une valeur entière ). L'idée de changer la fourmi en un automate découle naturellement du concept de la machine de Turing. Ceci explique le nom de ces nouveaux animaux, qui est un mélange de <i>Turing</i> et de <i>Termite</i> ( si vous ne savez pas ce qu'est une machine de Turing, vous devriez vous jeter sur Wikipedia parce qu'il est tout simplement impossible d'être un vrai informaticien sans le savoir).

source: Once again, you just have to write the <code>step()</code> method, in charge of doing one turmite's step. Once again, you should first find the rank of the current's cell ground color in the color sequence. The <code>colors</code> array is not passed as parameter but declared as global variable. It shouldn't change anything for us since this array was never modified during the execution. This trick to pass constant parameters is not very clean, but it should help performance a bit.
fr: Encore une fois, vous avez seulement à écrire la méthode <code>step()</code>, dont le but est de réaliser un pas de turmite. Encore une fois, vous devez tout d'abord trouver la rang de la couleur de la case actuelle dans la séquence de couleur. Le tableau <code>colors</code> n'est pas passé en tant que paramètre mais est déclaré comme une variable globale. Cela ne devrait rien changer pour nous pouisque ce tableau n'a jamais été modifié pendant l'exécution. Cette astuce pour passer des paramètres constants n'est pas très propre, mais cela devrait améliorer un peu les performances.

source: The second step is to use the <code>rule</code> data depending on the current color and the current state. <code>rule</code> actually contains 3 information in each situation: the color to write, the move to do, and the next state value. For example, rule[1][0] contains the informations to use when <code>state==1</code> and <code>color==0</code>. In other worlds, you can retrieve the information relative to your current situation by using <code>rule[state][currentColor]</code>.
fr: La deuxième étape est d'utiliser la donnée <code>rule</code> selon la couleur actuelle et l'état courant. <code>rule</code> contient en fait trois informations dans chaque situation : la couleur à mettre, le mouvement à effectuer, et la valeur du prochain état. Par exemple, rule[1][0] contient l'information à utiliser quand <code>state==1</code> et <code>color==0</code>. En d'autres mots, vous pouvez récupérer l'information relative à votre situation actuelle en utilisant <code>rule[etatCourant][couleurActuelle]</code>

source: Each such information set contains 3 values. The first one is the rank of the color to write on the ground. The second is the move to do, with the following notation: 0=stop, 1=noturn, 2=right, 4=u-turn, 8=left. Note that if the command is stop, you shouldn't even move forward on that step (but you shouldn't stop your program either: the next steps can do something else). Finally, the third integer is the next <code>state</code> value to go into after this iteration.
fr: Chaque ensemble d'informations contient trois valeurs. La première est le rang de la couleur à mettre sur le sol. La deuxième est le mouvement à effectuer, avec la notation suivante : 0=stop, 1=pas de virage, 2=droite, 4=demi-tour, 8=gauche. Veuillez noter que si l'instruction est stop, vous ne devez même pas avancer sur cette étape ( mais vous ne devez pas arrêter votre programme pour autant : les prochains pas peuvent faire quelquechose d'autre). Finalement, le troisième entier est la valeur du prochain <code>state</code> à avoir après cette itération.

source: Since these arbitrary notations are somehow difficult to remember, the template code defines a set of constants that you should use instead of the direct numerical values. Their names are NOTURN, LEFT, RIGHT and so on. The modifiers <code>final static</code> before their type is the way to mark variables as constant in Java (sorry if the notation seems complex). Using such constants greatly help making the code easier to read, since
fr: Puisque ces notations arbitraires sont parfois difficiles à se souvenir, le code fourni définit un ensemble de constantes que vous pouvez utiliser à la place des valeurs numériques. Leurs noms sont LEFT, RIGHT, etc. Le modifieur <code>final static</code> avant leur type est la façon d'indiquer les variables comme constantes en Java ( nous nous excusons si la notation semble complexe ). Utiliser de telles constantes rend le code beaucoup plus simple à lire, puisque

source: is much more easier to read than
fr: est beaucoup plus simple à lire que

source: According to wikipedia, turmites were invented independently by the end of the eighties. It has been shown that turmites in general are exactly equivalent in power to one-dimensional Turing machines with an infinite tape, as either can simulate the other. This means that absolutely any program that you can think of could theoretically be computed on this device...
fr: D'après Wikipedia, les turmites ont été inventés indépendamment à la fin des années 80. Il a été démontré que les turmites en général sont exactement équivalent en terme de puissance à des machines de Turing à une dimension avec un ruban infini, et peut donc simuler les autres. Cela signifie qu'absolument tous les programmes auxquels vous pouvez penser peuvent théoriquement être calculé sur cet outil.

source: Creating Turmites
fr: Créer des Turmites

source: This exercise allows you to build your own turmites. To pass the exercise, you should simply write a <code>init()</code> method which initializes the <code>rule</code> to use the following transitions table (from wikipedia), set the buggle initial position at (8;33), and ask for 8342 steps.
fr: Cet exercice vous permet de construire vos propres turmites. Pour réussir cet exercice, vous devez simplement écrire une méthode <code>init()</code> qui initialise <code>rule</code> pour utiliser les tables de transitions suivantes ( de Wikipedia ), met la position initiale du buggle à (8;33), et demande de faire 8342 pas.

source: Current color
fr: Couleur actuelle

source: Write color
fr: Couleur à mettre

source: Turn
fr: Virage

source: Next state
fr: État suivant

source: Current state
fr: État courant

source: where the direction to turn is one of <b>L</b> (90° left), <b>R</b> (90° right), <b>N</b> (no turn) and <b>U</b> (180° U-turn).
fr: Où les virages à effectuer sont <b>L</b> (90° vers la gauche -- left), <b>R</b> (90° vers la droite -- right), <b>N</b> (rien -- no turn), <b>U</b> (demi tour de 180° -- U-turn).

source: Going further
fr: Aller plus loin

source: This exercise is naturally an excuse to let you experiment with your own turmites. Feel free to change the transition table and the amount of steps to experiment by yourself. To that extend, you may find the Ed Pegg Jr's library useful. If you find new interesting patterns, send them per email so that we can integrate them to this list!
fr: Cet exercice est naturellement une excuse pour vous laisser expérimenter vos propres turmites. Vous êtes libres de changer la table de transition et le nombre de pas pour expérimenter par vous-même. A ce propos, vous pouvez trouver la bibliothèque Ed Pegg Jr's utile. Si vous trouvez de nouveaux schémas intéressants, envoyez-les nous pas email afin que nous les puissions les ajouter à cette liste.

source: In addition, wikipedia is desperately missing some good looking colorful turmites: only black and white ones are depicted. You should consider submitting your creations directly to the free encyclopedia.
fr: De plus, Wikipedia manque désespérement de quelques beaux et colorés turmites: seuls des noirs et blancs sont décrits. Vous pouvez considérer l'idée de soumettre vos créations directement à l'encyclopédie libre.

source: Langton's ants may not share the expressiveness power of the turmites, but they remain fascinating too. You can experiment with them using the initLangton() method, provided in your template, that allows to build a Turmite transition table from a Langton's ant name. Tiny changes in the ant may result huge changes. For example, "RRL" does not seem to lead to any constructed pattern, even after a million steps, but "RLL" starts building a very simple highway pattern after less than 100 steps!
fr: Les fourmis de Langton ne partagent peut être pas la capacité d'expression des turmites, mais elles restent fascinantes elles aussi. Vous pouvez expérimenter avec elles en utilisant la méthode initLangton(), fournie dans le code de base, qui vous permet de construire une table de transition pour Turmite a partir du nom d'une fourmi de Langton. De petits changements peuvent engendrer de grandes choses. Par exemple, "RRL" ne semble pas mener à un quelconque schéma, même après un million de pas, mais "RLL" commence à construire un dessin très simple de route au bout de moins de 100 pas !

source: Quite a lot of Langton's ants build highways: RL, of course, but also RLRLRLLRLR (about 2500 steps). The chaotic behavior of ants before the highway can be very short (as with RLL that only need 100 steps to converge) or very long, as with LLLLLLRRLRRR which seems chaotic for more than 500,000 steps before build the highway or even RRLLLRRRLRRR which needs 1170000 to start converging. Some are narrow, and others are very large, such as RRLRLLRLRR (200,000 steps). This ant is also notable since it is somehow squarish even before the highway start where most others do not show anything notable before their highway.
fr: Beaucoup de fourmis de Langton construisent des routes: RL, bien entendu, mais aussi RLRLRLLRLR ( environ 2500 pas ). Le comportement chaotique des fourmis avant la route peut être très court ( comme avec RLL qui a seulement besoin de 100 pas pour converger ) ou très long, comme avec LLLLLLRRLRRR qui semble chaotique jusqu'à plus de 500 000 pas avant de constuire la route ou encore RRLLLRRRLRRR qui nécessite 1 170 000 pour commencer à converger. Certaines sont étroites, d'autres très larges, comme avec RRLRLLRLRR (200 000 pas). Cette fourmi est aussi notable puisque c'est quelque peu carré avant même que la route commence, là où d'autres ne montrent rien de transcendant avant leur route.

source: Some ants fill solid sectors, such as RRLLLRLLLRRR (16,000 steps), RRLLLRLLLRRR (30,000 steps), RRLLLRRRRRLR (125,000 steps) or RRLRLLRRRRRR (20,000 steps). Some even fill the whole space (RRLRR after 3000 steps). Some of my personal favorite ones are the ones where the ant seem to be bouncing within a box that gets bigger on each bump, such as LRRRRRLLR (30,000 steps). LRRRRLLLRRR is even more impressing since the bounces within the box are regular and since it converges more rapidly to its stable behavior (15,000 steps are enough).
fr: Certaines fourmis remplissent des secteurs entiers, comme avec RRLLLRLLLRRR (16 000 pas), RRLLLRLLLRRR (30 000 pas), RRLLLRRRRRLR (125 000 pas) ou RRLRLLRRRRRR (20 000 pas). D'autres encore remplissent tout l'espace (RRLRR après 3000 pas). Certaines de mes favorites sont celles où la fourmi semble rebondir dans une boite qui devient plus grande à chaque rebond, comme avec LRRRRRLLR (30 000 pas). LRRRRLLLRRR est encore plus impressionnant puisque les rebonds dans la boite sont réguliers et puisque la fourmi atteint rapidement son comportement stable (15 000 pas suffisent).

source: Finally, some ants are just build artistic patterns. You should check this video for some beautiful ones: http://www.youtube.com/watch?v=1X-gtr4pEBU. If you want to convert them into your code, you have to shift them by one: For example, the one depicted at 3:42 is not RRLRLRLLRL, but RLRLRLLRLR (the first visible move should be read as last one).
fr: Enfin, certaines fourmis construisent juste des schémas artistiques. Vous devriez regarder cette vidéo pour un bel aperçu : http://www.youtube.com/watch?v=1X-gtr4pEBU . Si vous voulez les implémenter dans votre code, vous devez les permutter de un : Par exemple, celle décrite à 3:42 n'est pas RRLRLRLLRL, mais RLRLRLLRLR (le premier mouvement visible doit être vu comme le dernier).

source: As you can see by exploring the above set of turmites, they are usually not as colorful as the ants, but this may be because very few colors suffice to exhibit complex behaviors. For example, there is a specific class of turmites called <i>busy beavers</i> which are turmites that write a lot of things before stopping (busy beavers are usually classical turing machines, but the idea fits perfectly to turmites too). There is a sort of international competition where people strive to find the turmite that covers the biggest area before stopping. The web page is here: http://code.google.com/p/ruletablerepository/wiki/TwoDimensionalTuringMachines
fr: Comme vous pouvez le constater en explorant l'ensemble ci-dessus de turmites, elles ne sont généralement pas aussi colorées que les fourmis, mais c'est peut-être car très peu de couleurs sont nécessaires pour expliciter des comportements complexes. Par exemple, il y a un classe spécifique de turmites appelée <i>busy beavers</i> qui sont des turmites qui écrivent énormément de choses avant de s'arrêter ( les <i>busy beavers</i> sont généralement des machines de Turing classiques, mais l'idée correpond parfaitement aux turmites). Il y a une sorte de compétition internationale où les participants font tout leur possible pour trouver le turmite qui couvre la plus grande surface avant de s'arrêter. La page web est ici : http://code.google.com/p/ruletablerepository/wiki/TwoDimensionalTuringMachines

source: Sorting Algorithms
fr: Algorithmes de tri

source: This lesson allows to experiment with some classical sorting algorithms (and some less common variant of them). The goal is two fold: you can first better understand the idea of these algorithms by writing them yourself. But even if you don't code the algorithms, you can use the demo mode to organize "races" between these algorithms to experiment in practice what the different asymptotical complexity mean.
fr: Cette leçon vous permet d'expérimenter avec les algorithmes de tri classiques (et certaines optimisations moins courantes de ceux-ci). L'objectif est double: il s'agit tout d'abord de mieux comprendre le principe de ces algorithmes en les codant vous-même. Mais même si vous ne codez pas les algorithmes, vous pouvez utiliser le mode démo pour organiser des "courses" entre ces algorithmes afin d'expérimenter en pratique ce qu'implique la différence de complexité asymptotique entre deux algorithmes.

source: An exercise on recursive sorting algorithms (such as QuickSort and MergeSort) is planned for the future.
fr: Un exercice sur les tris récursifs (en particulier QuickSort et MergeSort) est prévu à l'avenir.

source: BubbleSort and variations
fr: Le tri à bulle et variantes

source: Welcome to the sorting world. It allows you to experiment with the existing sorting algorithms. The list of buildins that you can use in your algorithms is available in the world reference documentation ("Help"-&gt;"About this world").
fr: Bienvenu au monde des tris. Il permet d'expérimenter avec les algorithmes de tri existants. La liste des primitives que vous pouvez utiliser dans vos programmes est disponible dans la documentation de référence du monde ("Help" -&gt; "About this world").
