Repository: BuggleInc/PLM
Catalog: lib/l10n/*.po
Languages: fr

source: For now, it contains a Backtracking exercise which lacks a graphical representation to be usable. It is based on an entity KnapsackSolver which works on a KnapsackPartialSolution. This latter is not a World, but a passive world component. It is used by the solver to store the currently best solution and the working solution. This design should be rather generic and other backtracking problems, such as the ones used in my TOP teaching (pyramid, recipients) should be implmentable following this design. That is why Backtracking classes derive from generic ones: BacktrackingEntity and BacktrackingPartialSolution. There is also a BacktrackingWorld, that specific universes should need to not override, and BacktrackingExercise, dealing with this specificity where the world does not only contain solving entities, but also two partial solutions (best know and current).
fr: A l'heure actuelle, cela contient un exercice sur le Backtracking qui a besoin d'une représentation graphique pour être utilisable. Cet exercice est base sur une entité KnapsackSolver qui travaille sur une KnapsackPartialSolution. Ce dernier n'est pas un World, mais un composant passif du monde. Il est utilisé par le solver pour sauvegarder la meilleure solution actuelle et la solution courante. Le design devrait être assez générique et d'autres problèmes de backtracking, tels que ceux utilisés dans mes enseignements de TOP (pyramides, récipients ) devraient être implémentables en copiant ce design. C'est pourquoi les classes Backtracking dérivent d'une classe générique: BacktrackingEntity et BacktrackingPartialSolution. Il y a aussi un BacktrackingWorld; que les univers spécifiques ne doivent en aucun cas surchargé; et BacktrackingExercise, gérant cette spécificité où le monde ne contient pas seulement des entités solveuses, mais aussi deux solutions partielles ( meilleur connue et actuelle ).

source: This exercise should be introduced by an interactive discovery activity such as the one used here: http://interstices.info/jcms/c_19213/le-probleme-du-sac-a-dos
fr: Cet exercice devrait être introduit par une activité de découverte interactive comme celle qui est utilisée ici : http://interstices.info/jcms/c_19213/le-probleme-du-sac-a-dos

source: Although this exercise seems almost usable, there is a fundamental difficulty to solve in the visualization. It is envisionned that the call graph is used here, to help the students building their mental representation of recursion. The actual representation of the graph should be quite easy, thanks to the jung library. But I fail to see how to get the needed info so far. Adding sensors to the stepUI() method is probably the best way to go, but I would need to inspect the complete call stack where Thread.currentThread().getStack() only give the static stack (method called, file location, etc). I think I need to inspect the parameters passed to each method call to rebuild the proper call tree.
fr: Même si cet exercice semble presque utilisable, il y a une difficulté fondamentale à résoudre dans la visualisation. Il a été imaginé que le "call grap" est utilisé ici pour aider les étudiants à construire leur propre représentation mentale de la récursion. La représentation actuelle du graphe devrait être assez simple, graêce à la bibliothèque "jung". Mais j'ai échoué jusqu'à présent à trouver comment obtenir les informations nécessaires. Ajouter des capteurs à la méthode sterUI() est probablement la meilleur façon de procéder, mais j'aurai besoin d'inspecter la pile d'appel en entier alors que Thread.currentThread().getStack() ne fournit que la pile statique ( méthodes appelées, locations des fichiers, etc ). Je pense que j'ai besoin d'inspecter les paramètres passés à chaque appel de méthode pour reconstruire le bon arbre d'appel.

source: The first thing that I tried to use was dtrace, but it seems non-portable and somehow linked to solaris so I didn't dig any further.
fr: La première chose que j'ai essayé d'utiliser fut dtrave, mais il semble non portable et en quelquesort lié à solaris donc je n'ai pas plus creusé dans cette direction.

source: Then, I tried to use the debugging infrastructure (JPDA), but never managed to get it working. It seems to me that the original com.sun.jdi package is somehow deprecated since com.sun.jdi.BootStrap.virtualMachineManager() returns null while org.eclipse.jdi.Bootstrap.virtualMachineManager() does not. But when I'm using the eclipse version, it seem to take an endless amount of dependencies, which I'm not inclined to do. The root of my problem may be that I was using a jdi.jar comming from eclipse, but I didn' find any other. I just realised that the com.sun.jdi package is also implemented in /usr/lib/jvm/java-6-sun-1.6.0.26/lib/tools.jar on my disk. It seem to be functional, I should give it another spin.
fr: Ensuite, j'ai essayé d'utiliser l'infrastructure de débuggage (JPDA), mais je ne suis jamais parvenu à la faire fonctionner. J'ai l'impression que le package com.sun.jdi original est en quelque sorte déprécié puisque com.sun.jdi.BootStrap.virtualMachineManager() renvoie null tandis que org.eclipse.jdi.Bootstrap.virtualMachineManager() ne le fait pas. Mais quand j'utilise la version d'eclipse, il semble nécessiter un nombre infini de dépendances, que je ne suis pas enclin à installer. La cause de mon problème pourrait être que j'utilisais un jdr.jar venant d'eclipse, mais je n'en ai pas trouvé d'autres. Je viens juste de réaliser que le package com.sun.jdi est aussi disponible dans /usr/lib/jvm/java-6-sun-1.6.0.26/lib/tools.jar sur mon disque. Il a l'air fonctionnel , je devrais essayer à nouveau.

source: Afterward, I tried to reuse the debugging infrastructure of DrJava. It looks like a good idea because they have several helper interfaces for debugging and compiling. Also, they have a good editor that we could reuse. Finally, they have a strong testing infrastructure with junit ensuring that their tool still work after modifications (that's something we are seriously missing in JLM). I'm really thinking that the two tools should converge to something stronger. The only argument for not doing so (beside the amount of work it'll take) is that each of us get the credit for each tool where things would be more fuzzy on a mixed tool. But I don't care, the mixed tool would be so much cooler that I'd like to find the time to ensure this convergence.
fr: Après cela, j'ai réessayé d'utiliser l'infrastructure de débuggage de DrJava. Cela semble être une bonne idée parce qu'il dispose de plusieurs interfaces d'aide pour le débuggage et la compilation. Il y a aussi un bon éditeur que l'on pourrait réutiliser. Finallement, ils ont un infrastructure solide de tests avec junit assurant que leur outil fonctionne toujours après modifications ( c'est quelquechose qui manque sérieusement dans la JLM). Je pense vraiment que les deux outils devriaent fusionner en quelquechose de plus fort. Le seul argument pour ne pas le faire ( en plus de la quantité de travail nécessaire ) est que chacun d'entre nous reçoit les honneurs pour son outil alors que les choses seraient plus ambiguës sur un outil fusionné. Mais ce n'est pas important, l'outil fusionné serait bien plus cool que j'aimerai trouver le temps pour m'assurer que cela converge.

source: But the debugging feature of DrJava seems to suffer from an issue: http://sourceforge.net/tracker/index.php?func=detail&aid=3004294&group_id=44253&atid=438935 I was suspecting a permission error (something related to com.sun.jdi.JDIPermission), but even with a java.security.AllPermission as permission file, I still have the issue.
fr: Mais la fonction de débuggage de DrJava semble souffir d'un problème : http://sourceforge.net/tracker/index.php?func=detail&aid=3004294&group_id=44253&atid=438935 je suspectais une erreur de permission ( quelquechose lié com.sun.jdi.JDIPermission ) , mais même avec un java.security.AllPermission comme fichier des permissions, j'ai encore ce problème.

source: Another lead to get it working it to use lib ASM to modify the student code so that their recursive method gets traced. With the static backtrace and the tracing information, I guess I could rebuild the actual call tree. That seem to be possible: 2 sec of googling gave me something like http://rejeev.blogspot.com/2009/04/method-tracing.html
fr: Un autre moyen pour le faire fonctionner est d'utiliser la bibliothèque ASM pour modifier le code de l'étudiant afin que leur méthode récursive soit tracée.Avec le backtrace statique et l'information de traçage, je pense que je pourrais reconstruire l'arbre d'appels. Cela semble possible: deux secondes sur Google m'ont donné quelquechose comme http://rejeev.blogspot.com/2009/04/method-tracing.html

source: So, here I am. The lesson would be very interesting to students, and quite easy to finish once I manage to get the information I need, but I didn't manage to do so so far, despite my efforts. If you have any hint (or patch!), please email martin.quinson#loria.fr.
fr: Donc, j'en suis là. La leçon serait très intéressante pour les étudiants, et assez facile à terminer une fois que j'aurais réussi à obtenir les informations dont j'ai besoin, mais je n'y suis pas parvenu jusqu'à présent, malgré mes efforts. Si vous avez un conseil ( ou un patch! ) , merci d'envoyer un email à martin.quinson#loria.fr.

source: This gives me the following todo actions: * Check whether tools.jar gives a working com.sun.jdi package * Find the DrJava bug around debugging to help them, and so that I can steal parts of their code about it for JLM (it's BSD'ed while JLM is mainly GPL'ed for now -- I'll have to ask them for an exception). That would be better since their helper interface seem to be able to deal with several debuggers (eclipse, sun or openjdk). That's quite a large amount of work I'd like to avoid duplicating. * Check wheter I can get tracing info from ASM. It may be more robust to JVM variants than the debugging approach. On the other hand, debugging is a neat feature for JLM as is. * Work on the convergence of JLM and DrJava. Beside of the licencing issue, it will also complicate the ongoing integration of JLM within Debian, since DrJava is composed of [[5 separated modules|http://drjava.org/docs/developer/ch02s03.html]] that can only be integrated as separated source packages. As every java package, no source archive is distributed, and they must be retrieved directly from the svn. Finally, they are quite huge, with sloccount reporting
fr: Cela me donne lesactions à faire suivantes: * Vérifier quel tools.jar donne un package com.sun.jdi qui fonctionne * Trouver le bug de DrJava au niveau du débuggage pour les aider, et ainsi je pourrai réutiliser des parties de leur code à ce propos dans la JLM ( c'est un projet BSD tandis que ja JLM est majoritairement GPL jusqu'à présent -- il faudra que je leur demande de faire une exception). Cela serait mieux puisque leur interface d'aide semble être capable de travailler avec différents débuggers (eclipse, sun ou openjdk ). C'est une quantité importante de travail que j'aimerai éviter d'avoir à dupliquer. * Trouver comment je peux obtenir les informations de traçage d'ASM. Cela semble être plus robuste aux variations de la JVM que l'approchage via débuggage. D'un autre côté, le débuggage est une fonctionnalité bien tenue dans la JLM.* Travailler sur la fusion entre JLM et DrJava. En plus du problème de license, cela compliquera l'intégration actuelle de JLM dans Debian puisque DrJava est composé de [[5 modules séparés|http://drjava.org/docs/developer/ch02s03.html]] qui peuvent seulement être intégré en tant que source package distincts. Comme tout package java, aucune source n'est distribuée et ils doivent les récupérer directement du svn. Enfin, ils sont très gros, avec du "sloccount reporting".

source: Welcome to the Java Learning Machine
fr: Bienvenue dans la Java Learning Machine

source: The JLM is a Learning Management System (LMS) aiming at teaching the art of computer programming through interactive exercises. It offers an extensive set of varied exercises, allowing you to practice at your own pace.
fr: Vous venez de lancer la Java Learning Machine. Il s'agit d'une plate-forme pédagogique destinée à simplifier l'apprentissage de la programmation offrant un grand nombre d'exercises pour vous permettre de progresser à votre rythme.

source: Pick a classical lesson
fr: Choisissez une leçon

source: <a href="jlm://lessons.welcome">Welcome lesson</a> This lesson is intended to lead the first steps in programming of absolute beginners.
fr: <a href="jlm://lessons.welcome">Premiers pas</a> Cette leçon est destinée à guider les premiers pas en programmation de débutants sans aucune connaissance préalable.

source: <a href="jlm://lessons.maze">Escape the maze</a> Will you escape the mazes?
fr: <a href="jlm://lessons.maze">Labyrinthes</a> Saurez vous vous échapper du labyrinthe?

source: <a href="jlm://lessons.bat.string1">String lesson</a> A bunch of exercises on strings.
fr: <a href="jlm://lessons.bat.string1">Chaînes</a> Quelques exercices sur les chaînes de caractères.

source: <a href="jlm://lessons.sort">Sorting lesson</a> This short lesson proposes to discover the classical sorting algorithms by practice.
fr: <a href="jlm://lessons.sort">Algorithmes de tri</a> Cette leçon vous propose de découvrir les algorithmes classiques de tri par la pratique.

source: <a href="jlm://lessons.recursion">Recursion lesson</a> Build some classical geometric figures through recursion.
fr: <a href="jlm://lessons.recursion">Récursivité</a> Construisez des figures géométriques classiques par récursivité.

source: <a href="jlm://lessons.lightbot">LightBot</a> In this little game, you must program graphically a little robot to instruct it how to switch the lights off. It is a brain teaser for programmer.
fr: <a href="jlm://lessons.lightbot">LightBot</a> Dans ce petit jeu, vous devez programmer graphiquement un petit robot pour lui faire éteindre des lumières. C'est un petit casse-tête pour programmeurs.

source: <a href="jlm://lessons.smn">Digital Manual Science</a> Some activities developed for the Sciences Manuelles du Numérique (Digital Manual Science)
fr: <a href="jlm://lessons.smn">Sciences Manuelles du Numérique</a> Différentes activitées développées pour les Sciences Manuelles du Numérique

source: Lesson chooser
fr: Sélection des leçons

source: This isn't a real lesson, it's here that you can select a lesson among others.
fr: Ce n'est pas une vraie leçon, c'est ici que vous pouvez choisir une leçon parmis les autres.

source: Creating a new JLM world
fr: Créer un nouveau monde JLM ("World")

source: Welcome to the JLM Meta-Lesson. Its goal is to teach you how to write new universes in JLM. For that, we will reimplement the Hanoi world (available in the recursion lesson) step-by-step. This lesson covers quite advanced topics and suppose that you are fluent in Java and confident with the use of the JLM framework already. If you are not used to the framework already, you probably want to take another lesson before, like the welcome one or (maybe more fun) the maze one.
fr: Bienvenue dans la Meta-Leçon JLM. Son but est de vous apprendre comment écrire de nouveaux univers dans la JLM. Pour ce faire, nous allons réimplanter le monde des tours de Hanoï ( disponible dans la leçon récursion ) pas à pas. Cette leçon couvre des sujets assez avancés et supporse que vous êtes à l'aise en Java et que vous connaissez déjà bien l'utilisation du framework de la JLM. Si vous n'êtes pas déjà habitué au frameword, vous voudrez probablement suivre une autre leçon avant, comme Welcome ou ( sans doute plus amusant ) Maze.

source: Every JLM universe is composed of 4 main components:
fr: Chaque univers JLM est composé de quatre composants principaux

source: <b>The world</b>: it contains the state of the universe.
fr: <b>Le monde ("world")</b> : il contient l'état de l'univers.

source: <b>The view</b>: it allows to draw the world and the entities on the screen.
fr: <b>La vue ("View")</b>: elle permet de dessiner le monde et les entitées à l'écran.

source: <b>The entity ancestor</b>: the code written by the student will derive from this class, which contains some state specific to the entity, and every accessor to let the entity interact with its world.
fr: <b>L' "entity ancestor"</b> : le code écrit par l'étudiant sera dérivé de cette classe, qui contient certains états spécifiques à l'entité, et chaque accesseur pour permettre à l'entité d'intéragir avec le monde.

source: <b>The entity interactive control panel</b>: this is the little panel displayed under the world view in the JLM interface. It allows to interactively control the selected entity. As you can see from the existing universes, this is optional, and if you don't provide any, the panel will remain blank, preventing the users from interactively controlling the entities.
fr: <b>Le panneau de contrôle interactif de l'entité</b> : c'est le petit panneau affiché en dessous de la vue du monde dans l'interface de la JLM. Il permet de contrôler interactivement l'entité sélectionnée. Comme vous pouvez le voir avec les univers existants, c'est optionnel, et si vous n'en fournissez pas, le panneau restera vide, empêchant l'utilisateur de controler interactivement l'entité.

source: In addition, worlds are used by exercises, themselves sorted in lessons.
fr: De plus, les mondes sont utilisés pas les exercices, eux-mêmes rangés en leçons.

source: <b>Lessons</b> are just a list of exercise. They can be sequential (meaning that the student has to finish one exercise before being allowed to see the next one in the list), altrough most of them are not (ie, students are free to attempt the exercises in the order they like).
fr: <b>Les leçons ("Lessons")</b> sont juste une liste d'exercices. Elles peuvent être séquentielles (ce qui signifie que l'étudiant doit finir l'exercise avant de pouvoir voir le suivant ), même si la grande majorité des leçons ne le sont pas ( ie, les étudiants sont libre d'essayer les exercices dans l'ordre qu'ils souhaitent).

source: In the future, we would like to have richer exercise ordering schema, where the requirements to fulfill to be allowed to try an exercise could be more complex. The dependencies would probably turn into a graph instead of a chain. But this is still to be done.
fr: A l'avenir, nous aimerions disposer d'un ordonnancement d'exercices plus riche, où les conditions à remplir pour pouvoir essayer un exercice pourrait être plus complexes. Les dépendances deviendraient probablement un graphe au lieu d'être une chaîne. Mais cela reste encore à réaliser.

source: The main element of each lesson is a class classically called Main, which simply contains a constructor adding each exercise of the lesson in row.
fr: L'élément principal de chaque leçon est la classe communément appelée Main, qui contient simplement un constructeur ajoutant chaque exercice de la leçon l'un à la suite de l'autre.

source: Each <b>exercise</b> object is in charge of instantiating the worlds used, set them up (adding walls and baggles in BuggleWorld, or changing the elevation and adding lamps in the LightBotWorld, etc), and populate them with entities correctly setup (location, color, etc).
fr: Chaque objet <b>exercise</b> a pour mission d'instancier les mondes utilisés, de les initialiser ( ajouter des murs et des baggles dans BuggleWorld, ou changer l'altitude et ajouter des lampes dans LightBotWorld, etc), et les peupler avec des correctement initialisées ( emplacement, couleur, etc) .

source: Most of the exercises also provide a specific <b>answer entity</b> able to solve the exercise. It serve both to compute the initial content of the code editor, and to compute the objective world. We will come back on this in a latter exercise of this meta-lesson.
fr: La plupart des exercices fournissent aussi une <b>entité réponse <b>("answer entity")</b> capable de résoudre l'exercice. Cela sert à la fois à afficher le contenu initial de l'éditeur de code, et à calculer le monde objectif. Nous reviendrons là-dessus plus tard dans un exercice de cette meta-leçon.

source: The very first element you want to write in a new JLM universe is a partial world implementation including the internal state. In subsequent exercises, we will complete the World class to provide entities ways to interact and modify their world, and we will also implement the other elements of the universe.
fr: Le premier élément que vous voulez écrire dans un nouvel univers de la JLM est une implémentation partielle du monde incluant l'état interne. Dans des exercices ultérieurs, nous complèterons la classe World pour fournir aux entités des moyens d'intéragir et de modifier leur monde, et nous implémenterons aussi les autres éléments de l'univers.

source: Before you jump in writing your World implementation, you should understand the big JLM picture, and how worlds are used internally.
fr: Avant que vous vous jetiez dans l'écriture de votre implémentation de World, vous devez comprendre le schéma de la JLM, et comment les mondes sont utilisés en interne.

source: JLM worlds big picture
fr: Schéma des mondes de la JLM

source: As you know, every JLM exercise can contain one or several worlds, each containing one or several entities. The code written by the student is executed in the entities, which must interact with their world to change it from its initial state to its goal state.
fr: Comme vous le savez, chaque exercice de la JLM peut contenir un ou plusieurs mondes, chacun contenant une ou plusieures entitées. Le code écrit par les étudiants est éxécutés dans les entitées, qui doivent intéragir avec leur monde pour le faire passer de son état initial à l'état objectif.

source: This multiplication of worlds and entities is used to test the student code in several conditions. It can thus be parallelized to test cases, aiming at full testing coverage of the student code.
fr: La multiplication des mondes et des entitées est utilisé pour tester le code de l'étudiant dans différentes conditions. Cela peut être comparé à des cas de tests, cherchant à tester entièrement le code de l'étudiant.

source: Technically, in a given exercise, for every world accessible from the relevant combobox, there is three World objects. They live in jlm.lesson.Exercise:
fr: Techniquement, dans un exercice donné, pour chaque monde accessible depuis la liste déroulante, il y a trois objets World. Ils se trouvent dans jlm.lesson.Exercise.

source: The line number of the combobox gives the index to use in these arrays. Each <code>initialWorld</code> is created by the exercise constructor.
fr: Le numéro de ligne de la liste déroulante donne l'index utilisé dans ces tableaux. Chaque <code>initialWorld</code> est crée par le constructeur de l'exercice.

source: <code>currentWorld</code> is the one displayed in the "World" tab of the interface. At the beginning, it is a plain copy of the initialWorld, but it gets modified when the student uses the interactive controls or when the program gets run. The "Reset" button reset it to be a perfect copy of the initial world.
fr: <code>currentWorld</code> est celui affiché dans l'onglet "World" de l'interface. Au début, il s'agit d'une simple copie de initialWorld, mais il est modifié quand l'étudiant utilise les contrôles interactifs ou quand le programme est lancé. Le bouton "Reset" le remet à zéro afin qu'il redevienne une copie parfaite du monde initial.
