Repository: BuggleInc/PLM
Catalog: lib/l10n/*.po
Languages: fr

source: You must provide a method called <code>doit(int)</code> taking the number of the page to draw as parameter. Its code is as following, with A0, B0, etc being integers. The goal of this exercise is to find the good values for each page.
fr: Vous devez écrire une méthode <code>doit(int)</code> qui prend en paramètre le numéro de la page à dessiner. Son code est de la forme suivante. A0, B0, etc sont des nombres entiers. L'objectif de l'exercice est de retrouver les valeurs convenables pour chaque page.

source: void doit(int page) { switch (page) { case 0: /* Drawing of the first page, dubbed "One" */ spiral(A0,B0,C0,D0); break; case 1: /* Drawing of the second page, dubbed "Two" */ spiral(A1,B1,C1,D1); break; case 2: /* Drawing of the page dubbed "Three" */ spiral(A2,B2,C2,D2); break; case 3: /* Drawing of the page dubbed "Four" */ spiral(A3,B3,C3,D3); break; case 4: /* Drawing of the page dubbed "Five" */ spiral(A4,B4,C4,D4); break; } }
fr: void doit(int page) { switch (page) { case 0: /* Dessin de la première page, marquée "One" */ spiral(A0,B0,C0,D0); break; case 1: /* Dessin de la seconde page, marquée "Two" */ spiral(A1,B1,C1,D1); break; case 2: /* Dessin de la page marquée "Three" */ spiral(A2,B2,C2,D2); break; case 3: /* Dessin de la page marquée "Four" */ spiral(A3,B3,C3,D3); break; case 4: /* Dessin de la page marquée "Five" */ spiral(A4,B4,C4,D4); break; } }

source: No need to copy over the method of <code>spiral()</code>, the turtle of this exercise already knows it.
fr: Pas besoin de recopier le code de <code>spiral()</code>, la tortue de cet exercice connait déjà la méthode.

source: Tower of Hanoi
fr: Les tours de Hanoï

source: The Tower of Hanoi or Towers of Hanoi , also called the Tower of Brahma or Towers of Brahma, is a mathematical game or puzzle. It consists of three rods, and a number of disks of different sizes which can slide onto any rod. The puzzle starts with the disks in a neat stack in ascending order of size on one rod, the smallest at the top, thus forming a pyramid. The objective of the puzzle is to move the entire stack to another rod, obeying the following rules:
fr: La tour de Hanoï, ou les tours de Hanoï, aussi appelé la Tour de Brahma ou les tours de Brahma, est un jeu ou puzzle mathématique. Il consiste en trois tours, et un nombre de disques de différentes tailles qui peuvent glisser sur n'importe quelle tour. Le puzzle commence avec tous les disques en une belle pile selon l'ordre croissant de la taille, le plus petit en haut, sur une tour, formant donc une pyramide. L'objectif du puzzle est de déplacer la pile entière jusqu'à une autre tour, en respectant les règles suivantes :

source: Only one disk may be moved at a time.
fr: Seul un disque peut être bougé à la fois.

source: Each move consists of taking the upper disk from one of the rods and sliding it onto another rod, on top of the other disks that may already be present on that rod.
fr: Chaque mouvement consiste à prendre le disque supérieur de l'une des tours et à le déposer sur une autre tour, au sommet des autres disques qui peuvent déjà être présents sur cette tour.

source: No disk may be placed on top of a smaller disk.
fr: Aucun disque ne peut être placé au dessus d'un disque plus petit.

source: Write the core of the method: <code>public void solve(int src, int dst, int height) throws HanoiInvalidMove</code> This method will recursively solve the presented problem. First parameter named <code>src</code> is the index of the initial tower, second parameter <code>dst</code> is the index of the expected final tower, and the third parameter <code>height</code> is the height of the tower. A key to solving this puzzle is to recognize that it can be solved by breaking the problem down into a collection of smaller problems and further breaking those problems down into even smaller problems until a solution is reached. The following procedure demonstrates this approach:
fr: Ecrivez le coeur de la méthode <code>public void solve(int src, int dst, int height) throws HanoiInvalidMove</code>. Cette méthode résoudra de manière récursibe le problème. Le premier paramètre, nommé <code>src</code>, est l'index de la tour initiale, le second paramètre <code>dst</code> est l'index de la tour final souhaitée, et le troisième paramètre <code>height</code> est la taille de la tour. La clé pour résoudre de puzzle est de reconnaitre qu'il peut être résolu en cassant le problème en un ensemble de problèmes de plus petites tailles et de continuer cette réduction de la taille du problème jusqu'à atteindre une solution. La procédure suivante démontre cette approche :

source: label the pegs A, B, C (these labels may move at different steps)
fr: Etiquetons les tours A, B, C ( ces étiquettes peuvent changer à différentes étapes )

source: let n be the total number of discs (the height of the initial tower)
fr: Soit n le nombre total de disques ( la hauteur de la tour initiale )

source: number the discs from 1 (smallest, topmost) to n (largest, bottommost)
fr: Numérotez les disques de 1 ( le plus petit, le plus en haut ) à n ( le plus large, le plus en bas )

source: To move n discs from peg A to peg C:
fr: Pour déplacer n disques du poteau A au poteau C :

source: move n−1 discs from A to B. This leaves disc #n alone on peg A
fr: déplcacer n-1 disques de A vers B. Cela laisse le disque #n seul sur le poteau A

source: move disc #n from A to C
fr: déplacer le disque #n de A vers C

source: move n−1 discs from B to C so they sit on disc #n
fr: deplacer n-1 disques de B vers C afin qu'ils reposent sur le disque #n

source: Labyrinths
fr: Labyrinthes

source: This lesson propose several exercises about labyrinths in the buggle world.
fr: Cette leçon propose divers exercices à propos des labyrinthes dans le monde des buggles.

source: The crazy mouse
fr: La souris folle

source: The day of your buggle starts badly. Out of luck, it got trapped into a maze. Help it finding its path out of there.
fr: La journée de votre buggle commence mal. Il n'a pas eu de chance. Il est tombé dans un piège. Aidez le à sortir de ce labyrinthe.

source: The exit is represented by a baggle and you need to pick this baggle in order to exit the maze.
fr: La sortie est représentée par un baggle et vous devez le ramasser afin de vous échapper du labyrinthe.

source: Since the maze is so small, we can write the dumbest possible algorithm to do so. It relies on randomness and proves quite inefficient.
fr: Nous allons profiter du fait que le labyrinthe ne soit pas trop grand pour écrire l'algorithme le plus bête possible. Cet algorithme repose sur le hasard et est très inefficace.

source: While the buggle didn't find the path to the escape, it must proceed the following way: pick a random integer between 0 and 2 by using the <code>random3()</code> method and make one of the following actions: moving forward if possible, turn left or turn right.
fr: Tant que notre buggle n'a pas trouvé la sortie, il doit progresser de la façon suivante : choisir un entier entre 0 et 2 au hasard à l'aide de la méthode <code>random3()</code> et prendre l'une des décisions suivantes selon l'entier choisi: avancer si il le peut, tourner à droite ou bien tourner à gauche).

source: This exercise's objective is to write an algorithm allowing the buggle to find its path out of the maze. Do not forget to let your buggle pick up the baggle once it found the way out.
fr: <a name="Objectifs"> L'objectif de cet exercice est d'écrire un algorithme permettant à votre buggle de sortir du labyrinthe. Pensez à faire prendre le baggle à votre buggle avant la fin de votre programme.

source: Write the <code>run()</code> method so that your buggle takes a random decision (forward, turn left or turn right). You can use the <code>random3()</code> method which returns randomly either 0, 1 or 2.
fr: Ecrivez la méthode <code>run()</code> pour que votre buggle prenne une décision (avancer, tourner à droite, tourner à gauche) au hasard. Vous pouvez utiliser la méthode <code>random3()</code> qui retourne de manière aléatoire la valeur 0, 1 ou 2.

source: Don't forget to pick up the baggle once you've reached it.
fr: N'oubliez pas de faire ramasser le baggle par votre buggle à la fin de votre code.

source: Following the walls
fr: Longer les murs

source: This time, the maze is a bit more complicated. Random won't be enough, we ough to be smart!
fr: Cette fois-ci le labyrinthe est beaucoup plus compliqué. Le hasard ne sera pas suffisant, il va falloir être intelligent !

source: Hopefully, this maze is simpler that it seems at the first glance: every wall are connected to each other. To get out of this kind of maze, the buggle only have to follow a wall (the one on its left or the one on its right, it doesn't matter). While keeping a paw on the wall, the buggle must move forward until it finds the maze exit and this biscuit it loves so much.
fr: Heureusement, ce labyrinthe est plus simple qu'il n'y paraît: tous les murs sont connectés les uns aux autres. Pour sortir de ce genre de labyrinthe, il suffit à votre buggle de longer un mur (celui à sa droite, ou celui à sa gauche: c'est sans importance). Et, tout en gardant sa patte posée sur ce mur, votre buggle doit avancer jusqu'à ce qu'il trouve la sortie du labyrinthe et ce biscuit qu'il apprécie tant.

source: This algorithm works here because there is no island of isolated walls, so our buggle cannot loop around for ever without encountering the baggle it looks for.
fr: Cet algorithme fonctionne ici car il n'y a pas d'île de murs isolés, ce qui fait que la buggle ne peut pas boucler autour des murs sans rencontrer le biscuit qu'elle cherche.

source: The goal of this exercise is to write an algorithm allowing the buggle to get out of this maze.
fr: <a name="Objectifs"> L'objectif de cet exercice est d'écrire un algorithme permettant à votre buggle de sortir du labyrinthe.

source: As said in the introduction, it is exactly the same if you decide to follow the left wall or the right one. Simply, the demo follows the left one, so you should do the same in your solution to ease the comparison of your solution and the demo.
fr: Comme dit dans l'introduction, il est sans importance de décider de suivre le mur droit ou le mur gauche. Simplement, la démo suit le mur gauche, et il serait donc avisé d'en faire de même dans votre solution pour simplifier la comparaison de votre solution et de la démo.

source: Write a method <code>void keepHandOnSideWall()</code> which lets the buggle move one step forward while keeping the paw on the wall of the selected side. You thus have to ensure that the buggle always keep the paw on the wall, but also that it won't crash into a wall. You can check the tip for more info on this, but only do so if you're stuck. Try to do it without the tip first.
fr: Écrivez une méthode <code>void keepHandOnSideWall()</code> qui fait avancer votre buggle d'une case tout en gardant la patte sur le mur du côté choisi. Vous devez donc vous assurer que votre buggle garde toujours la patte sur le mur et également qu'il ne risque pas de percuter un mur. Vous pouvez regarder l'indice (hint) si vous êtes coincés, mais vous devriez d'abord essayer de le faire sans l'indice.

source: Then, write a <code>run()</code> method which traverse the maze step by step (using <code>void keepHandOnSideWall()</code>) until it finds the biscuit and the exit. Don't forget to pick the baggle up once you've found it.
fr: Enfin, écrivez la méthode <code>void run()</code> qui cherche le mur le plus proche (méthode <code>void putHandOnSideWall()</code>), puis parcours le labyrinthe (méthode <code>void keepHandOnSideWall()</code>) jusqu'à trouver la sortie et le biscuit. Enfin il ne faut pas oubliez de prendre la baggle.

source: I'm lost, please give me some extra indications
fr: Je suis perdu, je voudrais plus d'indications

source: When your buggle has a wall on the left, there is three situations to consider, depending on the surrounding walls. The following table depicts each initial situation, and where you should let your buggle end after one step.
fr: Quand votre buggle a un mur à sa gauche, il faut considérer trois situations possible, qui dépendent des murs alentours. Le tableau suivant représente graphiquement chaque situation initiale, et où vous devez placer votre buggle à la fin de l'étape.

source: Initial situation
fr: Situation initiale

source: Where is the next step
fr: Étape suivante

source: If you do a <code>turnRight()</code> in any case at the end of your function, it's possible to write it in 3 lines with a <code>while()</code> loop.
fr: Si vous faites un <code>turnRight()</code> dans tous les cas à la fin de votre fonction, il est possible de l'écrire en trois lignes avec une boucle <code>while()</code>.

source: Pledge algorithm
fr: Algorithme de Pledge

source: Once again, you thought that your algorithm were good enough to escape the maze, and once again, you buggle is now in a maze where your previous algorithm fails. Just give it a try: hit the "Run" button and see your creation fail. The trap is shaped like an upper case "G". The buggle enters the trap and follows the inner border. At some point, it finds the north direction free, run into that direction, and falls again in the trap.
fr: Une fois de plus, vous pensiez que votre algorithme vous permettait de vous échapper des labyrinthes, et une fois de plus, votre buggle est prise dans un labyrinthe où votre algorithme précédent ne suffit pas. Vous pouvez tenter de simplement appuyer sur le bouton «Run» et voir votre création échouer. Le piège a la forme d'un «G» majuscule : la buggle entre dans le piège, suit le bord interne. Au bout d'un moment, la direction nord est libre et votre buggle se met donc à courir dans cette direction. Pour retomber dans le piège...

source: The Pledge's algorithm (named after Jon Pledge of Exeter) can solve this maze.
fr: L'algorithme de Pledge (nommé d'après Jon Pledge d'Exeter) peut résoudre ce labyrinthe.

source: This algorithm is a modification of the previous one thought to avoid obstacles. It randomly picks a heading and let the buggle move in that direction. When it encounters an obstacle, a paw (for example the left one) is kept on the wall following the obstacle while counting the turns. When the buggle is back to its original heading and when the sum of the turns is 0, the buggle leaves the obstacle and continues keeping its original heading.
fr: Cet algorithme est une version modifiée l'algorithme précédent conçu pour éviter les obstacles. Il nécessite de choisir de manière arbitraire une direction vers laquelle le buggle se dirigera. Quand un obstacle est rencontré, une patte (disons la patte de gauche) est gardée le long des obstacles tandis que les virages sont comptabilisés. Quand le buggle est face à nouveau à la direction originale, et que la somme des virages est égale à 0, le buggle quitte l'obstacle et continue de se déplacer dans sa direction d'origine.

source: Note that the use of "total turning" rather than just the "current direction" allows the algorithm to avoid G-shapped traps. If one proceeds left into the trap, one gets turned around a full 360 degrees by the walls. As we said before, the naive "current direction" algorithm gets into a limit cycle as it leaves the lower rightmost wall heading left and runs into the curved section on the left again.
fr: Notez que l'utilisation de la "somme des virages" à la place de la "direction courante" permet à l'algorithme d'éviter les pièges tel que les formes en "G" majuscule. Si l'on rentre par la gauche dans le piège, on tourne de 360 degrés autour des murs. Un algorithme qui se contenterait naivement de se retrouver dans la même direction qu'à l'origine rentre dans un cycle infini puisque qu'il quite le mur le plus à droite en étant dirigé vers la gauche, et entre à nouveau dans la section incurvée.

source: The Pledge's algorithm does not leave the rightmost wall due to the total turning not being zero at that point. It follows the wall all the way around, finally leaving it heading left on the bottom outside
fr: L'algorithme de Pledge ne quitte pas le mur en bas à droite puisque la somme des virages ne vaut pas zéro à ce moment. Il continue de suivre le mur jusqu'à avoir complétement fait le tour, et le quitte en regardant à gauche une fois parvenu sous l'obstacle.

source: <a name="Objective"/>You now have to modify your solution to implement the Pledge algorithm to escape this maze.
fr: <a name="Objectifs"> L'objectif de cet exercice est d'écrire une implémentation de l'algorithme de Pledge qui permettra à votre buggle de sortir du labyrinthe.

source: Change your <code>void keepHandOnSideWall()</code> method to count the amount of turns done by the buggle (+1 when it turns left, and -1 when it turns right). This counting may require the addition of an <code>angleSum</code> integer value in your program.
fr: Reprenez la méthode <code>void keepHandOnSideWall()</code> de l'exercice précédent. Modifiez cette méthode pour compter les virages pris par votre buggle (+1 lorsqu'il a tourné à gauche par rapport à son origine, -1 lorsqu'il a tourné à droite). Pour comptabiliser vous aurez besoin d'ajouter une variable <code>angleSum</code> de type entière à votre programme.

source: Write a <code>boolean isChosenDirectionFree()</code> method indicating if the arbitrary direction you picked up is free, ie, if you can move in that direction. (Note that the demo uses the NORTH direction for that). You can retrieve the current direction of the buggle using the <code>Direction getDirection()</code> method. You can change your direction (without moving) using <code>void setDirection(Direction d)</code>. Don't forget to store the previous direction of your buggle (in a variable of type Direction) before checking if your favorite direction is free in order to restore your state afterward.
fr: Écrivez une méthode <code>boolean isChosenDirectionFree()</code> indiquant si la direction arbitraire que vous avez choisie est libre, c'est-à-dire si vous pouvez vous déplacer dans cette direction. Notez que la démo utilise la direction NORTH pour cela. Vous pouvez retrouver la direction courante de la buggle en utilisant la méthode <code>Direction getDirection()</code>. Vous pouvez diriger (sans se déplacer) votre buggle dans une direction en utilisant la méthode <code>void setDirection(Direction d)</code>. Pensez à mémoriser (dans une variable de type <code>Direction</code>) la direction courante de votre buggle avant de vérifier si votre buggle peut se diriger vers sa direction de prédilection pour pouvoir restaurer l'état après coup.

source: You may have to change the rest of your code also, but these changes should remain limited.
fr: Vous pouvez être amenés à modifier également le reste de votre code, mais ces changements devraient rester limités.

source: Show an additional tip
fr: Montrer un indice supplémentaire

source: The <code>void run()</code> method should move in your favorite direction (NORTH is advised). Then, you should write the algorithm main loop. In other words, while your buggle did not find its biscuit, you have to move forward until next obstacle in the favorite direction. Then, put a paw on a wall (using (<code>void keepHandOnSideWall()</code>) while the sum of turns is not null and the favorite direction is not free. Do that until you find your baggle.
fr: La méthode <code>void run()</code> doit déplacer votre buggle dans votre direction de prédilection (il est conseillé de choisir le nord pour cela). Ensuite, vous devez écrire la boucle principale de l'algorithme. Autrement dit, tant que votre buggle n'a pas trouvé son biscuit, il faut avancer jusqu'à un obstacle dans la direction de prédilection. Quand un obstacle est rencontré, il faut garder la patte sur un mur (en utilisant <code>void keepHandOnSideWall()</code>) tant que la somme des virages n'est pas nulle et que la direction de prédilection n'est pas libre. Faites cela jusqu'à trouver votre biscuit.

source: Lost between islands
fr: Perdu dans les îles

source: You thought that your algorithm was enough to escape mazes? Well, not every mazes...
fr: Vous pensiez que votre algorithme était suffisant pour échapper de tous les labyrinthes ? Et bien, pas tous les labyrinthes...

source: The <i>wall follower algorithm</i> we used so far only works if the entry and the exit are placed near to walls connected to the external wall. But if the buggle begins in the middle of the maze, it may exist wall sections disconnected from the external wall.
fr: L' algorithme du <i>Wall Follower</i> que nous avons utilisé jusqu'à présent fonctionne seulement si l'entrée et la sortie sont placées à côté de murs connectés à un mur externe. Mais si le buggle commence au milieu du labyrinthe, il peut exister des pans de mur déconnectés du mur externe.

source: That is why the previous strategy would let the buggle round around for ever. Indeed, the maze you should now escape from contains islands, and the buggle does not start along one of the external walls. Just give it a try if you want: push the run button and see your previous solution fail miserabily.
fr: C'est pourquoi notre stratégie précédente laissera notre buggle tourner en rond pour toujours. En effet, le labyrinthe dont vous devez vous échapper maintenant contient des îles, et le buggle ne commence pas sur un des murs externes. Vous pouvez essayer si vous voulez : appuyez sur le bouton 'run' et admirez votre solution précédente échouer lamentablement

source: The method of following a wall is still good and allow to escape very efficiently some sections of the maze, so we do not want to remove it entierely. Instead, we want to stop following the wall under some conditions. Notice that the baggle lays near to the external border of the maze. So, we want to reach the border and then follow that wall. We need for example to search for the north wall before following it to the baggle.
fr: Cette méthode de suivre un mur est toujours efficace est permet d'échapper de manière assez efficace à certaines parties du labyrinthe, on ne va donc pas la supprimer entièrement. A la place, nous allons cesser de suivre le mur sous certaines conditions. Notez que le baggle repose près d'un mur externe du labyrinthe. Donc nous voulons atteindre un mur externe et ensuite le suivre. Nous avons par exemple de rechercher le mur nord avant de le suivre jusqu'au baggle.

source: To find the north wall, you simply run to the north as long as it's possible, and when facing an obstacle, you avoid it (using previous method).
fr: Pour trouver le mur nord, vous avez tout simplement à foncez vers le nord tant que c'est possible, et quand vous faites face à un obstacle, vous l'évitez ( en utilisant la méthode précédente ).

source: I'm lost now, please give me some extra indications
fr: Je suis perdu, je voudrais plus d'indications
