Repository: BuggleInc/PLM
Catalog: lib/l10n/*.po
Languages: fr

source: The JLM Main Window
fr: La fenêtre principale de JLM

source: The JLM working environment should be self-explanatory, in particular with the tool tips appearing when your mouse is over the elements. Here is a little explanation of the components in case you fail to understand something. The main window is made of 5 main components:
fr: L'environnement de travail de JLM devrait être immédiat à maîtriser, en particulier avec les bulles d'aide qui apparaissent quand votre souris survole les éléments. Voici une petite explication des composants au cas où quelque chose vous échappe. La fenêtre principale est faite de 5 composants majeurs :

source: <b>The menu:</b> Placed on top of the window, it gives you access to some advanced commands such as exiting the program, and some other that we will detail later.
fr: <b>Le menu :</b> Placé en haut de la fenêtre, il vous permet de quitter le programme, et d'accéder à certaines commandes avancées que nous détaillerons plus tard.

source: <b>The tool bar:</b> Placed just below the menu, it gives you access to the four main commands:
fr: <b>La barre de commandes : </b> Placée juste en dessous du menu, celle-ci vous donne accès aux quatre commandes principales :

source: The <b>Start</b> button, which begins the compilation and execution of the code you may have typed in the editor. At the end of the execution, it verifies whether you reach the situation constituting the objective of the exercise or not. If yes, you gain access to the next exercise using the <b>Exercise</b> menu. If not, you need to rework your code.
fr: Le bouton <b>Start</b> qui lance la compilation et l'exécution du code que vous aurez tapé dans l'éditeur. A la fin de l'exécution, il vérifie que vous arrivez bien à la situation finale de l'exercice. Si c'est le cas, vous aurez accès à l'exercice suivant par le menu <b>Exercise</b>. Sinon, il vous faudra corriger votre code.

source: The <b>Stop</b> button allows you to interupt the execution of your code, what may reveal useful if you encounter an <i>infinite loop</i>.
fr: Le bouton <b>Stop</b> permet d'interrompre l'exécution de votre code, ce qui est pratique si vous avez une <i>boucle infinie</i>.

source: The <b>Reset</b> button can be used to reset the world into its initial state.
fr: Le bouton <b>Reset</b> permet de remettre le monde dans son état initial.

source: The <b>Demo</b> button shows you the execution of the expected solution. During its execution, you may want to swich the seen world to see the different expected solutions.
fr: Le bouton <b>Demo</b> vous montre l'exécution de la solution attendue. Pendant l'exécution, vous êtes autorisés à changer de monde afin de voir les différentes exécutions attendues.

source: Please note that there is often several ways of achieving the awaited solution, and that the one presented during the demo is not more or less correct than the others. You are completely free to not follow strictly the process shown by the demo, as long as your final solution matches the exercise expectations.
fr: Notez qu'il y a souvent plusieurs moyens d'atteindre la solution escomptée, et que celle présentée lors de la démo n'est pas plus ou moins correcte que les autres. Libre à vous de ne pas suivre à la lettre le procédé de la démo, à condition que le résultat final corresponde bien à ce qui est demandé.

source: The scrolling menu <b>Lessoon</b> allows you to choose the lesson you want to work on.
fr: Le menu déroulant <b>Lesson</b>, vous permet de choisir la leçon que vous souhaitez étudier

source: The scrolling menu <b>Exercise</b> allows you to switch to another exercise when you want. Some lessons require you to finish an exercise before starting the previous one.
fr: Le menu déroulant <b>Exercise</b>, vous permet de changer d'exercice quand vous le souhaitez. Notez que certaines leçons vous imposent de finir un exercice avant de pouvoir commencer le suivant.

source: <b>Mission and editor tabs:</b> this is were you read this very text. This area contains several tabs to which you can access by clicking on their name on the top left. The first tab (which is always named <b>Mission</b>) contains a presentation of the current exercise. To solve an exercise, you need to write your code in the other tabs. For example, you can now clic on the <b>Source Code</b> tab to see the actual source. It is empty because there is no code to write for this introduction exercise.
fr: <b>Les onglets de consigne et d'édition :</b> C'est ici que vous lisez le texte actuel. Cette zone contient plusieurs onglets, auxquels on peut accéder en cliquant sur leur nom en haut à gauche. Le premier onglet (qui est toujours intitulé <b>Mission</b>) contient une présentation de l'exercice en cours. Pour résoudre un exercice, vous devez écrire votre code dans les autres onglets. Par exemple, vous pouvez maintenant cliquer sur l'onglet <b>Source Code</b> pour voir le code actuel. Il est vide, car il n'y a rien à faire pour cet exercice de prise en main de l'environnement.

source: <b>The console:</b> Placed under the tabs, this is where any messages of the application will appear. This area is initially empty and white.
fr: <b>La console :</b> Placée sous les onglets, c'est ici que s'afficheront tous les messages de l'application. Cette zone est initialement vide et blanche.

source: <b>World view</b> Placed on the right of the tabs, it is constituted of five elements:
fr: <b>La vue du monde :</b> Placée à droite des onglets, elle est constituée de cinq éléments:

source: A scrolling menu allows to choose the world. Indeed, the program you write may be executed in several worlds to test it in differing conditions. This menu allows you to choose the world you want to see.
fr: Un menu déroulant permettant de choisir un monde. En effet, le programme que vous devez écrire sera parfois exécuté dans plusieurs monde pour vous confronter à différentes situations. Ce menu déroulant vous permettra de choisir le monde que vous souhaitez voir.

source: A slider placed underneath allows to choose the animation speed of the world. More precisely, it allows to choose the delay (in milliseconds) that the buggles must wait after each action to allow you to see what they are doing.
fr: Un règlet placé en dessous permet de choisir la vitesse d'animation du monde. Plus exactement, il permet de choisir le delai (en millisecondes) que les buggles doivent attendre après chaque action afin que vous ayez le temps de voir ce qu'elles font.

source: A tab <b>World</b> represents the view of the world currently selected (from the scrolling menu). This view is thus constitued of a grid forming the several cells of the world, as well as several <i>buggles</i> awaiting for your orders.
fr: Un onglet <b>World</b> qui représente la vue du monde actuellement sélectionné (dans le menu déroulant). Cette vue est constituée d'une grille représentant les différentes cases du monde, ainsi que d'une ou plusieurs <i>buggles</i> qui attend vos ordres.

source: An <b>Objective</b> tab displaying the world as it must be by the end of the exercise.
fr: Un onglet <b>Objective</b> qui permet d'afficher la vue du monde tel qu'il doit être à la fin de l'exercice.

source: <b>The interactive controls</b>. Placed under the world view, these buttons allows you to interactively control the buggles. This way, you can try to <i>manually</i> bring your buggle to the scenario objective before writting the needed code in the editor.
fr: <b>Les contrôles interactifs</b> Placés sous la vue du monde, ces boutons vous permettent de contrôler interactivement les buggles. Vous pouvez ainsi essayer d'amener la buggle à l'objectif du scénario <i>à la main</i> avant d'écrire le code nécessaire dans l'éditeur.

source: A scrolling menu allows to select the buggle you want to control.
fr: Un menu déroulant permettant de sélectionner la buggle que vous souhaitez contrôler.

source: The <b>Forward</b> button let your buggle do one step forward.
fr: Le bouton <b>Forward</b> fait avancer votre buggle d'un pas.

source: The <b>Backward</b> button let it do one step backward.
fr: Le bouton <b>Backward</b> fait reculer votre buggle d'un pas.

source: The <b>Turn left</b> button ask your buggle to turn of 90° to its left.
fr: Le bouton <b>Turn left</b> demande à votre buggle de tourner vers la gauche.

source: The <b>Turn right</b> button asks the buggle to turn to the right (isn't this amazing?).
fr: Le bouton <b>Turn right</b> demande à votre buggle de tourner vers la droite.

source: The <b>Mark</b> button requests your buggle to leave a mark behind it when it goes.
fr: Le bouton <b>Mark</b> demande à votre buggle de faire un trait au sol quand elle avance.

source: Sorting World
fr: Monde des tris

source: This world provides tools to experiment with the sorting algorithms. It can be used in two different ways: the first one is naturally to write the required sorting algorithms. But it is also possible to simply use the demo mode of each exercise to observe the behavior of sorting algorithms. It helps understanding the differences between each of them.
fr: Ce monde vous donne les outils pour expérimenter les algorithmes de tris. On peut l'utiliser de deux manières différentes : la première est bien sûr d'écrire les algorithmes de tri demandés. Mais on peut aussi se contenter dans un premier temps de lancer la démo de chaque exercice et observer les algorithmes de tri fonctionner. Cela permet de mieux se rendre compte des différences d'efficacité entre eux.

source: Methods available to sorting algorithms
fr: Méthodes disponibles pour les algorithmes de tri

source: <b>Method</b>
fr: <b>Méthode</b>

source: <b>Cost</b>
fr: <b>Coût</b>

source: Returns the amount of values in the array
fr: Retourne le nombre de valeurs dans le tableau

source: none
fr: aucun

source: Returns true if the content of cell i is smaller than the one of cell j
fr: Retourne vrai ssi le contenu de la case i est inférieur à celui de la case j

source: two reads
fr: deux lectures

source: Returns true if the content of cell i is smaller than value val
fr: Retourne vrai ssi le contenu de la case i est inférieur à la valeur val

source: one read
fr: une lecture

source: Swaps the content of cell i and the one of cell j
fr: Echange le contenu de la case i avec celui de la case j

source: two reads, two writes
fr: deux lectures, deux écritures

source: Copy the content of cell 'from' into the cell 'to'
fr: Copie le contenu de la case 'from' dans la case 'to'

source: one read, one write
fr: une lecture, une écriture

source: Returns the value of cell idx
fr: Retourne la valeur de la case idx

source: Sets cell 'idx' to the value 'val'
fr: Affecte la valeur 'val' à la case 'idx'

source: one write
fr: une écriture

source: History view
fr: Vue de l'historique du monde

source: It is not enough to sort the array to pass the exercises. Your solution must strictly follow the expected behavior of each exercise. This is enforced by checking that your algorithm needs the same amount of read and write operations to sort the array. When they don't match, understanding the difference between your code and the expected solution can reveal very difficult.
fr: Il ne suffit pas de trier le tableau pour passer les exercices. Votre solution doit suivre scrupuleusement le comportement attendu de chaque exercice. Ceci est vérifié en comptant le nombre d'opérations de lecture et d'écriture sur le tableau effectuées lors de ce tri. En cas de problème, il est souvent assez difficile de comprendre la différence entre le comportement attendu et le comportement effectif.

source: To help in this process, it is posible to graphically explore the history of your sorting algorithm. Switch to the Objective view and use the contextual menu (right clic) to switch from the the view of the current state to the view of its history.
fr: Pour cela, il est possible d'explorer graphiquement l'historique de n'importe quel monde de tri. Passez par exemple au monde Objectif et utilisez son menu contextuel (clic droit) pour choisir entre la vue de l'état courant du monde et la vue de son histoire.

source: The history view is a bit hairly at the first glance, but actually rather simple: The time flows from left to right on this graph, and each row is a cell of your array. The curved lines that go navigate between rows represent a given data value. When two lines cross, this means that two values were swapped at this time stamp. This view, first introduced by Aldo Cortesi, reveals very helpful understand the inner behavior of sorting algorithms.
fr: La vue de l'historique n'est pas aussi complexe qu'elle en a l'air à première vue. Le temps s'écoule de gauche à droite, et les cases du tableau sont représentée de haut en bas. Les lignes de différentes couleurs qui serpentent représentent les différentes valeurs contenues dans le tableau. Quand deux lignes se croises, cela signifie que les valeurs du tableau ont été échangées à ce moment de l'historique. Cette vue, inventée par Aldo Cortesi, est très pratique pour comprendre le comportement des algorithmes de tri.

source: TurtleWorld
fr: Monde des tortues

source: This world is directly inspired from the work of the mathematician Seymour Papert in the 60's. Inspirated from the swiss psycholog Jean Piaget, he came up with a learning method called LOGO to teach programming to young childs. The world is full of turtles which leave a painting where they go and which respond to simple orders.
fr: Ce monde est directement inspiré des travaux du mathématicien Seymour Papert dans les années 60. Inspiré par le psychologue suisse Jean Piaget, il a inventé une méthode d'apprentissage de la programmation accessible aux jeunes enfants nommée LOGO. Le monde est peuplé de tortues qui laissent une trace là où elles marchent et à qui on peut donner des ordres simples.

source: This world is an adaptation of LOGO for the Java Learning Machine.
fr: Ce monde est une adaptation de LOGO pour la Java Learning Machine.

source: Methods understood by turtles
fr: Méthodes comprises par les tortues

source: <b>Moving forward</b> <code>public void forward(double stepAmount);</code>
fr: <b>Avancer</b> <code>public void forward(double nbPas);</code>

source: <b>Moving backward</b> <code>public void backward(double stepAmount);</code>
fr: <b>Reculer</b> <code>public void backward(double nbPas);</code>

source: <b>Turn left</b> <code>public void turnLeft(double angle);</code> (in degree)
fr: <b>Tourner à gauche</b> <code>public void turnLeft(double angle);</code> (en degré)

source: <b>Turn right</b> <code>public void turnRight(double angle);</code>
fr: <b>Tourner à droite</b> <code>public void turnRight(double angle);</code>

source: <b>Pen up</b> <code>public void penUp();</code>
fr: <b>Lever le stylo</b> <code>public void penUp();</code>

source: <b>Pen down</b> <code>public void penDown();</code>
fr: <b>Baisser le stylo</b> <code>public void penDown();</code>

source: <b>Get pen position</b> <code>public boolean isPenDown();</code>
fr: <b>Obtenir la position du stylo</b> <code>public boolean isPenDown();</code>

source: (turtles have pens, not brushes as buggles)
fr: (les tortues ont des stylos, pas des brosses comme les buggles)

source: <b>Get heading</b> <code>public double getHeading();</code>
fr: <b>Obtenir direction</b> <code>public double getHeading();</code>

source: <b>Change heading</b> <code>public void setHeading(double angle);</code>
fr: <b>Changer direction</b> <code>public void setHeading(double angle);</code>

source: <b>Get color</b> <code>public Color getColor();</code>
fr: <b>Obtenir couleur</b> <code>public Color getColor();</code>

source: <b>Set color</b> <code>public void setColor(Color color);</code>
fr: <b>Changer couleur</b> <code>public void setColor(Color color);</code>

source: <b>Get position</b> <code>public double getX();</code> <code>public double getY();</code>
fr: <b>Obtenir position</b> <code>public double getX();</code> <code>public double getY();</code>

source: <b>Set position</b> <code>public void setX(double x);</code> <code>public void setY(double y);</code> <code>public void setPos(double x, double y);</code>
fr: <b>Changer position</b> <code>public void setX(double x);</code> <code>public void setY(double y);</code> <code>public void setPos(double x, double y);</code>

source: BuggleWorld
fr: Le monde des Buggles

source: This world was invented by Lyn Turbak, at Wellesley College. It is full of Buggles, little animals understanding simple orders, and offers numerous possibilities of interaction with the world: taking or dropping objects, paint the ground, hit walls, etc.
fr: Ce monde a été inventé par Lyn Turbak, du Wellesley College. Il est peuplé de Buggles, petites bêtes qui comprennent des ordres simples, et offre de nombreuses possibilités d'interaction avec le monde: prendre ou poser des objets, colorier le sol, se cogner à des murs, etc.

source: Methods understood by buggles
fr: Méthodes comprises par les buggles

source: <b>Moving</b>
fr: <b>Bouger</b>

source: (See also the note on exceptions, below)
fr: (voir aussi la note sur les exceptions, plus bas)

source: <b>Turn left
fr: <b>Tourner à gauche

source: Turn right
fr: Tourner à droite

source: Turn back
fr: Se retourner

source: Moving forward
fr: Avancer

source: Moving back</b>
fr: Reculer</b>

source: void forward() or void forward(int)
fr: void forward() ou void forward(int)

source: void backward() or void backward(int)
fr: void backward() ou void backward(int)

source: <b>Get X coordinate
fr: <b>Obtenir l'abcisse

source: Get Y coordinate
fr: Obtenir l'ordonnée

source: Set X coordinate
fr: Changer l'abcisse

source: Set Y coordinate
fr: Changer l'ordonnée

source: Set position</b>
fr: Changer la position</b>

source: <b>Information on the buggle</b>
fr: <b>Informations sur la buggle</b>

source: <b>Get the color
fr: <b>Obtenir la couleur

source: Set the color</b>
fr: Changer la couleur</b>

source: <b>Look for a wall forward
fr: <b>Chercher un mur devant

source: Look for a wall backward</b>
fr: Chercher un mur derriere</b>

source: <b>Get heading
fr: <b>Obtenir la direction

source: Set heading</b>
fr: Changer la direction</b>

source: valid directions are:
fr: Les directions valides sont :

source: Direction.NORTH, Direction.EAST, Direction.SOUTH and Direction.WEST
fr: Direction.NORTH, Direction.EAST, Direction.SOUTH et Direction.WEST

source: <b>About the brush</b>
fr: <b>À propos de la brosse</b>

source: <b>Brush down
fr: <b>Baisser la brosse

source: Brush up
fr: Lever la brosse

source: Get brush position</b>
fr: Obtenir la position de la brosse</b>

source: <b>Change the brush color
fr: <b>Modifier la couleur de la brosse

source: Get the color of the brush</b>
fr: Obtenir la couleur de la brosse</b>

source: <b>Interacting with the world</b>
fr: <b>Interagir avec le monde</b>

source: <b>Get the color of the ground</b>
fr: <b>Obtenir la couleur du sol</b>

source: <b>Look for a baggle on the ground
fr: <b>Chercher un baggle par terre

source: Look for a baggle in bag
fr: Chercher un baggle dans ses poches

source: Pickup a baggle
fr: Prendre un baggle

source: Drop a baggle</b>
fr: Poser un baggle</b>

source: (see the note on exceptions)
fr: (voir la note sur les exceptions)

source: <b>Look for a message
fr: <b>Chercher un message

source: Add a message
fr: Ajouter un message

source: Read the message
fr: Lire le message

source: Erase the message</b>
fr: Effacer le message</b>

source: Note on exceptions
fr: Note sur les exceptions

source: Regular buggles throw a BuggleWallException exception if you ask them to traverse a wall. They throw a NoBaggleUnderBuggleException exception if you ask them to pickup a baggle from an empty cell, or a AlreadyHaveBaggleException exception if they already carry a baggle. Trying to drop a baggle on a cell already containing one throws an AlreadyHaveBaggleException exception.
fr: Les buggles normales lèvent une exception BuggleWallException si on cherche à leur faire traverser un mur. Elles lèvent une exception NoBaggleUnderBuggleException si vous cherchez à prendre un baggle dans une case qui n'en contient pas, ou une exception AlreadyHaveBaggleException si vous portez déjà un baggel. Tenter de déposer un baggel sur une case qui en contient déjà lève une exception AlreadyHaveBaggleException.

source: SimpleBuggles (ie, the one used in first exercises) display an error message on problem so that you don't need to know what an exception is.
fr: Les "SimpleBuggles" (ie, celles utilisées dans les premiers exercices) affiche un message d'erreur sans que vous ayez à vous soucier de ce qu'est une exception.

source: HanoiWorld
fr: Le monde des tours de Hanoï

source: This world implements the ultra-classical Hanoi problem. You are asked to move the disk pile from the stick where they are to the target stick (given as second parameter in the world's name -- number 1 for the default world). There is some extra constraint: you can only move one disk at a time, and you cannot move a big disk over a smaller one. Only 2 functions are provided:
fr: Ce monde implémente le problème ultra classique de Hanoï. Il vous est demandé de déplacer une pile de disques du piquet où ils se trouvent vers un piquet cible (passé comme second paramètre dans le nom du monde -- numéro 1 pour le monde par défaut). Il y a quelques contraintes supplémentaires: il est interdit de déplacer plus d'un disque à la fois, ainsi que de placer un disque plus grand sur un disque plus petit. Seules deux fonctions sont fournies :

source: It moves one disk from the stick <code>src</code> onto the stick <code>dst</code>. As you can see, if you try to do an invalid move (like laying a disk over a smaller one), an exception is thrown.
fr: Elle déplace un disque d'un piquet <code>src</code> vers le piquet <code>dst</code>. Comme vous le voyez, si vous demandez un déplacement invalide (comme le placement d'un disque sur un disque plus petit), une exception est levée.

source: It returns the amount of disks placed on the specified slot. This is mainly used to initialize the recursion and set the amount of recursive call to execute.
fr: Elle retourne le nombre de disques placés sur un piquet donné. Cette fonction est surtout utile pour initialiser la récursion et déterminer le nombre d'appels récursifs à réaliser.

source: Backtracking lesson
fr: Leçon sur le "backtracking"

source: This <b>experimental</b> lesson aims at teaching students about backtracking. It is not ready for consumtion yet, not even the first exercises. It will feature several exercices on the topic allowing to progressively build the relevant notions and mental representation in the students mind.
fr: Cette leçon <b>expérimentale</b> a pour but d'enseigner aux étudiants le principe du "backtracking". Ce n'est pas encore prêt à être utilisé, ne serait-ce que les premiers exercices. Cette leçon contiendra plusieurs exercices sur le sujet permettant d'introduire pas à pas les notions nécessaires et de construire une représentation mentale dans l'esprit de l'étudiant.
