Repository: BuggleInc/PLM
Catalog: lib/l10n/*.po
Languages: fr

source: When you write a quite complex program, it is sometimes useful to <b>add comments</b> to simplify the code reviews afterward. Here for example, it's quite easy to get lost in the drawing process, and you may want to add comments like <i>vertical bar done</i> or <i>finished drawing the G. Time to move back to initial position</i>. Commenting your code is almost mandatory if you (or someone else) want to read it afterward, although overcommenting (describing obvious stuff) is a bad idea as the important idea get lost in the noise.
fr: Quand vous écrivez un programme un peu complexe, il est souvent pratique d'ajouter des <b>commentaires</b> pour simplifier la relecture du code après coup. Ici par exemple, il est assez facile de se perdre dans les ordres nécessaires au dessin. Il peut être pratique d'ajouter des commentaires comme <i>fin de la barre verticale</i> ou <i>Fini de dessiner le G. Retournons à la position initiale</i>. Documenter votre code est presque toujours nécessaire si quelqu'un (vous ou quelqu'un d'autre) veut le lire après coup. Cependant, commenter des choses triviales est une mauvaise idée car cela dilue les informations dans des commentaires trop verbeux. En anglais, ce travers s'appelle <i>overcommenting</i>.

source: There is three types of comments in Java, instructing the compiler to not read the text you add for humans:
fr: Il y a trois sortes de commentaires en Java, indiquant au compilateur qu'il ne doit pas lire le texte ajouté pour les humains.

source: There is two types of comments in Python, instructing the compiler to not read the text you add for humans:
fr: Il y a deux sortes de commentaires en Python, indiquant au compilateur qu'il ne doit pas lire le texte ajouté pour les humains.

source: <b>Comments on a single line</b>. When the compiler encounters the symbols //, it ignores the end of the line.
fr: <b>Commentaires sur une seule ligne</b>. Dès que le compilateur rencontre les symboles //, il ignore la fin de la ligne.

source: <b>Comments on several lines</b>. The compiler ignores anything placed between the symbols /* and */ even if they are placed on differing lines.
fr: <b>Commentaires sur plusieurs lignes</b>. Le compilateur ignore tout ce qui se trouve entre les symboles /* et */, même s'ils sont sur des lignes différentes

source: <b>Comments on a single line</b>. When the compiler encounters the symbol #, it ignores the end of the line.
fr: <b>Commentaires sur une seule ligne</b>. Dès que le compilateur rencontre le symbole #, il ignore la fin de la ligne.

source: <b>Comments on several lines</b>. The compiler ignores anything placed between a line beginning with ''' and the next line ending with '''.
fr: <b>Commentaires sur plusieurs lignes</b>. Le compilateur ignore tout ce qui se trouve entre une ligne commençant par ''' et la prochaine ligne terminant par '''.

source: methodCallReadByTheCompiler(); <span class="comment">// all this is ignored</span> otherCall(); <span class="comment">/* This is</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span class="comment"> also ignored */</span> yetAnotherCall();
fr: appelMethodeLuParLeCompilateur(); <span class="comment"> // tout ceci est ignoré</span> autreAppel(); <span class="comment">/* ceci est</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span class="comment"> également ignoré */</span> encoreUnAppel();

source: methodCallReadByTheCompiler() <span class="comment"># all this is ignored</span> otherCall() <span class="comment">''' This is</span> <span class="comment">also ignored '''</span> yetAnotherCall()
fr: appelMethodeLuParLeCompilateur() <span class="comment"> # tout ceci est ignoré</span> autreAppel() <span class="comment">''' ceci est</span> <span class="comment"> également ignoré '''</span> encoreUnAppel()

source: There is a third kind of comments in Java, between /** and */, which are read by a specific program called JavaDoc to generate automatically the documentation explaining how to use the code. These comments must follow a very precise formalism.
fr: Il existe une troisième forme de commentaires en Java, entre /** et */, qui sont lus par un programme nommé JavaDoc pour générer automatiquement la documentation expliquant comment utiliser le code. Ces commentaires doivent suivre un formalisme précis.

source: The comments on several lines are often used to document how to use the code, while others are more used to describe how this code works.
fr: Les commentaires sur plusieurs lignes sont souvent utilisés pour documenter comment utiliser le code, tandis que les autres types de commentaires sont souvent utilisés pour documenter comment le code fonctionne.

source: Programs made of simple suite of instructions similar to previous exercise are quite boring. They always do the same thing, and cannot react to external conditions. A <b>conditional</b> let the program adapt by doing something like <i>if it's raining, take an umbrella</i>.
fr: Les programmes faits d'une simple suite d'instructions comme celui de l'exercice précédent sont bien ennuyeux. Ils font toujours la même chose, et ne peuvent pas réagir aux conditions extérieurs. Une <b>instruction conditionnelle</b> permet au programme de s'adapter en disant quelque chose comme <i>S'il pleut, prend un parapluie</i>.

source: The Java syntax is the following:
fr: La syntaxe Java est la suivante :

source: The Python syntax is the following:
fr: La syntaxe Python est la suivante :

source: if (<b>condition</b>) { &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDo();</b> }
fr: if (<b>condition</b>) { &nbsp;&nbsp;&nbsp;&nbsp;<b>quoiFaire();</b> }

source: if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDo()</b>
fr: if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>quoiFaire()</b>

source: If the condition is true, any code enclosed between the { and the corresponding } will be executed. If not, it will be ignored. Of course, it is possible to write more than one instruction between the curly brackets (even another test).
fr: Si la condition est vraie, tout le code compris entre le { et le } correspondant sera exécuté. Si non, il sera ignoré. Bien entendu, il est possible d'écrire plusieurs instructions entre les deux accolades (voire un autre test).

source: If the condition is true, any code in the block following the colon symbol will be executed. If not, it will be ignored. Of course, it is possible to write more than one instruction in the sub-block (even another test).
fr: Si la condition est vraie, tout le code du bloc placé après les deux points (:) sera exécuté. Si non, il sera ignoré. Bien entendu, il est possible d'écrire plusieurs instructions dans le sous-bloc (voire un autre test).

source: Python uses indentation to define code blocks. The standard Python indentation is 4 spaces. Notice that code blocks do not need any termination. Indenting starts a block and unindenting ends it. In the following code the instructions <b>whatToDo()</b> and <b>whatToDoNext()</b> will be exectuded if the condition is true, then the instruction <b>whatToDoAnyway()</b> will be executed anyway.
fr: Python utilise l'indentation pour définir les blocs de code. L'indentation standard en Python est de quatre espaces. Veuillez noter que les blocs de code n'ont pas besoin de terminaison. Indenter commence un bloc et désindenter le termine. Dans le code suivant, les instructions <b>whatToDo()</b> et <b>whatToDoNext()</b> seront executées si la condition est vraie, ensuite l'instruction <b>whatToDoAnyway()</b> sera exécutée dans tous les cas.

source: if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDo()</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoNext()</b> <b>whatToDoAnyway()</b>
fr: if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>quoiFaire()</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>quoiFaireEnsuite()</b> <b>quoiFaireDansTousLesCas()</b>

source: Python functions have no explicit begin or end, and no curly braces to mark where the function code starts and stops. The only delimiter is a colon (:) and the indentation of the code itself.
fr: Les fonctions Pythons n'ont pas de début ou de fin explicite, ni d'accolade pour indiquer où le code commence et où il se termine. Le seul délimiteur est un double points (:) et l'indentation du code lui même.

source: Example 2.5. Indenting the buildConnectionString Function
fr: Exemple 2.5. Indenter la fonction buildConnectionString

source: def buildConnectionString(params): """Build a connection string from a dictionary of parameters. Returns string.""" return ";".join(["%s=%s" % (k, v) for k, v in params.items()])
fr: def buildConnectionString(params): """Construit une connection string à partir d'un dictionnaire de paramètres. Renvoie une chaîne de caractères.""" return ";".join(["%s=%s" % (k, v) for k, v in params.items()])

source: Code blocks are defined by their indentation. By "code block", I mean functions, if statements, for loops, while loops, and so forth. Indenting starts a block and unindenting ends it. There are no explicit braces, brackets, or keywords. This means that whitespace is significant, and must be consistent. In this example, the function code (including the doc string) is indented four spaces. It doesn't need to be four spaces, it just needs to be consistent. The first line that is not indented is outside the function.
fr: Les blocs de code sont définis par leur indentation. Par "bloc de code", je veux dire les fonctions, les branchements conditionnels if, les boucles for, les boucles while, etc. Indenter commence un bloc et désindenter le termine. Il n'y a pas de parenthèses, d'accolades, ou de mots clés. Cela signifie qu'un espace est significatif et doit être cohérent. Dans cet exemple, le code de la fonction (en comptant la documentation) est indenté avec quatre espaces. Il n'est pas nécessaire que cela soit quatre espaces, il faut juste que cela soit cohérent. La première ligne qui n'est pas indentée est en dehors de la fonction.

source: It is important that the indentations of all the instructions of a block are consistent, and it is not possible to cut a block. The two following codes are incorrect and will raise errors.
fr: Il est important que l'indentation de toutes les instructions d'un bloc soit cohérente, et il n'est pas possible de couper un bloc. Les deux exemples suivants de code sont incorrects et vont générer des erreurs.

source: if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDo()</b> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoNext()</b> <b>whatToDoAnyway()</b>
fr: if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>quoiFaire()</b> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>quoiFaireEnsuite()</b> <b>quoiFaireDansTousLesCas()</b>

source: if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDo()</b> <b>whatToDoAnyway()</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoNext()</b>
fr: if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>quoiFaire()</b> <b>quoiFaireDansTousLesCas()</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>quoiFaireEnsuite()</b>

source: A condition can be a variable of type <tt>boolean</tt>. The code between curly braces will get executed if the variable is <tt>true</tt> and it will be ignored if it is <tt>false</tt>.
fr: Une condition peut être une variable de type <tt>boolean</tt>. Le code entre accolades sera exécuté si la variable vaut la valeur <tt>true</tt> (vrai), et il sera ignoré si elle vaut <tt>false</tt> (faux).

source: A condition can be a variable of type <tt>boolean</tt>. The code in the inner bloc will get executed if the variable is <tt>True</tt> and it will be ignored if it is <tt>False</tt>.
fr: Une condition peut être une variable de type <tt>boolean</tt>. Le code dans le bloc indenté sera exécuté si la variable vaut la valeur <tt>True</tt> (vrai), et il sera ignoré si elle vaut <tt>False</tt> (faux).

source: The condition can also be an arithmetic test, such as <tt>x</tt> <b>==</b> <tt>5</tt>, which checks whether the current value of <tt>x</tt> is 5, or such as <b>!=</b> (checking inequality), <b>&lt;</b> (smaller than), <b>&gt;</b> (larger than), <b>&lt;=</b> (smaller or equal to), <b>&gt;=</b> (larger or equal to).
fr: La condition peut aussi être un test arithmétique, comme <tt>x</tt> <b>==</b> <tt>5</tt>, qui vérifie si la valeur actuelle de <tt>x</tt> est 5, ou bien comme <b>!=</b> (teste l'inégalité), <b>&lt;</b> (inférieur à), <b>&gt;</b> (supérieur à), <b>&lt;=</b> (inférieur ou égal à), <b>&gt;=</b> (supérieur ou égal à).

source: Beware of the classical trap, which consists in testing the equality of a variable using = instead of ==. Hopefully, the compiler detects this problem most of the time, but not always. If the variable is of type boolean, it can get trapped, so you have to be careful...
fr: Attention au piège classique, qui consiste à tester l'égalité d'une variable avec = au lieu de ==. Heureusement, le compilateur vous indique le plus souvent ce problème, mais pas tout le temps. Si la variable est de type booléen, il peut se faire prendre au piège, et il convient donc d'être attentif...

source: The condition can also be a call to some perticular methods returning a boolean. For example, the <tt>isFacingWall()</tt> method of the buggle returns true if the buggle is facing a wall, and false in the other case.
fr: La condition peut également être un appel à certaines méthodes particulières, dont le résultat est un booléen. Par exemple, la méthode <tt>isFacingWall()</tt> de la buggle renvoie vrai si la buggle est face à un mur, et faux sinon.

source: Finally, a condition can be composed of several sub-conditions connected by boolean operations.
fr: Enfin, il est possible de construire une condition composée de plusieurs sous-conditions reliées par des opérations booléennes.

source: <tt>cond1 && cond2</tt> is true when <tt>cond1</tt> <b>and</b> <tt>cond2</tt> are both true (if <tt>cond1</tt> is false, <tt>cond2</tt> is not even evaluated).
fr: <tt>cond1 && cond2</tt> est vraie si <tt>cond1</tt> <b>et</b> <tt>cond2</tt> est vraie (si <tt>cond1</tt> est fausse, <tt>cond2</tt> n'est même pas évaluée).

source: <tt>cond1 || cond2</tt> is true if <tt>cond1</tt> <b>or</b> <tt>cond2</tt> are true (if <tt>cond1</tt> is true, <tt>cond2</tt> is not even evaluated).
fr: <tt>cond1 || cond2</tt> est vraie si <tt>cond1</tt> <b>ou</b> <tt>cond2</tt> est vraie (si <tt>cond1</tt> est vraie, <tt>cond2</tt> n'est même pas évaluée).

source: <tt>!cond</tt> is true if <tt>cond</tt> is false.
fr: <tt>!cond</tt> est vraie si <tt>cond</tt> ne l'est pas.

source: It is possible to force the order of evaluation by adding parenthesis. In ambigous cases, do not hesitate to add more parenthesis to remove any ambiguities on evaluation order.
fr: On peut forcer l'ordre d'évaluation en ajoutant des parenthèses. En cas de doute, n'hésitez pas à mettre plus de parenthèses que nécessaire pour lever les ambiguïtés sur l'ordre d'évaluation.

source: <tt>cond1 and cond2</tt> is true when <tt>cond1</tt> <b>and</b> <tt>cond2</tt> are both true (if <tt>cond1</tt> is false, <tt>cond2</tt> is not even evaluated).
fr: <tt>cond1 and cond2</tt> est vraie si <tt>cond1</tt> <b>et</b> <tt>cond2</tt> est vraie (si <tt>cond1</tt> est fausse, <tt>cond2</tt> n'est même pas évaluée).

source: <tt>cond1 or cond2</tt> is true if <tt>cond1</tt> <b>or</b> <tt>cond2</tt> are true (if <tt>cond1</tt> is true, <tt>cond2</tt> is not even evaluated).
fr: <tt>cond1 or cond2</tt> est vraie si <tt>cond1</tt> <b>ou</b> <tt>cond2</tt> est vraie (si <tt>cond1</tt> est vraie, <tt>cond2</tt> n'est même pas évaluée).

source: <tt>not cond</tt> is true if <tt>cond</tt> is false.
fr: <tt>not cond</tt> est vraie si <tt>cond</tt> ne l'est pas.

source: Finally, it is possible to specify what to do when the condition is false using the following syntax:
fr: Pour finir, il est possible de spécifier ce qu'il faut faire quand la condition est fausse, en utilisant la syntaxe suivante :

source: if (<b>condition</b>) { &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoIfTheConditionIsTrue();</b> } else { &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoIfItsFalse();</b> }
fr: if (<b>condition</b>) { &nbsp;&nbsp;&nbsp;&nbsp;<b>quoiFaireSiLaConditionEstVraie();</b> } else { &nbsp;&nbsp;&nbsp;&nbsp;<b>quoiFaireSinon();</b> }

source: if (<b>condition</b>): &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoIfTheConditionIsTrue()</b> else: &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoIfItsFalse()</b>
fr: if (<b>condition</b>): &nbsp;&nbsp;&nbsp;&nbsp;<b>quoiFaireSiLaConditionEstVraie()</b> else: &nbsp;&nbsp;&nbsp;&nbsp;<b>quoiFaireSinon()</b>

source: Don't forget the colon (:) after the else, it is indicating that a new block is beginning.
fr: N'oubliez pas les deux points (:) après le else, ils indiquent qu'un nouveau bloc débute.

source: <a name="Objectives">If the buggle is facing a wall (predicate <tt>isFacingWall()</tt>), you must move one step back. If not, you must move one step forward.
fr: <a name="Objectifs"> Si la buggle est face à un mur (prédicat <tt>isFacingWall()</tt>), il faut reculer d'un pas. Sinon, il faut avancer d'un pas.

source: This exercise is a bit different: your code has to work for several buggles, each of them being in a specific initial condition. The same code will be executed for each of them.
fr: Cet exercice est un peu particulier : il faut que votre programme fonctionne pour plusieurs buggles, chacune étant dans une situation initiale différente. Le même code sera utilisé pour chacune d'entre elles.

source: When your program works, move forward to the next exercise.
fr: Quand votre programme fonctionne, passez à l'exercice suivant.

source: The buggle world can sometimes contain some <i>baggles</i>, which are little biscuits that buggles can carry from one point to another. For that, they have to use specific methods such as <code>isOverBaggle(), isCarryingBaggle(), pickUpBaggle()</code> or <code>dropBaggle()</code>. Check their documentation in "Help/About this world" for more details.
fr: Le monde des buggles contient parfois des <i>baggles</i>, sorte de petits biscuits que les buggles peuvent déplacer d'un endroit à un autre. Pour cela, elles peuvent utiliser des fonctions spécifiques : <code>isOverBaggle(), isCarryingBaggle(), pickUpBaggle()</code> et <code>dropBaggle()</code>. Tous les détails se trouvent dans la documentation accessible depuis "Help/About this world".

source: Let each buggle find its baggle by adapting the code you wrote in previous exercise (copy/paste what you've done before to save time).
fr: Faites en sorte que chaque buggle trouve son baggle en adaptant le code que vous aviez écrit pour l'exercice précédent (faites un copie/colle de ce que vous aviez fait pour gagner du temps).

source: The programs we wrote so far are missing a fundamental point in computing. Actually, it is all about processing <b>data</b> through specific <b>instructions</b>. In the buggle world, the main data are a bit hidden behind the graphical representation, but that's no reason to never manipulate some data explicitly.
fr: Les programmes que nous avons écrit jusque là passent à coté d'un point fondamental en informatique. En effet, la science informatique est celle de traiter des <b>données</b> grâce à des <b>instructions</b>. Dans le monde des buggles, les principales données sont cachées derrière la représentation graphique, mais ce n'est pas une raison pour ne jamais manipuler explicitement des données.

source: Data in Java
fr: Les données en Java

source: Data in Python
fr: Les données en Python

source: In a program, you can use several <i>types</i> of data, such as integers or strings of chars. If you want to use a data several times, you need to store it within a <i>variable</i>, which is a memory cell containing a value. It's not very different from a shelve containing a book: you put your data (say '5') in the variable (say 'length'), and you can retrieve it latter when you need it.
fr: Dans un programme, on peut utiliser différents <i>types</i> de données, tels que les entiers, les nombres à virgules ou les chaînes de caractères. Si on veut utiliser une donnée plusieurs fois, il faut la stocker dans une <i>variable</i>, qui est une sorte de case contenant une valeur. Ce n'est pas très différent d'une étagère contenant un livre: vous rangez votre donnée (disons '5') dans la variable (disons 'longueur'), et vous pouvez la retrouver plus tard quand vous en avez besoin.

source: Java is said to be a <i>typed</i> language, which means that it is only possible to store a value in a variable of the right type. Don't think about storing the letters of your name into an integer variable. In other languages (such as Python) allow you to store any kind of data in any variable without such restriction, but not in Java.
fr: Java est un langage <i>typé</i>, ce qui veut dire que l'on ne peut stocker une valeur que dans une variable du bon type. Pas question de stocker votre nom dans une variable entière.

source: The Python language is said to <i>not typed</i>, which means you can store any type of data into a given variable. Other languages (such as Java) mandate that each variable store only data of a given type, but there is no such difficulties here.
fr: Le langage Python est dit <i>non typé</i>, ce qui signifie qu'une variable donnée peutcontenir n'importe quel type de donnée. D'autres langages (comme Java) rendent obligatoire que chaque variable ne puisse contenir que des données d'un certain type, mais il n'y a pas de telles difficultés ici.

source: To <i>declare</i> (ie, create) a variable, you just need to write its type, a space, and the variable name. From the existing types, we can speak of <b>int</b> (for integers), <b>double</b> for dot numbers, <b>boolean</b> for booleans (ie, values being either true or false) and <b>String</b> for char strings. If you want, you can specify the initial value of the variable by adding a equal sign (=) followed by the value after the declaration.
fr: Pour <i>déclarer</i> (i.e. créer) une variable, il suffit d'écrire son type, un espace et le nom de la variable. Notez qu'il n'est pas possible d'utiliser d'accents dans les noms de variables, malheureusement. Parmi les types existants, on trouve: <b>int</b> pour les entiers, <b>double</b> pour les nombres à virgule, <b>boolean</b> pour les booléens (i.e. les variables qui peuvent être soit vraies soit fausses) et <b>String</b> pour les chaînes de caractères. Si l'on veut, on peut faire suivre la déclaration du signe = suivi de la valeur initiale à donner à la valeur.

source: So, to create a variable named <b>x</b> intended to contain integers, one can write:
fr: Ainsi, pour créer une variable nommée <b>x</b> contenant des entiers, on écrira :

source: If you want that the variable contains 5 as initial value, you should type:
fr: Si on veut que sa valeur initiale soit 5, on écrira :

source: Later in the program, if you want to <i>affect</i> a new value to the variable, that's really easy:
fr: Plus tard dans le programme, si l'on souhaite <i>affecter</i> une nouvelle valeur à la variable, c'est très simple :

source: The syntax to create an integer variable <code>x</code> with 4 as initial value is the following:
fr: La syntaxe pour créer une variable entière <code>x</code> de valeur initiale 4 est la suivante :

source: This quite the same story for strings, floating point numbers and boolean values.
fr: C'est la même histoire pour les chaînes, nombres à virgule flottante et les booléens.

source: String name = "Martin Quinson"; double height=1.77; <span class="comment">// in meters</span> boolean married=true;
fr: String nom = "Martin Quinson"; double taille=1.77; <span class="comment">// en mètres</span> boolean marie=true;
