Repository: BuggleInc/PLM
Catalog: lib/l10n/*.po
Languages: fr

source: Given 2 int values, return true if one is negative and one is positive. Unless negative is true, then they both must be negative.
fr: Étant donné deux entiers, retournez vrai si l'un d'entre eux est positif et l'autre négatif. Sauf si le paramètre negative est vrai, auquel cas il faut que les deux nombres soient négatifs.

source: SleepDay
fr: Grasse matinée

source: The parameter weekday is true if it is a weekday, and the parameter vacation is true if we are on vacation. We sleep in if it is not a weekday or we're on vacation. Return true if we sleep in.
fr: Le paramètre weekday est vrai si nous sommes un jour de semaine, et le paramètre vacation est vrai si nous sommes en vacances. Nous pouvons dormir ce matin s'il ne s'agit pas d'un jour de semaine ou si nous sommes en vacances. Retournez vrai si nous pouvons faire la grasse matinée.

source: Sum Double
fr: Somme doublée

source: Given two int values, return their sum. Unless the two values are the same, then return double their sum.
fr: Étant donné deux entiers, retournez leur somme. Sauf si les valeurs sont égales, auquel cas vous devez retourner le double de leur somme.

source: AlarmClock
fr: Radio réveil

source: Given a day of the week encoded as 0=Sun, 1=Mon, 2=Tue, ...6=Sat, and a boolean indicating if we are on vacation, return a string of the form "7:00" indicating when the alarm clock should ring. Weekdays, the alarm should be "7:00" and on the weekend it should be "10:00". Unless we are on vacation -- then on weekdays it should be "10:00" and weekends it should be "off".
fr: Étant donné le jour de la semaine, codé de la façon suivante : 0=Dimanche, 1=Lundi, 2=Mardi, ... 6=Samedi, et un booléen vacation indiquant si nous sommes en vacances, retournez une chaine de caractères de la forme "7:00" indiquant à quelle heure nous devons régler le radio-réveil. Les jours de la semaine, nous devons nous réveiller à 7h tandis que nous pouvons dormir jusqu'à 10h le week-end. Pendant les vacances, il nous faut nous lever à 10h la semaine tandis que le réglage pour le radio-réveil doit être "off" le week-end.

source: AnswerCell
fr: Répondeur

source: Your cell phone rings. Return true if you should answer it. Normally you answer, except in the morning you only answer if it is your mom calling. In all cases, if you are asleep, you do not answer.
fr: Votre téléphone sonne. Renvoyez vrai si vous décrochez. Vous le faites habituellement, sauf le matin où vous ne répondez que si votre mère appelle. Dans tous les cas, vous ne répondez pas si vous dormez.

source: BlueTicket
fr: Ticket bleu

source: You have a blue lottery ticket, with ints a, b, and c on it. This makes three pairs, which we'll call ab, bc, and ac. Consider the sum of the numbers in each pair. If any pair sums to exactly 10, the result is 10. Otherwise if the ab sum is exactly 10 more than either bc or ac sums, the result is 5. Otherwise the result is 0.
fr: Vous avez un ticket de loterie bleu, avec des entiers a, b et c inscrits dessus. Cela fait trois paires que l'on appellera ab, bc et ac. Considérez la somme des nombres de chaque pair. Si la somme de l'une des paires vaut exactement 10, le résultat est 10. Sinon, si la somme ab vaut exactement 10 de plus que les sommes bc ou ac, le résultat est 5. Sinon, le résultat est 0.

source: CaughtSpeeding
fr: Radar de vitesse

source: You are driving a little too fast, and a police officer stops you. Write code to compute the result, encoded as an int value: 0=no ticket, 1=small ticket, 2=big ticket. If speed is 60 or less, the result is 0. If speed is between 61 and 80 inclusive, the result is 1. If speed is 81 or more, the result is 2. Unless it is your birthday -- on that day, your speed can be 5 higher in all cases.
fr: Vous conduisez un peu trop vite et un officier de police vous arrête. Écrivez le code pour calculer le résultat, encodé sous forme d'un entier : 0=pas d'amende, 1=petite amende, 2=grosse amende. Si votre vitesse est inférieure à 60, le résultat est 0. Si la vitesse est incluse entre 61 et 80 (inclus), le résultat est 1. Si la vitesse est 81 ou plus, le résultat est 2. Tout ceci ne vaut que si ce n'est pas votre anniversaire aujourd'hui, car sinon, votre vitesse peut être supérieure de 5 dans tous les cas.

source: CigarParty
fr: Cigares de fête

source: When squirrels get together for a party, they like to have cigars. A squirrel party is successful when the number of cigars is between 40 and 60, inclusive. Unless it is the weekend, in which case there is no upper bound on the number of cigars. Return true if the party with the
fr: Quand les écureuils font la fête, ils aiment avoir des cigares. Une fête d'écureuils est réussie si le nombre de cigares est entre 40 et 60 (inclus). Sauf si c'est le week-end, auquel cas il n'y a pas de limite supérieure au nombre de cigares. Renvoyez vrai si la fête est réussie.

source: DateFashion
fr: Rendez-vous élégant

source: You and your date are trying to get a table at a restaurant. The parameter "you" is the stylishness of your clothes, in the range 0..10, and "date" is the stylishness of your date's clothes. The result getting the table is encoded as an int value with 0=no, 1=maybe, 2=yes. If either of you is very stylish, 8 or more, then the result is 2 (yes). With the exception that if either of you has style of 2 or less, then the result is 0 (no). Otherwise the result is 1 (maybe).
fr: Vous et votre compagne/compagnon essayez d'obtenir une table au restaurant. Le paramètre "you" est l'élégance de vos vêtements, dans l'intervalle [0,10], et "date" est l'élégance des vêtements de votre compagne/compagnon. Le résultat obtenir la table est encodé comme une valeur enteur avec 0=non, 1= peut-être et 2=oui. Si l'un de vous deux est très élégant, 8 ou plus, alors le résultat est 2 (oui). Avec l'exception que si l'un de vous deux a un style de 2 ou moins, alors le résultat est 0 (no). Sinon, le résultat est 1 (peut-être).

source: GreenTicket
fr: Ticket vert

source: You have a green lottery ticket, with ints a, b, and c on it. If the numbers are all different from each other, the result is 0. If all of the numbers are the same, the result is 20. If two of the numbers are the same, the result is 10.
fr: Vous avez un ticket de lotterie vert, avec des entiers a, b et c inscrits dessus. Si les nombres sont tous différents les uns des autres, le résultat est 0. Si tous les nombres sont identiques, le résultat est 20. Si deux des nombres sont les mêmes, le résultat est 10.

source: In1To10
fr: De 1 à 10

source: Given a number n, return true if n is in the range 1..10, inclusive. Unless "outsideMode" is true, in which case return true if the number is less or equal to 1, or greater or equal to 10.
fr: Soit un nombre n, renvoyez vrai si n est dans l'intervalle [1,10]. Sauf si"outsideMode" est vrai, auquel cas renvoyez vrai si le nombre est plus petit ou égal à 1 ou bien s'il est plus grand ou égal à 10

source: InOrderEqual
fr: Dans l'ordre croissant

source: Given three ints, a b c, return true if they are in strict increasing order, such as 2 5 11, or 5 6 7, but not 6 5 7 or 5 5 7. However, with the exception that if "equalOk" is true, equality is allowed, such as 5 5 7 or 5 5 5.
fr: Soit trois entiers, a b c, renvoyez vrai si ils sont dans un ordre croissant strict, tel que 2 5 11, ou 5 6 7, mais pas 6 5 7 ou 5 5 7. Cependant, avec l'exception que si "equalOk" est vrai, alors l'égalité est permise, comme 5 5 7 ou 5 5 5.

source: InOrder
fr: Dans l'ordre

source: Given three ints, a b c, return true if b is greater than a, and c is greater than b. However, with the exception that if "bOk" is true, b does not need to be greater than a.
fr: Soit trois entiers, a b c, renvoyez vrai si b est plus grand que a, et si c est plus grand que b. Cependant, avec l'exception que si "bOk" est vrai, b n'a pas besoin d'être plus grand que a.

source: LastDigit 2
fr: L'autre dernier chiffre

source: Given three ints, a b c, return true if two or more of them have the same rightmost digit. The ints are non-negative. Note: the % "mod" operator computes the remainder, e.g. 17 % 10 is 7.
fr: Soit trois entiers, a b c, renvoyez vrai si deux ou plus d'entre eux ont le même chiffre le plus à droite. Les entiers sont positifs. Note: l'opérateur % "mod" calcule le reste, i.e. 17 % 10 vaut 7.

source: LessBy10
fr: Plus petit par 10

source: Given three ints, a b c, return true if one of them is 10 or more less than one of the others.
fr: Soit trois entiers, a b c, renvoyez vrai si l'un d'entre eux est plus petit de 10 ou plus que l'un des autres.

source: Boolean (even more) fun
fr: Encore des jeux booléens

source: A very good introduction to this type is available here: http://javabat.com/doc/ifboolean.html.
fr: Une très bonne introduction à ce type est disponible ici : http://javabat.com/doc/ifboolean.html.

source: MaxMod5
fr: Maximum Mod 5

source: Given two int values, return whichever value is larger. However if the two values have the same remainder when divided by 5, then the return the smaller value. However, in all cases, if the two values are the same, return 0. Note: the % "mod" operator computes the remainder, e.g. 7 % 5 is 2.
fr: Soit deux valeurs entières, renvoyez la plus grande des deux. Cependant, si les deux valeurs ont le même reste quand elles sont divisées par 5, alors renvoyez la plus petite des deux. Cependant, dans tous les cas, si les deux valeurs sont égales, renvoyez 0. Note: l'opérateur % "mod" calcule le reste, i.e. 7 % 5 vaut 2.

source: NearTen
fr: Près de dix

source: Given a non-negative number "num", return true if num is within 2 of a multiple of 10. Note: (a % b) is the remainder of dividing a by b, so (7 % 5) is 2.
fr: Soit un entier positif "num", renvoyez vrai si num est à moins de 2 d'un multiple de 10. Note: ( a % b ) est le reste de la division de a par b, donc (7 % 5) vaut 2.

source: RedTicket
fr: Ticket rouge

source: You have a red lottery ticket showing ints a, b, and c, each of which is 0, 1, or 2. If they are all the value 2, the result is 10. Otherwise if they are all the same, the result is 5. Otherwise so long as both b and c are different from a, the result is 1. Otherwise the result is 0.
fr: Vous avez un ticket de lotterie rouge comportant trois entiers a, b et c. Chacun d'entre eux est 0, 1, ou 2. Si ils sont tous comme valeur 2, le résultat vaut 10. Sinon, si ils sont égaux, le résultat vaut 5. Sinon, tant que b et c sont différents de a, le résultat vaut 1. Sinon, le résultat est 0.

source: ShareDigit
fr: Chiffre partagé

source: Given two ints, each in the range 10..99, return true if there is a digit that appears in both numbers, such as the 2 in 12 and 23. (Note: division, e.g. n/10, gives the left digit while the % "mod" n%10 gives the right digit.)
fr: Soit deux entiers, chacun étant dans l'intervalle [10,99], renvoyez vrai si il y a un chiffre qui apparait dans les deux nombres, comme 2 dans 12 et 23. (Note: division, i.e. n/10, renvoie le chiffre à gauche tant que le % "mod" n%10 renvoye le bon chiffre.)

source: SortaSum
fr: Sommes d'entiers

source: Given 2 ints, a and b, return their sum. However, sums in the range 10..19 inclusive, are forbidden, so in that case just return 20.
fr: Soit deux entiers, a et b, renvoyez leur somme. Cependant, les sommes entre 10 et 19 inclus sont interdites, dans ce cas, renvoyez 20.

source: SquirrelPlay
fr: Jeu de l'écureuil

source: The squirrels in Palo Alto spend most of the day playing. In particular, they play if the temperature is between 60 and 90 (inclusive). Unless it is summer, then the upper limit is 100 instead of 90. Given an int temperature and a boolean isSummer, return true if the squirrels play and false otherwise.
fr: Les écureuils dans Palo Alto passent la majorité de leurs journées à jouer. En particulier, ils jouent si la température est entre 60 et 90 ( inclus ). A moins que ce soit l'été, alors la limite supérieure est de 100 au lieu de 90.Soit une température entière et un booléen isSummer. Renvoyez vrai si les écureuils jouent et faux sinon.

source: TeaParty
fr: Goûter

source: We are having a party with amounts of tea and candy. Return the int outcome of the party encoded as 0=bad, 1=good, or 2=great. A party is good (1) if both tea and candy are at least 5. However, if either tea or candy is at least double the amount of the other one, the party is great (2). However, in all cases, if either tea or candy is less than 5, the party is always bad (0).
fr: Nous avons un goûter avec quantité de thé et de bonbons. Renvoyez l'entier 'outcome' du goûter encodé comme 0=mauvais, 1=bien, ou 2=excellent. Un goûter est bien (1) si le thé et les bonbons sont à 5 au moins. Cependant, si soit le thé soit les bonbons est à au moins le double de la quantité de l'autre, le goûter est excellent (2). Cependant, dans tous les cas, si soit le thé soit les bonbons sont à moins de 5, le goûter est toujours mauvais (0).

source: TeenSum
fr: Somme d'ados

source: Given 2 ints, a and b, return their sum. However, "teen" values in the range 13..19 inclusive, are extra lucky. So if either value is a teen, just return 19.
fr: Étant donné deux nombres entiers (a et b), retournez leur somme. Cependant, les valeurs ados (dans l'intervale [13;19]) sont particulièrement chanceuse. Donc, si l'un des nombres est ado, retournez simplement 19.

source: TwoAsOne
fr: Deux pour un

source: Given three ints, a b c, return true if it is possible to add two of the ints to get the third.
fr: Soit trois entiers, a b c, renvoyez vrai si il est possible d'en additionner deux d'entre eux pour obtenir le troisième.

source: WithoutDoubles
fr: Sans double

source: Return the sum of two 6-sided dice rolls, each in the range 1..6. However, if noDoubles is true, if the two dice show the same value, increment one die to the next value, wrapping around to 1 if its value was 6.
fr: Renvoyez la somme du jet de deux dés à six faces. Cependant, si noDoubles est vrai et que les deux dés ont la même valeur, incrémentez l'un des dés à la valeur suivante, en le mettant à 1 si sa valeur était 6.

source: This world is a simplistic testing environment largely inspired from the http://codingbat.com invented by Nick Parlente.
fr: Ce monde contient un environnement simpliste de tests largement inspiré de http://codingbat.com inventé par Nick Parlente.

source: The typical exercises are very short ones, aiming at improving the tactical programming abilities of the students. That is to say that you will be presented a quite long list of very little exercises about rather simple things. The idea is to train you on these issues until they become automatic to you.
fr: Les exercices classiques sont très courts, et visent à améliorer les abilités de stratégie de programmation des étudiants. C'est pour vous prévenir que vous allez faire face à une très longue liste de très petits exercices à propos de choses très simples. L'idée est de vous entrainer sur ces problèmes jusqu'à ce que cela devienne automatique.

source: In contrary to the other worlds, the BatWorld does not provide any fancy abstraction nor visualization. You have to fill a function, which gets called for a bunch of parameter sets, and that's it.
fr: Contrairement aux autres mondes, le BatWorld ne fournit pas ni de belle abstractions ni de belles visualisaitons. Vous aurez à remplier une fonction, qui sera appelée avec un tas d'ensembles de différentes paramètres, et c'est tout.

source: For more information, you should refer to the CodingBat.com documentation, which contains for example a very useful documentation on boolean operators: http://codingbat.com/doc/ifboolean.html
fr: Pour plus d'informations, vous devriez consulter la documentation de CodingBat.com qui contient par exemple une documentation très utile sur les opérateurs booléens : http://codingbat.com/doc/ifboolean.html

source: Strings are the simplest of the complex data types :) They provide several operations, such as getting the length of the string, or a substring of it..
fr: Les chaînes de caractères ("String") sont les plus simples des types de données complexes :) Elles fournissent différentes opérations, comme obtenir la logueur de la chaîne ou une sous-chaîne...

source: A very good introduction to this type is available here: http://javabat.com/doc/string.html.
fr: Une très bonne introduction à ce type est disponible ici : http://javabat.com/doc/string.html.

source: AltPairs
fr: Sans les paires

source: Given a string, return a string made of the chars at indexes 0,1, 4,5, 8,9 ... so "kittens" yields "kien".
fr: Soit une chaîne de caractères, renvoyez la chaîne composée des caractères aux index 0,1,4,5,8,9 ... par exemple "kittens" devient "kien".

source: Array123
fr: Tableau123

source: Given an array of ints, return true if .. 1, 2, 3, .. appears in the array somewhere.
fr: Soit un tableau d'entiers, renvoyez vrai si .. 1, 2, 3, .. apparaissent quelquepart dans le tableau.

source: Array667
fr: Tableau667

source: Given an array of ints, return the number of times that two 6's are next to each other in the array. Also count instances where the second "6" is actually a 7.
fr: Soit un tableau d'entiers, renvoyez le nombre de fois que deux 6 sont l'un à la suite de l'autre dans le tableau. Comptez également le nombre de fois où le deuxième "6" esten fait un 7.

source: ArrayCount9
fr: Comptage de 9

source: Given an array of ints, return the number of 9's in the array.
fr: Soit un tableau d'entiers, renvoyez le nombre de 9 dans ce tableau.

source: ArrayFront9
fr: Tableau commençant par 9

source: Given an array of ints, return true if one of the first 4 elements in the array is a 9. The array length may be less than 4.
fr: Soit un tableau d'entiers, renvoyez vrai si l'un des 4 premiers éléments dans ce tableau est un 9. Le tableau peut contenir moins de 4 éléments.

source: FrontTimes
fr: Multiplication de début

source: Given a string and a non-negative int n, we'll say that the front of the string is the first 3 chars, or whatever is there if the string is less than length 3. Return n copies of the front;
fr: Soit une chaîne de caractère et un entier n. On définit le début d'une chaîne de caractère comme les trois premiers caractères, ou tout ce qu'il y a si la chaîne a une longueur de moins de 3. Renvoyez n copies du début de la chaîne.

source: Has271
fr: Contient 271

source: Given an array of ints, return true if it contains a 2, 7, 1 pattern -- a value, followed by the value plus 5, followed by the value minus 1. Additionally the 271 counts even if the "1" differs by 2 or less from the correct value.
fr: Soit un tableau d'entiers, renvoyez vrai si il contient schéma 2,7,1 -- une valeur, suivie de cette valeur plus 5, suivie par cette valeur moins 1. En outre, le 271 compte même si le "1" diffère de 2 ou moins de la valeur correcte.

source: Last2
fr: Deux derniers

source: Given a string, return the count of the number of times that a substring length 2 appears in the string and also as the last 2 chars of the string, so "hixxxhi" yields 1 (we won't count the end substring).
fr: Soit une chaîne de caractères. Renvoyez combien de fois une sous-chaîne de longueur 2 apparait dans la chaîne et aussi en tant que 2 derniers caractères de la chaîne. Par exemple, "hixxxhi" renvoie 1 ( on ne compte pas le dernière sous-chaîne ).

source: NoTriples
fr: Pas de triplet

source: Given an array of ints, we'll say that a triple is a value appearing 3 times in a row in the array. Return true if the array does not contain any triples.
fr: Soit un tableau d'entiers, on dire qu'un triplet est une valeur qui apparait 3 fois à la suite dans le tableau. Renvoyez vrai si le tableau ne contient pas de triplet.

source: StringBits
fr: Éclats de chaîne

source: Given a string, return a new string made of every other char starting with the first, so "Hello" yields "Hlo".
fr: Étant donné une chaîne de caractères, retournez une nouvelle chaîne formée en prenant un caractère sur deux dans le paramètre, en commençant avec le premier caractère. Ainsi, "Bonjour" donne "Bnor".

source: StringMatch
fr: Comparaison de chaînes

source: Given 2 strings, a and b, return the number of the positions where they contain the same length 2 substring. So "xxcaazz" and "xxbaaz" yields 3, since the "xx", "aa", and "az" substrings appear in the same place in both strings.
fr: Soit deux chaînes de caractères a et b. Renvoyez le nombre de position où elles contiennent la même sous-chaine de longueur 2. Ainsi, "xxcaazz" et "xxbaaz" renvoient 3, puisque les sous-chaînes "xx", "aa", et "az" apparaissent dans les mêmes emplacement dans les deux chaînes.

source: StringSplosion
fr: Explosion de chaîne

source: Given a non-empty string like "Code" return a string like "CCoCodCode".
fr: Soit une chaîne de caractères non vide comme "Code". Renvoyez une chaîne de caractères comme "CCoCodCode".

source: StringTimes
fr: Multiplication de chaînes

source: Given a string and a non-negative int n, return a larger string that is n copies of the original string.
fr: Soit une chaîne et un entier n positif. Renvoyez une chaîne plus grande qui consiste en n copies de la chaîne originale.

source: StringX
fr: Chaîne X

source: Given a string, return a version where all the "x" have been removed. Except an "x" at the very start or end should not be removed.
fr: Soit une chaîne de caractère, renvoyez une version où tous les "x" ont été supprimés. Seuls les "x" au tout début ou en toute fin ne doivent pas être supprimés.

source: Suppose the string "yak" is unlucky. Given a string, return a version where all the "yak" are removed, but the "a" can be any char. The "yak" strings will not overlap.
fr: Supposer la chaîne "yak" comme malchanceuse. Soit une chaîne de caractères, renvoyez une version où tous les "yak" sont supprimées, mais le "a" peut être n'importe quel caractère. La "yak" chaîne ne sera pas pétinée.

source: The goal of this exercise is to reproduce the pattern of the first row in the other rows with a shift of one cell (see the Objective tab for details). The biggest difference between this exercise and the other we had on patterns is that you have to read the pattern (on first row) before reproducing it. You cannot do otherwise because the same code will be executed on three different worlds, each of them having its specific pattern.
fr: L'objectif de cet exercice est de reproduire le motif de la première colonne en le décalant d'une case (voir l'onglet Objectives pour plus de détails). La grande différence entre cet exercice et les précédents sur les motifs, c'est qu'il faut maintenant lire (sur la première colonne) le motif souhaité, puis le reproduire ensuite. Il est impossible de faire autrement car votre programme sera exécuté par trois buggles dans trois mondes différents, chacune ayant un motif propre à reproduire.

source: One solution is to read the next cell, and go copy it in position before comming back to read the second cell. But since it is forbiden to use the methods to teleport the buggle to a specific position (<code>setPos()</code> and similar), this approach will be a pain to implement.
fr: Une possibilité est de lire la prochaine case, puis d'aller la recopier en position, avant de revenir lire la case suivate, etc. Mais comme vous n'avez pas le droit d'utiliser les méthodes permettant de téléporter la buggle à une case particulière (<code>setPos()</code> et autres), cette façon de faire va être très pénible à mettre en place.

source: The simplest is to store the whole color pattern in an <b>array</b>.
fr: Le plus simple est de stocker l'enchainement de couleurs dans un <b>tableau</b>.

source: Arrays in Java
fr: Les tableaux en Java
