Repository: BuggleInc/PLM
Catalog: lib/l10n/*.po
Languages: fr

source: The difficulty is to make sure that <tt>danceOneStep()</tt> keeps <tt>run()</tt> informed that there is no further dance step to achieve. The simpler solution is to have a boolean function visible from both methods indicating whether there is more steps to do or if we're done. For that, we have to write out the following of any method:
fr: Le problème est de faire en sorte que <tt>danceOneStep()</tt> prévienne <tt>run()</tt> qu'il n'y a plus de pas possible. La solution la plus simple est encore d'avoir une variable booléenne visible depuis les deux fonctions indiquant s'il reste des pas à faire, ou si on a fini. On écrira donc en dehors de toute méthode :

source: Note that it is possible to write variable declarations out of any methods, but that instructions must be in a method. In Java such <i>global</i> variables are called <b>fields</b>.
fr: Notez que s'il est possible d'écrire des déclarations en dehors des méthodes, les instructions doivent obligatoirement être placées dans des méthodes. En Java, on appelle ces variables <i>globales</i> à plusieurs méthodes des <b>champs</b>.

source: Then, the <tt>danceOneStep()</tt> must be changed to update this variable to <tt>false</tt> when there is nothing more to do. For that, simply add <code>moreMusic = false;</code> before any <tt>return</tt>.
fr: Ensuite, la fonction <tt>danceOneStep()</tt> doit être modifiée pour mettre cette valeur à <tt>false</tt> quand il n'y a plus rien à faire. Pour cela, ajoutez simplement <code>moreMusic = false;</code> avant tout <tt>return</tt>.

source: It is then possible to use the following <tt>run()</tt> method:
fr: On peut alors utiliser la fonction <tt>run()</tt> suivante:

source: public void run() { while (moreMusic) danseOneStep(); }
fr: public void run() { while (moreMusic) danceOneStep(); }

source: <a name="Objectives">
fr: <a name="Objectifs">

source: Apply the improvement we just saw to rewrite your buggle code.
fr: Réécrivez le code des buggles en appliquant les améliorations que nous venons de voir.

source: You don't have to write the <tt>run()</tt> method since the buggle already know it. If you put it anyway, the compiler will complain about this multiple definition without noticing that both declarations match. Simply declare the variable <tt>moreMusic</tt> and the <tt>danceOneStep()</tt> method.
fr: Vous n'avez pas à écrire la fonction <tt>run</tt>, que les buggles connaissent déjà. Si vous tentez de la définir malgré tout, le compilateur se plaindra de trouver deux définitions de la même fonction, sans se rendre compte qu'il s'agit de la même fonction. Contentez vous de déclarer la variable <tt>moreMusic</tt> et la méthode <tt>danceOneStep()</tt>.

source: This dance step is slightly more complex but actually better looking. Beside of that, that's the same old story.
fr: Ce pas de danse est légèrement plus compliqué mais il est plus beau. En dehors de cela, c'est la même chose que précédemment.

source: Here are the ground indications to use for BDR2. Note that we can now move a buggle up to 6 cells in one dance step.
fr: Voici les indications au sol à utiliser pour BDR2. Remarquez qu'on peut maintenant avancer la buggle de 6 cases d'un coup.

source: Turn back and move one step forward
fr: Tourner en sens inverse (demi-tour) et avancer d'une case

source: Move four cells forward
fr: Avancer de quatre cases

source: Move five cells forward
fr: Avancer de cinq cases

source: Move six cells forward
fr: Avancer de six cases

source: Move four cells backward
fr: Reculer de quatre cases

source: Move five cells backward
fr: Reculer de cinq cases

source: Move six cells backward
fr: Reculer de six cases

source: When you program works again, proceed to next exercise.
fr: Quand votre programme fonctionne de nouveau, passez à l'exercice suivant.

source: After all this excitation of dance revolution, we will move on to a slower activity : the slug hunting. Your buggle just happened to found the trail of a slug: a green dribbling tracks. If it manage to follow it to its end, it will find a baggle representing an appetizing slug (from a buggle point of view).
fr: Après toute l'agitation de la dance revolution, nous allons passer à une activité plus calme : la chasse à la limace. Votre buggle a en effet trouvé par hasard la trace d'une limace : une traînée baveuse verte. Si elle parvient à la suivre jusqu'au bout, elle trouvera un baggle représentant la grosse limace si appétissante (pour une buggle).

source: To reach that goal, you have a boolean method <tt>isFacingTrail</tt>, which determine whether we are facing a green cell or not. Of course, if we are facing a wall, it returns false.In addition, this method preserve the state of the calling buggle and of the world. Such a method is said to have no <b>side effect</b>.
fr: Pour arriver au résultat, vous disposez d'une méthode booléenne <tt>isFacingTrail</tt>, qui permet de savoir si on est face à une case verte ou non. Bien sûr, si on est face à un mur, elle renvoie faux. De plus que cette méthode ne modifie ni l'état de la buggle qui l'appelle, ni celui du monde. Une telle méthode est dite <b>sans effet de bord</b>.

source: It takes the color of the trail we want to follow as an argument. Slugs leave green trails, but other prey leave trails of other colors. In Java, there is a <i>data type</i> <tt>Color</tt> to indicate the colors. The green color is defined by <code>Color.green</code>.
fr: Cette méthode prend en argument la couleur de la piste que l'on veut suivre. Les limaces laissent des traces vertes, mais d'autres proies laissent des traces d'autres couleurs. En Java, il existe un <i>type</i> <tt>Color</tt> pour désigner les couleurs. La couleur verte est définie par <code>Color.green</code>.

source: In order to hunt your prey, you should not mistake the part of the tracks to follow with the one your buggle comes from, you should ask your buggle to leave a tracks behind it. Don't forget to use the <code>brushDown()</code> method to put your brush down and <code>brushUp()</code> to move it up again.
fr: Afin d'atteindre votre proie, il ne faut pas confondre la partie de la trace à suivre avec celle que votre buggle a déjà suivie, il est conseillé à votre buggle de laisser une trace derrière ses pas. Pensez à utiliser la méthode <code>brushDown()</code> pour baisser votre crayon (et <code>brushUp()</code> pour le relever)

source: A buggle can know the color of the cell it is over using the <code>Color getGroundColor()</code> method.
fr: Un buggle peut connaître la couleur de la case sur laquelle il est positionné en utilisant la méthode <code>Color getGroundColor()</code>.

source: Finally, do not forget to capture your prey once you found it (using <code>pickUpBaggle()</code>).
fr: Enfin, n'oubliez de capturer votre proie une fois que vous l'aurez débusquée (avec <code>pickUpBaggle()</code>).

source: <a name="Objectives"> Complete the <code>hunt()</code> method (which gets called by <code>run()</code> automatically). You should use the <code>isFacingTrail()</code> method that is provided. </a>
fr: <a name="Objectifs"> Complétez la méthode <code>hunt()</code> ( qui sera appelée par la méthode <code>run()</code> automatiquement ). La méthode <tt>hunt()</tt> doit utiliser la méthode <code>isFacingTrail()</code> qui vous est fournie.

source: After all this excitation of slug hunting, we will have to learn how to track their trail. Your buggle just happened to found the trail of a slug: a green dribbling tracks. If it manage to follow it to its end, it will find a baggle representing an appetizing slug (from a buggle point of view).
fr: Après toute l'excitation liée à la chasse à la limace, nous allons apprendre comment suivre leur piste. Votre buggle a en effet trouvé par hasard la trace d'une limace : une traînée baveuse verte. Si elle parvient à la suivre jusqu'au bout, elle trouvera un baggle représentant la grosse limace si appétissante (pour une buggle).

source: To reach that goal, you had to write the previously given boolean method <tt>isFacingTrail</tt>, which should determine whether we are facing a green cell or not. Of course, if we are facing a wall, it should return false. It would be great if this method could have no <b>side effect</b>. on the calling buggle and on the world.
fr: Pour arriver au résultat, vous devez écrire la méthode booléenne <tt>isFacingTrail</tt> décrite lors de l'exercice précédent, qui permet de savoir si on est face à une case verte ou non. Bien sûr, si on est face à un mur, elle doit répondre faux. Il faudrait de plus que cette méthode soit <b>sans effet de bord</b> en ne modifiannt pas ni le buggle qui l'appelle, ni le monde.

source: Remember that this method takes the color of the trail we want to follow as an argument. Slugs leave green trails, but other prey leave trails of other colors. In Java, there is a <i>data type</i> <tt>Color</tt> to indicate the colors. The green color is defined by <code>Color.green</code>.
fr: Souvenez vous que cette méthode doit prendre en argument la couleur de la piste que l'on veut suivre. Les limaces laissent des traces vertes, mais d'autres proies laissent des traces d'autres couleurs. En Java, il existe un <i>type</i> <tt>Color</tt> pour désigner les couleurs. La couleur verte est définie par <code>Color.green</code>.

source: <a name="Objectives">Complete the <code>isFacingTrail()</code> method (which gets called by <code>hunt()</code> automatically). You don't have to write the <code>hunt()</code> method.
fr: <a name="Objectifs"> Complétez la méthode <code>isFacingTrail()</code> qui sera appelée par la méthode <code>hunt()</code> définissant le comportement par défaut de votre buggle. Vous n'avez pas à écrire la méthode <tt>hunt()</tt>.

source: We will now teach the buggle to explore its world. Its initial position is the bottom left corner, and it should visit any cells up to the top (coloring the ground on its path. The main loop of the <code>run()</code> method (that you should write) is something like:
fr: Nous allons maintenant apprendre à la buggle à explorer son monde. Sa position de départ est en bas à gauche, et elle doit visiter toutes les cases juqu'en haut (en coloriant le sol sur son passage). La boucle principale de la méthode <code>run()</code> (que vous devez écrire) est de la forme :

source: move brush down while we did not reach the final position move like a snake
fr: baisser le crayon tant que l'on est pas à la position finale avancer comme un serpent

source: The prototype of this method (its first line) must be:
fr: Le prototype de cette méthode (sa première ligne) doit être :

source: (we will come back later on the meaning of <code>public</code>). We thus have to write two methods in addition to <code>run()</code>. The former returns a boolean indicating whether we are on a final position while the latter does not return any result and move one snake step forward.
fr: (nous verrons plus tard ce que ce <code>public</code> signifie). Il faut donc écrire deux méthodes en plus de <code>run()</code>. L'une renvoit un booléen et indique si l'on se trouve à une position finale, tandis que l'autre ne renvoit pas de résultat et avance d'un pas.

source: We reached the final position if and only if:
fr: On se trouve sur une position finale si et seulement si :

source: We are facing a wall
fr: On est face à un mur

source: There is a wall on the north of the buggle. So, if the buggle is facing east, you should check whether there is a wall on the left, and if the buggle is facing west, you should check on the right side.
fr: Il y a un mur au nord de la buggle. Donc, si la buggle regarde à l'est, il faut vérifier s'il y a un mur à gauche, et si la buggle regarde à l'ouest, il faut vérifier s'il y a un mur à droite.

source: We can get the current heading of the buggle using the <code>getDirection()</code>, and we know whether it looks east using <code>getDirection() == Direction.EAST</code> (WEST for west).
fr: On obtient la direction actuelle de la buggle avec la méthode <code>getDirection()</code>, et on sait si elle regarde à l'est avec le test <code>getDirection() == Direction.EAST</code> (WEST pour ouest).

source: For the checking itself, nothing magical: you have to turn the buggle and check whether it is facing a wall afterward.
fr: Pour la vérification elle-même, rien de magique : il faut se tourner et regarder si on est face à un mur une fois tourné.

source: Then, a snake step can be achieved by moving one step forward if we are not facing a wall, and moving to the upper line else (ie, if you look to the west facing a wall, you have to turn right, forward and turn right).
fr: Ensuite un pas de serpent se fait en avancant d'un pas si l'on est pas face à un mur, et en montant à la ligne du dessus sinon (càd, si on regarde à l'ouest face à un mur, il faut tourner à droite, avancer, tourner à droite).

source: Hint: the main loop of the <code>run()</code> method must continue while the testing function returns false. Their is thus two way of writing it:
fr: Indication: la boucle principale de la méthode <code>run()</code> doit continuer tant que la fonction adéquate renvoie faux. On peut l'écrire de deux façons:

source: while (testingFunction() == false)
fr: while (fonctionTest() == false)

source: or
fr: ou bien

source: while (! testingFunction())
fr: while (! fonctionTest())

source: It works because the exclamation mark (!) means in Java a boolean negation.
fr: Cela fonctionne car le point d'exclamation en java indique une négation booléenne.

source: The goal of this serie of exercises is to let the buggle traverse its world. It must number the cells it walks on to show its traversal order.
fr: L'objectif de cette série d'exercices est de faire parcourir le monde à la buggle. Elle doit de plus numéroter les différentes cases rencontrées pour montrer son ordre de parcours.

source: The main loop of the <code>run()</code> method (that you must write) is something like:
fr: La boucle principale de la méthode <code>run()</code> (que vous devez écrire) est de la forme :

source: while we are not on the final position go to the next position label the cell with its number
fr: tant que l'on n'est pas à la position finale aller à la prochaine position marquer le numéro de case au sol

source: In contrary to the exercises we saw so far, we won't use the <code>forward()</code>, <code>backward()</code> and similar methods. Instead, we will compute the coordinate of the next buggle position and use the <code>setPos(int, int)</code> method to <i>teleport</i> the buggle directly to this position. For example, <code>setPos(3, 5)</code> teleports the buggle to the cell where x=3 and y=5.
fr: À la différence des exercices vus jusque là, nous n'allons pas utiliser les méthodes <code>forward()</code>, <code>backward()</code> et autres, mais nous allons calculer les coordonnées de la prochaine position de la buggle, et utiliser la méthode <code>setPos(int, int)</code> pour <i>téléporter</i> la buggle directement à cette position. Par exemple, <code>setPos(3, 5)</code> téléporte la buggle sur la case où x=3 et y=5.

source: Your first task is thus to write a boolean function indicating whether the buggle the final position or not, ie if it reached the bottom right corner of the world. For this, you can use <code>getWorldWidth()</code> and <code>getWorldHeight()</code> which return respectively the world's width and height. Your test is about comparing the buggle's current position (that you can access with <code>getX()</code> and <code>getY()</code>) to the world dimensions.
fr: Le premier objectif est donc d'écrire une fonction booléenne indiquant si la buggle a atteint la position finale ou non, càd si elle est arrivée en bas à droite du monde. Vous utiliserez pour cela les méthodes <code>getWorldWidth()</code> et <code>getWorldHeight()</code> qui retournent respectivement la largeur et la hauteur du monde. Votre test est de comparer les coordonnées actuelles de votre buggle (que vous pouvez retrouver avec les méthodes <code>getX()</code> et <code>getY()</code>) aux dimensions du monde.

source: Beware, the first line and column are numbered 0 and not 1...
fr: Attention, la première ligne et la première colonne sont numérotées 0 et non 1...

source: Then, you have to write the code to reach the next position. In this exercise, you have to traverse the world row after row. So, if you are at the bottom of a row, you have to move to the top of next row, and you have to move to the cell below else.
fr: Ensuite, il faut écrire le code pour aller à la position suivante. Dans cet exercice, il faut parcourir le monde colonne par colonne. Donc, si on est tout en bas d'une colonne, il faut aller en haut de la colonne suivante et sinon, il faut aller à la case du dessous.

source: At this point, you can launch your program to check that the buggle correctly traverse the world in the expected order, and that it stops when it has to. Use the <b>stop</b> button if the buggle does not stop correctly.
fr: À ce point, vous pouvez lancer votre programme pour vérifier que la buggle parcours bien le monde dans l'ordre souhaité, et s'arrête bien quand il faut. Pensez à utiliser le bouton <b>stop</b> pour arrêter l'exécution si votre programme ne se termine pas correctement.

source: It is now time to write done the cell numbers. For that, you will need a counter initialiser to zero at the begining of your <code>run()</code> method, and incremented by one at each step (for example with <code>counter++;</code>). Then, you have to write the value on the ground, for example with <code>writeMessage(counter);</code>.
fr: Il est temps d'écrire au sol les numéros de case. Pour cela, vous aurez besoin d'un compteur initialisé à zéro au début de votre méthode <code>run()</code>, et incrémenté de un à chaque pas (par exemple avec <code>cpt++;</code>). Ensuite, il faut écrire la valeur de ce compteur au sol à chaque pas, par exemple avec <code>writeMessage(cpt);</code>.

source: You probably need to write the first or last value out of the main loop, depending on whether you prefer to use a <code>while {}</code> or a <code>do {} while</code>...
fr: Il est sans doute nécessaire d'écrire la valeur de la première ou dernière case en dehors de la boucle principale, selon que vous utilisez un <code>while {}</code> ou un <code>do {} while</code>...

source: You once again have to let the buggle traverse the world numbering the cells on its way, but the goal of this exercise is to write a line traversal. Most of the code you wrote for previous exercise remains usable here. Simply, the method computing the coordinates of the next buggle position has to be correctly updated: if you are at the right of a line, you have to go to the begining of the next one. If not, you have to go to the right cell.
fr: Il faut encore faire parcourir le monde à la buggle en numérotant les cases au passage, mais l'objectif de cet exercice est d'écrire un parcours ligne par ligne. La plupart du code écrit à l'exercice précédent reste utilisable, mais la méthode calculant les prochaines coordonnées de la buggle doit être modifiée en conséquence : si l'on est tout à droite d'une ligne, il faut aller au début de la ligne précédente. Si non, il faut aller sur la case à droite.

source: This time, you are asked to traverse the world one diagonal after the other. Have a look at the objective world for more details on the requested traversal order.
fr: Cette fois, il faut parcourir le monde en diagonale. Regardez le monde objectif pour voir les détails de l'ordre de parcours demandé.

source: You may find useful to use an integer variable <code>diag</code> storing the number of the diagonal you are traversing.
fr: Il vous est recommandé d'utiliser une variable entière <code>diag</code> conservant le numéro de la diagonale que la buggle est en train de parcourir.

source: This time, you have to zigzag on the way up. Have a look at the objective world for more details on the requested traversal order.
fr: Cette fois, il faut parcourir le monde en zig-zag. Regardez le monde objectif pour voir les détails de l'ordre de parcours demandé.

source: Langton's ant
fr: La fourmi de Langton

source: In this exercise, you will turn your buggle into a <i>Langton's ant</i>. These artificial little animals are very interesting because they are given simple rules that depend only on their local environment, and after a period of apparent chaotic behavior, a general pattern <i>emerges</i>.
fr: Dans cet exercice, vous aller métamorphoser votre buggle en une <i>fourmi de Langton</i>. Ces petits animaux artificiels sont très intéressants parce qu'ils suivent des règles simples qui dépendent seulement de leur environnement local, et qu'après une période d'un comportement d'apparence chaotique, un schéma général <i>apparaît</i>

source: The rules are absolutely trivial: to compute what the next step should be, you should check the current color of the ground (using <code>getGroundColor()</code>). If it's white, change it to black, turn right and move forward by one cell. If the ground is currently black, change it to white, turn left and move forward by one cell.
fr: Les règles sont absolument triviales: pour calculer quel sera le prochain pas, vous devez regarder la couleur actuelle du sol ( en utilisant <code>getGroundColor()</code>). Si c'est blanc, changez la en noir, tournez à droite et avancez d'une case. Si la couleur du sol est le noir, changez la en blanc, tournez à gauche et avancez d'une case.

source: It's hard to come up with simpler rules isn't it? Well, let's go and code it now. You have to complete the <code>step()</code> method, which encodes the behavior of the ant at each step. You will probably use the <code>getGroundColor()</code> method to retrieve the color of the cell on which the ant is currently. To compare colors, you cannot use the equal sign (=), because these things are not scalar values but objects. Instead, you need to write something like the following:
fr: Il est difficile de trouver des règles plus simples, n'est-ce pas ? Et bien, allons-y et codons les maintenant. Vous avez à compléter la méthode <code>step()</code>, qui définit le comportement de la fourmi à chaque pas. Vous utiliserez probablement la méthode <code>getGroundColor()</code> pour récupérer la valeur de la case sur laquelle la fourmi se trouve. Pour comparer des couleurs, vous ne pouvez pas utiliser le signe égal (=), parce que les couleurs ne sont pas des valeurs scalaires mais des objets. A la place, vous aurez besoin d'écrire quelquechose comme:

source: Color c /* = some initialization */; if (c.equals(Color.black)) { /* that's equal */ } else { /* that was not equal */ }
fr: Color c /* = une initialisation*/; if (c.equals(Color.black)) { /* c'était égal */ } else { /* ce n'était pas égal */ }

source: Changing the ground color is not difficult, but a bit long: you have to change the brush color of your buggle, set the brush down (to mark the current cell -- with <code>brushDown()</code>), and set the brush back up (with <code>brushUp()</code>) to avoid further issues when the buggle will move. You are naturally free of organizing your code the way you want, but you may want to write a <code>void setGroundColor(Color c)</code> method to factorize things a bit.
fr: Changer la couleur du sol n'est pas difficile, seulement un peu long : vous avez à changer la couleur de la brosse de votre buggle, l'abaisser ( pour marquer la case courante -- avec <code>brushDown()</code>, et relever la brosse (avec <code>brushUp()</code>) pour éviter des problèmes lorsque la buggle va se déplacer. Vous être naturellement libre d'organiser votre code comme vous le souhaitez, mais vous pouvez vouloir écrire une méthode <code>void setGroundColor(Color c)</code> pour factoriser le tout.
