Repository: BuggleInc/PLM
Catalog: lib/l10n/*.po
Languages: fr

source: This world implements the baseball game, in which several players want to go back to their bases. The bases make a circle and have their own colors. There are two players for one base, except one, which has only one player in its team. You are asked to make the players go on the bases which colors correspond to theirs. The only allowed move is for one of the two players standing on one of the two bases which are directly next to the base with only one player to move and fill the hole, leaving a new one on the base it just left.
fr: Ce monde implémente le jeu du baseball multicolore, dans lequel plusieurs joueurs veulent retourner à leur base. Les bases sont dans une disposition circulaire et ont leur propre couleur. Il y a deux joueurs pour toutes les bases sauf une, qui ne dispose donc que d'un joueur dans son équipe. Il vous est demandé de déplacer les joueurs jusqu'à la base qui a la même couleur que la leur. Le seul mouvement autorisé est, pour l'un des deux joueurs présents sur l'une des deux bases située à côté de la base ayant un seul joueur de se déplacer et de remplir le trou, laissant un nouveau trou sur la base qu'il vient de quitter.

source: Memento:
fr: Notes:

source: The color of a base is given by its index.
fr: La couleur d'une base est donnée par son index.

source: The hole has a color of -1.
fr: Le trou a une couleur de -1.

source: The base which has only one player on the field has <i>getAmountOfBases()-1</i> as index
fr: La base qui a un seul joueur sur le terrain a <i>getAmountOfBases()-1</i> comme index

source: There are six methods provided :
fr: Six méthodes vous sont fournies :

source: Return the color of the player on position <code>playerLocation</code> ( 0 or 1 ) from the base <code>baseIndex</code>. The color -1 is the hole.
fr: Renvoie la couleur du joueur à la position <code>playerLocation</code> ( 0 ou 1 ) de la base <code>baseIndex</code>. La couleur -1 correspond au trou.

source: Show Tip 1 ( the methods's prototype)
fr: Montrer l'indice 1 ( le prototype des méthodes à utiliser)

source: The prototypes of the methods you may use are the followings :
fr: Les prototypes des méthodes que vous pouvez utiliser sont les suivants :

source: Move the player in position <code>playerSrc</code> of the base <code>baseSrc</code> to the position <code>playerDst</code> from the base <code>baseDst</code>
fr: Déplace le joueur de la position <code>playerLocation</code> de la base <code>baseSrc</code> à la position <code>playerDst</code> de la base <code>baseDst</code>.

source: Return the base's number and the position of the nearest player which has<code>colorWanted</code> as color. It begins the search at the base <code>firstBaseToSearch</code>
fr: Renvoie l'index de la base et la position sur celle-ci du joueur le plus proche ayant <code>colorWanted</code> comme couleur. La recherche commence à la base d'index <code>firstBaseToSearch</code>

source: Bring the hole to the position <code>playerDst</code> from the base <code>baseDst</code> while protecting the position <code>playerToProtect</code> during the travel
fr: Amène le trou à la position <code>playerDst</code> de la base <code>baseDst</code> tout en protégeant la position <code>playerToProtect</code> durant le trajet

source: Show Tip 2 (Pseudo-code of solve)
fr: Montrer l'indice 2 (le pseudo-code de la fonction solve)

source: The algorithm of the solve method is the following:
fr: L'algorithme de la méthode solve est le suivant :

source: Show Tip 3 ( Pseudo-code of bringHole )
fr: Montrer l'indice 3 (le pseudo-code de bringHole)

source: The algorithm of the bringHole method is the following:
fr: L'algorithme de la méthode bringHole est le suivant :

source: Show Tip 4 ( Pseudo-code of findNearestPlayer)
fr: Montrer l'indice 4 (le pseudo-code de findNearestPlayer)

source: The algorithm of the findNearestPlayer method is the following :
fr: L'algorithme de la méthode findNearestPlayer est le suivant :

source: Show tip 5 ( Pseudo-code of bringPlayerHome)
fr: Montrer l'indice 5(le pseudo-code de bringPlayerHome)

source: The algorithm of the bringPlayerHome method is the following :
fr: L'algorithme de la méthode bringPlayerHome est le suivant :

source: Like the previous world, this world implements a baseball world. But now, you have more than two players on each base. Like before, your mission is to bring everyone home.
fr: A l'instar du monde précédent, ce monde implémente un monde de baseball. Mais maintenant, vous avez plus de deux joueurs sur chaque base. Comme auparavant, votre mission est d'amener chaque joueur à sa base.

source: This exercise is trying to show you one thing : you have to do a change that you haven't anticipated, and you need to make this change without breaking your code and without changing too many thing, because the algorithm is still great.
fr: Cet exercice essaye de vous montrer une chose : vous avez à faire un changement que vous n'aviez pas anticipé, et il faut le faire sans casser votre code et sans le modifier trop en profondeur, puisque votre algorithme est toujours correct.

source: The previous algorithm was only able to deal with two players per base, you have to change it so you can handle n players per base, with n greater or equals at two.
fr: L'algorithme précédent était seulement capable de gérer deux joueurs par base, vous avez à le modifier afin qu'il puisse gérer n joueurs par base, avec n supérieur ou égal à deux.

source: You can be wondering why you didn't have to write directly an flawless algorithm. It's just that sometimes, it's way too hard. Sometimes, you just need to take a particular case and generalize your solution. It's sometimes easier to generalize than to try to find a general algorithm from scratch. Remember that improving is way more easier than creating.
fr: Vous pouvez vous demander pourquoi vous n'avez pas eu à écrire directement un algorithme sans ce défaut. C'est juste que parfois, c'est beaucoup trop difficile. Parfois, il suffit de prendre un cas particulier et de généraliser la solution. C'est bien souvent plus simple de généraliser que de trouver un algorithme général à partir de rien. Souvenez-vous qu'améliorer est plus facile que créer.

source: You can have access to the number of locations available on each base by using the getLocationsAmount() method.
fr: Vous pouvez avoir accès au nombre de positions disponibles sur chaque base en utilisant la méthode getLocationsAmount().

source: There are seven methods provided :
fr: Sept méthodes vous sont fournies :
