Repository: BuggleInc/PLM
Catalog: lib/l10n/*.po
Languages: fr

source: We saw that CocktailSort improve a bit for turtles (i.e. small values near to the end of the array), but it is still possible to achieve better. ComboSort comes down to providing them a short cut: instead of comparing adjacent values, we compare values separated by a gap bigger than 1. That way, turtles we traverse <i>gap</i> cells at each traversal. Naturally, we have to apply the algorithm with decreasing gaps, and finish with <i>gap=1</i> to ensure that the array is correctly sorted afterward. Choosing the right gap and how to decrease it is a difficult question, but in practice, dividing it by 1.3 after each traversal leads to good performance. Here is the corresponding pseudo-code:
fr: Nous avons vu que le tri cocktail permet d'améliorer un peu les choses pour les tortues (ie, les petites valeurs près de la fin du tableau), mais on peut faire mieux. CombSort revient à leur faire prendre un racourci: Au lieu de comparer les valeurs adjacentes, on compare des valeurs séparés par un écart plus grand que 1. Ainsi, les tortues vont se déplacer de <i>ecart</i> cases à chaque parcours. Bien entendu, il faut appliquer l'algorithme avec des écarts de plus en plus petit et terminer avec <i>ecart=1</i> pour s'assurer que le tableau est entièrement trié à la fin. Choisir comment réduire l'écart entre les parcours est une question difficile (voir wikipédia en anglais sur le thème), mais en pratique, le diviser par 1.3 à chaque fois amène de bons résultats. Voici le pseudo-code correspondant :

source: gap = len; do if gap>1 then gap = gap / 1.3 i = O while i+gap &lt; len do: if i and i+gap must be swapped, do it increase i by the gap while the gap is bigger than 1 or the last traversal swapped at least one pair
fr: ecart = lgr; faire si ecart>1 alors ecart = ecart / 1.3 i = O tant que i+ecart &lt; lgr faire: si i et i+ecart doivent être inversés, le faire ajouter ecart à i tant que l'écart est plus grand que 1 ou que le dernier parcours a inversé au moins un élément

source: This algorithm was invented by Wlodek Dobosiewicz in 1980, and later rediscovered and popularized by Stephen Lacey and Richard Box, who described it in Byte Magazine in April 1991.
fr: Cet algorithme a été inventé par Wlodek Dobosiewicz en 1980 et redécouvert et popularisé par Stephen Lacey et Richard Box, qui l'ont décrit dans le magazine Byte d'avril 1991.

source: The authors of this algorithm observed that the performance is increased if we make sure that the last values of the gap are (11, 8, 6, 4, 3, 2, 1) rather than (9, 6, 4, 3, 2, 1) or (10, 7, 5, 3, 2, 1). Rework the code of CombSort to ensure just after the gap update that if it is 9 or 10, we should use 11 instead.
fr: Les auteurs de l'algorithme ont constaté que l'on améliore les performances en s'assurant que les dernières valeurs de l'écart sont (11, 8, 6, 4, 3, 2, 1) plutôt que (9, 6, 4, 3, 2, 1) ou (10, 7, 5, 3, 2, 1). Reprenez donc le code de CombSort, et indiquez juste après la mise à jour de l'écart que si la valeur est 9 ou 10, il faut utiliser 11 à la place.

source: The Gnome sort is similar to insertion sort, but the elements are moved in position by a serie of swaps just like in bubble sort. It is named after the supposed behavior of garden gnomes when they sort flower pots. Here is a description of the algorithm by its author:
fr: Le tri du gnome s'apparente au tri par insertion, à ceci près que les éléments sont déplacés par une série d'échange comme dans le tri à bulle. Le nom vient du comportement supposé des gnomes des jardins quand ils rangent une série de pots de fleurs. Voici la description de l'algorithme par son auteur:

source: Gnome Sort is based on the technique used by the standard Dutch Garden Gnome (Du.: tuinkabouter). Here is how a garden gnome sorts a line of flower pots. Basically, he looks at the flower pot next to him and the previous one; if they are in the right order he steps one pot forward, otherwise he swaps them and steps one pot backwards. Boundary conditions: if there is no previous pot, he steps forwards; if there is no pot next to him, he is done. <i>—Dick Grune</i>
fr: L'algorithme de tri Gnome repose sur la manière habituelle de travailler des Nains de Jardin Hollandais Garden(Du.: tuinkabouter). Voici comment les nains de jardin trient une ligne de pots de fleurs.Le nain regarde le pot de fleur qui est à côté de lui et il regarde également le pot de fleurs précédent; si ces deux pots sont alignés dans le bon ordre, le nain se déplace en avant d'un pot de fleurs, sinon il les échange et se déplace en arrière d'un pot de fleur. Condition d'arrêt : si il n'y a pas de pot de fleurs précédent, le nain avance ; si il n'y a pas de pot suivant alors il a terminé sa tâche.

source: Recursive algorithms
fr: Algorithmes récursifs

source: This lesson allows to experiment with recursive algorithms.
fr: Cette leçon vous permet d'expérimenter avec des algorithmes récursifs.

source: If you need more recursive algorithms, an exercise on recursive sorting algorithms (in particular QuickSort and MergeSort) is planned in the future within the sorting lesson.
fr: Si vous cherchez d'autres algorithmes récursifs, un exercice sur les tris récursifs (en particulier QuickSort et MergeSort) est prévu à l'avenir dans la leçon sur les tris.

source: The small cousines of Buggles
fr: Les petites cousines des Buggles

source: Today, we will meet the small cousines of the buggles: the turtles. In fact, turtles are much olders than the buggles. They were invented in the 70's by a scientific from MIT called Seymour Papert to help teaching programming, and the buggles are a variation on the idea invented by Lyn Turbak from Wellesley College later.
fr: Aujourd'hui, nous allons faire la connaissance des petites cousines des buggles : les tortues. En fait, les tortues sont bien plus vieilles que les buggles. Elles ont été inventées dans les années 70 par un scientifique du MIT nommé Seymour Papert pour aider à l'enseignement la programmation, et les buggles sont une variation sur le thème inventée par Lyn Turbak du Wellesley College plus tard.

source: Turtles are thus a bit like buggles, but smaller. Just like buggles, you can order them to move forward, to turn, to move backward, etc. Just like buggles, they leave a line on their path when they move (but the line is much smaller).
fr: Les tortues sont donc un peu comme les buggles, en plus petit. Comme les buggles, vous pouvez leur demander d'avancer, de tourner, de reculer, etc. Comme les buggles, elles laissent une trace sur leur passage quand elles avancent (simplement, le trait est bien plus fin).

source: The main difference is that where buggles can only move of right angles, turtles can move of any arbitrary angles specified by a real number (a double). This gives them much more liberty in their movings. The buggles can do several other tricks, like reading and writting messages, picking or dropping objects, and there is sometimes walls in their worlds (but all this is completely above the capacities of turtles).
fr: La principale différence est que là où les buggles ne peuvent tourner que de quarts de tour, les tortues peuvent tourner d'un angle quelconque précisé par un nombre réel (double). Cela leur donne bien plus de liberté dans leur mouvement. Les buggles savent faire plusieurs trucs qui échappent aux tortues, comme lire et écrire des messages sur le sol ou ramasser des objets, et il y a parfois des murs dans leur univers, mais tout cela dépasse complètement les tortues.

source: From a practical point of view, most of the methods you knew about buggles still work with turtles, with some minor adaptations. In particular, the <code>forward()</code> method takes the amount of steps to do as a double (see "About this world" for more details).
fr: D'un point de vue pratique, la plupart des méthodes que vous connaissez à propos des buggles fonctionnent également avec les tortues, à quelques variantes près. En particulier, la méthode <code>forward</code> prend en argument le nombre de pas donné comme un nombre double (voir "About this world" dans le menu pour plus de détails).

source: Doubles? But what is it?
fr: Des doubles ? Mais qu'est ce que c'est ?

source: It's simply a point number. Example:
fr: C'est simplement un nombre à virgule. Exemple:

source: double x = 3.72; x + 1.234 // Value = 4.954 x + 2 // Value = 5.72 (2 converted to 2.0 automatically) x * 2 // Value = 7.44 (2 converted to 2.0 automatically) x / 2 // Value = 1.86 (2 converted to 2.0 automatically) (int) x // Value = 1 (“casting to int”, converted to integer by truncating) Math.round(x) // Value = 2 (1.86 rounded to nearest integer) Math.floor(x) // Value = 1 (1.86 rounded toward minus infinity) Math.floor(-5.12) // Value = -6 (rounded toward minus infinity) Math.ceiling(x) // Value = 2 (1.86 rounded toward plus infinity) Math.ceiling(-5.12) // Value = -5 (rounded toward plus infinity) (double) 17 // Value = 17.0 (“casted to double”, converted to double)
fr: double x = 3.72; x + 1.234 // Valeur = 4.954 x + 2 // Valeur = 5.72 (2 converti en 2.0 automatiquement) x * 2 // Valeur = 7.44 (2 converti en 2.0 automatiquement) x / 2 // Valeur = 1.86 (2 converti en 2.0 automatiquement) (int) x // Valeur = 1 (“transtypage en int”, converti en entier en tronquant) Math.round(x) // Valeur = 2 (1.86 arrondi à l'entier le plus proche) Math.floor(x) // Valeur = 1 (1.86 arrondi en direction de moins l'infini) Math.floor(-5.12) // Vale = -6 (Arrondi en direction de moins l'infini) Math.ceiling(x) // Value = 2 (1.86 arrondi en direction de plus l'infini) Math.ceiling(-5.12) // Value = -5 (Arrondi en direction de plus l'infini) (double) 17 // Value = 17.0 (“transtypage en double”, converti en double)

source: Goal of this exercise
fr: Objectif de l'exercice

source: Even if this is the first exercise on the recursivity lesson, the code you have to write is not recursive. The goal is to get familiar with the turtle world before getting on serious matter.
fr: Bien que ce soit le premier exercice de la leçon sur la récursivité, le code que vous devez écrire n'est pas récursif. L'objectif est de se familiariser avec le monde des tortues avant d'attaquer les choses sérieuses.

source: You must reproduce a simple geometrical painting constituted of four 100 steps long squares (see the objective world for more details). It is obviously a good idea to write a method to draw a square, and then use it in your <code>run()</code> in charge of doing the work. You must absolutely write at least the run method, which prototype is the following:
fr: Vous devez reproduire une forme géométrique simple faite de quatre carrés de longueur 100 de coté (voir le monde objectif pour plus de détails). C'est sans doute une bonne idée d'écrire une méthode pour faire un carré, et de la réutiliser lors de l'écriture de la méthode <code>run()</code> qui fait le travail. Il est indispensable d'écrire au moins la méthode run, dont le prototype est le suivant:

source: public void run() { // write here what your turtle is supposed to do }
fr: public void run() { // ecrivez ici ce que doit faire votre tortue }

source: Fractal of polygons
fr: Fractales de polygones

source: The fractal we will now draw is formed of a polygon, with little polygons on each corner. The prototype of the method drawing it is the following:
fr: La fractale que nous allons dessiner maintenant est formée d'un polygone auquel sont ajoutés des petits polygones sur chaque angle. Le prototype de la fonction le traçant est le suivant:

source: Have a look at each world's objective view to understand how to write the function.
fr: Consultez les objectifs de chaque monde pour comprendre comment écrire la fonction.

source: Snow flake
fr: Flocons de neige

source: We will now draw snow flakes using the Koch fractal. A fractal is a geometrical pattern repeated at every scale.
fr: Nous allons maintenant dessiner des flocons de neige en utilisant la fractale de Koch. Une fractale est un dessin géométrique dont le motif se reproduit à n'importe quelle échelle.

source: The general form is a triangle, with each side given by a serie of recursive calls. The general form is given by something like this:
fr: La forme générale est un triangle dont chaque coté est donné par une série d'appels récursifs. La forme générale est obtenue en enchainant trois cotés de la façon suivante.

source: Observe the drawing in each world's objective to understand the pattern's logic, and then reproduce it. You must write the <code>snowSide()</code> method, which is recursive.
fr: Observez le dessin dans chaque monde objectif pour comprendre la logique de ce motif afin de la reproduire. Vous devez écrire la fonction snowSide, qui est récursive.

source: Turtles in the stars
fr: Tortues dans les étoiles

source: This is the last hand-on turtles exercise before recursion. The goal is to draw three 5-branches stars. Like any regular stars with N branches, the angle at each external corners are 360/N degrees while the angles between branches are of 2*360/N degrees.
fr: Voici un dernier exercice de prise en main avant la récursion. Il s'agit de faire dessiner trois étoiles à 5 branches à la tortue. Comme toutes les étoiles régulières à N branches, les angles des pointes sont de 360/N degrés tandis que les angles entre les pointes sont de 2*360/N degrés.

source: The first star to draw is black (<code>Color.black</code>) and its branches are 100 steps long. The second is blue (<code>Color.blue</code>) and its branches are 80 steps long. It's shifted of 45 degrees from the first one. The last star is red (<code>Color.red</code>), its branches are 60 steps long and it's shifted of 45 degrees from the previous one.
fr: La première étoile à dessiner est noire (<code>Color.black</code>) et ses branches font 100 pas de longueur, la seconde est bleue (<code>Color.blue</code>) et ses branches font 80 pas de longueur. Elle est décallée de 45 degrés vers le bas par rapport à la première. La dernière étoile est rouge (<code>Color.red</code>), ses branches font 60 pas, et elle est décallée de 45 degrés par rapport à la seconde.

source: Observe the world's objective to visualize the picture to draw.
fr: Consultez l'objectif du monde pour visualiser la figure à réaliser.

source: Three little circles
fr: Trois petits cercles

source: As we saw (and as you can check in the documentation of this world under "About this world"), turtles can only draw straight lines. Despite of this, the goal of this world is to draw circles... This can be achived simply by realizing that a circle can be seen as a concatenation of very little segments.
fr: Comme nous l'avons vu (et comme vous pouvez le vérifier en consultant l'aide de ce monde dans le menu "À propos de ce monde"), les tortues ne savent que se déplacer en ligne droite. Et pourtant, l'objectif de cet exercice est de leur faire dessiner des cercles... On peut pourtant résoudre ce problème simplement en réalisant qu'un cercle peut être représenté comme une concaténation de petits segments.

source: Differential calculus would even argue that a circle is the asymptotical limit of such construct when the size of each segment becomes infinitely small while their amount becomes infinitely large (but it is still possible to solve this exercise without understanding differential calculus).
fr: Les amateurs de calcul différentiel diraient même sans doute qu'un cercle est la limite asymptotique d'une telle construction quand la taille des segments tend vers zéro alors que leur nombre tend vers l'infini (mais on peut tout de même réussir l'exercice sans maîtriser le calcul différentiel).

source: Write a function drawing a circle, taking the size of each of the 360 segments as parameter. Then use it in your <code>run()</code> method to draw the whole picture. The first circle is obtained with segments of size 0.5, the second with segments of size 1 and the last one with 1.5-long segments. Once again, this is a hand-on exercise, no recursion is needed.
fr: Écrivez une fonction dessinant un cercle, avec la taille de chacun des 360 pas passée en paramètre. Utilisez la ensuite dans votre méthode <code>run()</code> pour réaliser la figure dans son ensemble. Le premier cercle s'obtient avec des pas de 0.5, le second avec des pas de 1 et le troisième avec des pas de 1.5. Encore une fois, il s'agit d'un exercice de prise en main, et aucune récursion n'est nécessaire.

source: Trees
fr: Arbres

source: We will now draw trees. For that, we will write a method using double recursion following this prototype
fr: Nous allons maintenant dessiner des arbres. Pour cela, nous allons écrire une fonction doublement récursive de prototype

source: To draw a tree of four levels, you have to draw a trunk of the given length, turn right of the given angle, draw a tree of level 3, turn left twice of the given angle, draw another tree of level 3, and come back to your initial location.
fr: Pour dessiner un arbre à quatre étages, il faut dessiner un tronc de la taille indiquée, tourner à droite de l'angle indiqué, faire un arbre à 3 étages, tourner à gauche de deux fois l'angle indiqué, faire un autre arbre à 3 étages, puis revenir à sa position initiale.

source: If a tree's trunk is of length 'len', the trunk of the next level tree will be of length 'len*shrink'.
fr: Si le tronc d'un arbre mesure length à l'étage N, il mesure shrink*length à l'étage N+1.

source: Sierpinski's Triangle
fr: Triangle de Sierpinski

source: The fractal we will now draw is formed of a big triangle inside which several smaller triangles are embeeded. The prototype of the fuction to draw it is the following:
fr: La fractale que nous allons dessiner maintenant est formée d'un triangle dans lequel sont imbriqués des triangles plus petits. Le prototype de la fonction le traçant est le suivant :

source: Spirals
fr: Spirales

source: We will now draw our first recursive function with the turtle. The goal is to draw different kind of spirals with the same function, which prototype is the following:
fr: Nous allons maintenant écrire notre première fonction récursive avec les tortues. L'objectif est de dessiner des spirales de différentes formes avec la même fonction, dont le prototype est le suivant:

source: To help you understanding how to write it, here is an example of how the parameters change during one specific call:
fr: Pour vous aider à comprendre comment l'écrire, voici un exemple de la suite des différentes valeurs prises par les paramètres dans un cas:

source: Dragon curve (1)
fr: Courbe du Dragon (1)

source: The dragon curve is a classical example of recursive method.
fr: Un exemple classique de la méthode récursive est la courbe du Dragon.

source: The definition of this curve is the following:
fr: La définition de cette courbe est la suivante :

source: the dragon curve of order 1 is a vector between to arbitrary points P and Q,
fr: la courbe du Dragon d'ordre 1 est un vecteur entre deux points quelconques P et Q,

source: the dragon curve of order n is the dragon curve of order n-1 between P and R, followed by the same curve of order n-1 between R and Q (reverse side), where PRQ is an isoscele triangle with angle R being a right angle, and R being at the right of the PQ vector. Thus, if P and Q coordinates are (x, y) and (z, t), the coordinate (u, v) of R are given by:
fr: la courbe du Dragon d'ordre n est la courbe du Dragon d'ordre n-1 entre P et R suivie de la même courbe d'ordre n-1 entre R et Q (à l'envers), où PRQ est le triangle isocèle rectangle en R, et R est à droite du vecteur PQ. Donc, si P et Q sont les points de coordonnées (x, y) et (z,t), les coordonnées (u, v) de R sont

source: The prototype of the method drawing the curve is the following:
fr: Le prototype de la méthode traçant la courbe est le suivant :

source: You should use the method <code>setPos(x,y)</code> to put your turtle at coordinates (x,y) and the method <code>moveTo(z,t)</code> to draw a line between the turtle position and the point (z,t).
fr: Vous utiliserez la méthode <code>setPos(x,y)</code> pour déplacer votre tortue aux coordonnées (x,y) et la méthode <code>moveTo(z,t)</code> pour tracer un trait depuis le point où la tortue est positionnée vers le point de coordonnées (z,t)

source: The dragon curve (2)
fr: Courbe du Dragon (2)

source: Previous solution induce that the turtle teleports to other location, or at the very least, that it moves its pen up during the drawing. Indeed, the end of the drawing of the first recursive call does not match the begining of the second recursive call. That is why we had to use the method <code>setPos()</code>
fr: La solution précédente nécessite que la tortue se téléporte, autrement dit, qu'il est parfois nécessaire de lever le crayon pour tracer la courbe. En effet, entre la destination du trait tracé par le premier appel récursif ne correspond pas à la source du trait qui doit être tracé par le second appel récursif. C'est pourquoi il était nécessaire d'utiliser la méthode <code>setPos()</code>

source: In this lesson, you will write a recursive method allowing to draw the dragon curve without taking the pen up. For that, we need another recursive method drawing the mirror side of the curve.
fr: Dans cette leçon, vous allez donc réaliser une méthode récursive qui permet de tracer la courbe du dragon sans lever le crayon. Pour ce faire, vous définirez une seconde méthode récursive qui trace la courbe à l'envers.

source: The method <code>dragon()</code> is then recursively defined using itself and <code>dragonReverse()</code>. Likewise, the method <code>dragonReverse()</code> is defined recursively using itself and <code>dragon()</code>. This is thus an example of <i>mutual recursion</i>.
fr: La méthode <code>dragon()</code> sera définie récursivement en fonction des méthodes <code>dragon()</code> et <code>dragonInverse()</code>. De même, la méthode <code>dragonInverse()</code> sera définie récursivement en terme de <code>dragon()</code> et de <code>dragonInverse()</code>. Voici un bien bel exemple de <i>récursivité croisée</i>.

source: The prototype of the <code>dragon()</code> method remains unchanged from previous exercise:
fr: Le prototype de la méthode <code>dragon()</code> reste le même que précédemment :

source: The new point's coordinate (u, v) introduced by the <code>dragon()</code> are:
fr: Les coordonnées (u, v) du nouveau point introduit par la méthode <code>dragon()</code> seront :

source: The prototype of the method <code>dragonReverse</code> is similar:
fr: Le prototype de la méthode <code>dragonInverse()</code> est identique : :

source: void dragonReverse(int ordre, double x, double y, double z, double t)
fr: void dragonInverse(int ordre, double x, double y, double z, double t)

source: The new point's coordinate (u, v) introduced by the <code>dragonReverse()</code> are:
fr: Les coordonnées (u, v) du nouveau point introduit par la méthode <code>dragonInverse()</code> seront :

source: To make the work of each method recursiv more visible, the line painted by the <code>dragon()</code> must be red (<code>Color.red</code>) while the line painted by the <code>dragonReverse()</code> must be blue (<code>Color.blue</code>).
fr: Afin de rendre, plus visible le travail de chacune des deux méthodes récursives, le trait tracé par la méthode <code>dragon()</code> devra être rouge (<code>Color.red</code>) et le trait tracé par la méthode <code>dragonInverse</code> devra être bleu (<code>Color.blue</code>).

source: Drawing spirals
fr: Faire des spirales

source: Can you reproduce the provided patterns of this exercise using the <code>spiral()</code> method?
fr: Saurez-vous faire les différents motifs de cet exercice en utilisant la méthode <code>spiral()</code>?
