Repository: BuggleInc/PLM
Catalog: lib/l10n/*.po
Languages: fr

source: Our new run() method will consist in two modes: our buggle will alternate between the "north runner mode" and the "left follower mode". You begin in "north runner mode", and switch to "left follower" when you have a wall at the north (do not forget to make sure you have a wall at your left before switching to "left follower" mode). You switch to "north runner" as soon as your buggle is facing north and is not in front of a wall during its trip around its left wall. The easiest way to write such a state machine is something like
fr: Notre nouvelle méthode run() va consister en deux états: notre buggle va alterner entre le mode "north runner" et le mode "left follower". Vous commencerz dans le mode "north runner", et vous passerez au mode "left follower" quand il y aura un mur au nord ( n'oubliez pas de vous assurez d'avoir un mur à votre gauche avant de changer de passer au mode "left follower"). Vous repasserez au mode "north runner" dès que votre buggle fera face au nord et qu'elle n'est pas face à un mur. La manière la plus simple d'écrire une telle machine à état est quelque chose du type

source: Don't forget to let the buggle pick the baggle at the end of your code.
fr: N'oubliez pas de faire ramasser le baggle par votre buggle à la fin de votre code.

source: You're up. That should be enough for you to figure out how to escape this maze, but if not, you can always request for the tip. But you do not need any more help, do you?
fr: Vous êtes prêts. Tout ceci devrait suffire pour vous permettre de trouver comment sortir de ce labyrinthe, mais si ce n'est pas le cas, vous pouvez toujours demander l'astuce. Mais vous n'avez plus besoin d'aide, n'est-ce pas ?

source: Basic Shortest Path algorithm
fr: Algorithme basique de rechercher du plus court chemin

source: To conclude with this introductory lesson to maze solving algorithms, we will investigate another way to find the exit. The buggle in this lesson is a special buggle: he is a jedi. He can feel the Force. This means he is able to feel his environment.
fr: Pour conclure avec cette leçon d'introduction aux algorithmes de sortie de labyrinthe, nous allons étudier un autre moyen de trouver la sortie. Le buggle de cette leçon est spécial : c'est un jedi. Il eut ressentir la Force. Cela signifie qu'il peut ressentir son environnement.

source: By using method <code>BuggleWorld getMyWorld()</code> he can retrieve information about the world he is leaving in.
fr: En utilisant la méthode <code>BuggleWorld getMyWorld()</code> il peut récupérerdes informations à propos du monde où il vit.

source: A <code>BuggleWorld</code> object is an object on which you can perform the following operations:
fr: Un objet <code>BuggleWorld</code> est un objet Java sur lequel vous pouvez effectuer les opérations suivantes :

source: <code>int getHeight()</code> to know the height of the world.
fr: <code>int getHeight()</code> pour connaitre la hauteur du monde.

source: <code>int getWidth()</code> to know the width of the world.
fr: <code>int getWidth()</code> pour connaitre la largeur du monde

source: <code>BuggleWorldCell getCell(int x, int y)</code> to retrieve the <code>BuggleWorldCell</code> object located at a specific position in the world.
fr: <code>BuggleWorldCell getCell(int x, int y)</code> pour récupérer l'objet <code>BuggleWorldCell</code> localisé à une position donnée dans le monde.

source: A <code>BuggleWorldCell</code> is an object that represents a cell of the world. On an object of this type, it is possible to call the following methods:
fr: Un objet <code>BuggleWorldCell</code> est un objet Java qui représente une case du monde. Sur un objet de ce type, il est possible d'appeler les méthodes suivantes :

source: <code>boolean hasContent()</code> to know if something is written on the floor of this cell.
fr: <code>boolean hasContent()</code> pour savoir si quelquechose est écrit sur le sol de cette case.

source: <code>void setContentFromInt(int v)</code> to write an integer value on the floor of this cell.
fr: <code>void setContentFromInt(int v)</code> pour écrire une valeur entière sur le sol de cette case.

source: <code>int getContentAsInt()</code> to retrieve the integer value which is written on the floor of this cell.
fr: <code>int getContentAsInt()</code> pour récupérer la valeur entière qui est sur le sol de cette case.

source: <code>void emptyContent()</code> to clean the floor of this cell.
fr: <code>void emptyContent()</code> pour nettoyer le sol de cette case.

source: <code>boolean hasTopWall()</code> to know if a wall is built on the top edge of this cell.
fr: <code>boolean hasTopWall()</code> pour savoir si un mur a été construit sur le côté supérieur de la case.

source: <code>boolean hasLeftWall()</code> to know if a wall is built on the left edge of this cell.
fr: <code>boolean hasLeftWall()</code> pour savoir si un mur a été construit sur le côté gauche de la case.

source: <code>boolean hasBaggle()</code> to know if a baggle is present on this cell.
fr: <code>boolean hasBaggle()</code> pour savoir si un baggle est présent sur la case.

source: It has to be noted that it is not possible to build a wall on the bottom edge or on the right edge of a cell. Therefore when such wall exists, it means it was built on a sibling cells -- as a top (respectively left) wall on the cell that is located below (respectively at the right of) the current cell.
fr: Il est bon de noter qu'il n'est pas possible de construire un mur sur la côté inférieur ou droit d'une case.Néanmoins, quand de tels murs existents, cela signifie qu'il a été construit sur une case voisine -- comme mur supérieur ( respectivement gauche ) sur la case qui est située en dessous ( respectivement sur la droite ) de la case courante.

source: <a name="Objective"/>Write a method <code>evaluatePaths()</code> which computes a very basic shortest path algorithm. This algorithm will write on each world cell (or at least the one that are useful) the distance from this cell to the maze exit.
fr: <a name="Objective"/>Ecrivez une méthode <code>evaluatePaths()</code> qui implémente une version basique de l'algorithme de recherche du plus court chemin. Cet algorithme écrira sur chaque case du monde ( ou au moins sur celles qui sont nécessaires ) la distance qu'il y a de la case à la sortie du labyrinthe.

source: To achieve this objective, your algorithm has to find the exit of the maze on the map. Then, for every cells next to the cell where the exit is located, it has to mark these cells with a integer value of 1 (indicating the distance). Then, it has to iterate the same process to mark the cells which are at a distance of 2 and so on until it marks the cell where the buggle is located.
fr: Pour parvenir à cet objectif, votre algorithme devra trouver la sortie du labyrinthe sur la carte. Ensuite, pour chaque case à côté de la case où se situe la sortie, il devra marquer cette case avec une valeur entière de 1 ( indiquant la distance ). Ensuite, il faudra itérer ce processus pour marquer les cases qui sont à une distance de 2 et jusqu'à marquer la case où se situe le buggle.

source: Write a method <code>followShortestPath()</code> that will make the jedi buggle to follow the shortest path. Basically the buggle has only to walk on each case with the lesser distance from the exit. You can use the method <code>void setDirection(Direction d)</code> to make your buggle look at the specific direction such as <code>Direction.NORTH</code> or <code>Direction.EAST</code>.
fr: Ecrivez une méthode <code>followShortestPath()</code> qui permettra au buggle jedi de suivre le plus court chemin. Basiquement, le buggle a seulement à suivre la case ayant la plus petite distance à la sortie. Vous pouvez utiliser la méthode <code>void setDirection(Direction d)</code> pour faire regarder votre buggle dans une direction spécifique comme <code>Direction.NORTH</code> ou <code>Direction.EAST</code>.

source: I'm lost now. Please give me some extra indications.
fr: Je suis perdu, je voudrais plus d'indications

source: Use the Force Luke!
fr: Utilises la Force Luke !

source: Finding the walls to follow
fr: Trouver les murs à longer

source: This is exactly the same maze than before, but the buggle does not start at the same location. In particular, it does not have any wall to its left at the beginning.
fr: C'est exactement le même labyrinthe que précédemment, mais le buggle ne commence plus au même emplacement. En particulier, il n'a plus de mur à sa gauche dès le départ.

source: As a result, the method you wrote for the previous exercise probably don't work for this one. If you click on the run button with no modification, your buggle probably start looping over the four free cells around its start position (if that's not the case, well, you didn't really stick to the mission on previous exercise. Feel lucky and move to the next one once you've read this text).
fr: Ceci engendre que la méthode que vous avez écrite à l'exercice précédent ne fonctionne plus ici. Si vous cliquez sur le bouton 'run' sans modification du code, votre buggle va probablement commencer à tourner sur les quatres cases à côté de sa position de départ (si ça n'est pas le cas, et bien, vous n'avez pas réellement suivi la mission de l'exercice précédent. Sentez vous chanceux et passez à l'exercice suivant une fois que vous aurez lu ce texte).

source: This is because your <code>keepHandOnSideWall()</code> method has an implicit <b>pre-condition</b>: it works well if and only if the buggle has a wall to its left when you call it. Such pre-condition are very heavily used when programming. Specifying them explicitly helps understanding the code written by other, and they even allow sometimes to prove that the code works correctly.
fr: C'est parce que votre méthode <code>keepHandOnSideWall()</code> a une <b>pré-condition</b> implicite : la méthode marche bien si et seulement si le buggle a un mur sur sa gauche quand vous appelez cette méthode. De telles pré-conditions sont très utilisées en programmation. Les spécifier explicitement aide à comprendre le code écrit par d'autres personnes, et peuvent même parfois prouver que le code marche correctement.

source: Fixing the problem should be very easy. Simply make sure that the pre-condition of <code>keepHandOnSideWall()</code> is verified before calling it. For that, update your run() method to first look for a wall on its left before the big <code>while</code> loop.
fr: Réparer le problème devrait être très facile. Assurez-vous simplement que la pré-condition de <code>keepHandOnSideWall()</code> est vérifiée avant de l'appeler Pour ce faire, mettez à jour votre méthode run() pour tout d'abord rechercher à avoir un mur à sa gauche avant de rentrer dans la grande boucle <code>while</code>.

source: This world introduces a little programming puzzle which can somehow be used to introduce programmation to non-reading kids since it is programmed graphically. The goal of each board is to light up all the lights. Your robot understands the following orders:
fr: Ce monde introduit un petit puzzle de programmation qui peut être utilisé pour introduire la programmation aux enfants ne sachant pas lire. En effet, il est programmé de manière graphique. L'objectif de chaque niveau est d'allumer toutes les lumières du plateau en utilisant le petit robot. Celui-ci comprend les ordres suivants :

source: <b>Order</b>
fr: <b>Ordre</b>

source: <b>Meaning</b>
fr: <b>Signification</b>

source: <b>Move forward</b>
fr: <b>Avancer</b>

source: Cannot be done if the destination cell is of another height than source cell
fr: Ne peut être utilisé si la case d'arrivée n'est pas à la même altitude que la case de départ.

source: <b>Jump forward</b>
fr: <b>Sauter en avant</b>

source: Can only be done if the destination cell is one step higher than source cell, or if destination is lower than source. Cannot be used for plain moves.
fr: Ne peut être utilisé que si la case d'arrivée est un étage plus haute que la case de départ, ou si l'arrivée est plus basse que le départ. Ne peut être utilisée pour des déplacements à plat.

source: <b>Turn left</b>.
fr: <b>Tourner à gauche</b>.

source: <b>Turn right</b>.
fr: <b>Tourner à droite</b>.

source: <b>Switch the light</b>.
fr: <b>Allumer ou éteindre</b>

source: Turn it on if it was off, and off if it was on. No effect if the cell does not contain any light.
fr: Allumer l'ampoule si elle était éteinte, et éteindre si elle était allumée. Sans effet s'il n'y a pas d'ampoule dans la case courante.

source: <b>Call function 1</b>.
fr: <b>Appeller la fonction 1</b>.

source: <b>Call function 2</b>.
fr: <b>Appeller la fonction 2</b>.

source: Please note that this world is not completely suited to small kids since the main difficulty comes from the fact that your are highly limited in the amount of instructions you can give to your robot. Advanced levels thus require to write sound functions, and are often above the capacities of small kids.
fr: Veuillez noter que ce jeu n'est pas vraiment adapté aux jeunes enfants puisque la principale difficulté vient de la limitation du nombre d'instructions utilisable dans chaque programme. Les niveaux avancés ne peuvent être résolus sans écrire des fonctions pour factoriser le code, ce qui est souvent au delà des capacités des jeunes enfants.

source: This game is heavily inspirated from a flash game of the same name, which can for example be played on kongregate.com. It was written by Danny Yaroslavski (Coolio-Niato), the original idea being of Matt Chase.
fr: Ce jeu est très largement inspiré d'un jeu en flash du même nom, que l'on peut par exemple trouver sur kongregate.com. Il a été écrit par Danny Yaroslavski (Coolio-Niato), d'après une idée originale de Matt Chase.

source: This lesson introduces a little programming puzzle inspired from a flash game.
fr: Cette leçon introduit un petit jeu de programmation inspiré d'un jeu en flash.

source: See the <i>About this world</i> dialog for more details.
fr: Référez vous à l'aide <i>About this world</i> pour plus de détails.

source: Welcome
fr: Bienvenue

source: Welcome to the lightbot world. This is merely a programmer puzzle rather than a real lesson (although some use it to teach programming). The robot is not programmed in Java, but rather graphically. You can see the existing orders in the documentation using the <i>About this world</i> menu.
fr: Bienvenue dans le monde de LightBot. Il s'agit plus d'une sorte de puzzle pour programmeur que d'une vraie leçon (bien qu'il puisse être utilisé pour enseigner la programmation). Le robot n'est pas programmé en Java, mais graphiquement. Vous trouverez les ordres disponibles dans la documentation en utilisant le menu <b>About this world</b>.

source: The goal of each board is simply to switch on every lights of the board using your little robot.
fr: L'objectif de chaque niveau est simplement de faire allumer toutes les ampoules du tableau à votre petit robot.

source: This is a introduction exercise, which should be solvable by only moving forward and switching the light, using respectively
fr: Ce premier exercice est une simple mise en bouche. Vous devriez pouvoir le résourdre simplement en avancant et en allumant la lampe, grâce aux ordres suivants:

source: and
fr: et

source: Turn around
fr: Se retourner

source: Now, you probably need to turn in addition (using
fr: Maintenant, vous avez probablement besoin de tourner (en utilisant

source: Jump
fr: Sauter

source: You can also jump using
fr: Vous pouvez également sauter en utilisant

source: to pass obstacles. You can either jump one level up or any amount of levels down, but you cannot jump to go on a cell of the same height.
fr: pour passer les obstacles. Vous pouvez soit sauter un étage vers le haut, ou vers le bas (même de plusieurs étages), mais vous ne pouvez pas sauter pour vous déplacer à plat.

source: Stairs
fr: Escaliers

source: Can you pass these stairs?
fr: Parviendrez vous à passer ces escaliers ?

source: Higher
fr: Toujours plus haut

source: Let's go higher
fr: Il est temps de nous élever de plus en plus haut.

source: Functions
fr: Fonctions

source: You can use
fr: Vous pouvez utiliser

source: to call respectively the first and second functions. Define their code in their own tab.
fr: Pour appeller respectivement la première et la seconde fonction. Définissez leur code dans leur boîte respective.

source: This is great if you get out of space in your main function
fr: Cela peut s'avérer pratique si vous n'avez plus assez d'espace dans votre fonction principale.

source: Repetitive tasks
fr: Des tâches répétitives

source: Functions are also of great use for repetitive tasks
fr: Les fonctions sont également très pratique pour les tâches répétitives

source: Calling functions from functions
fr: Invoquer des fonctions depuis les fonctions

source: It is perfectly okay to call a function from within a function!
fr: Rien ne vous interdit d'invoquer une fonction depuis une autre fonction !

source: Castle
fr: Chateau

source: You're getting good at this...
fr: Vous vous en sortez de mieux en mieux...

source: Wall
fr: Mur

source: Ready to climb the wall?
fr: Etes-vous prêt à escalader ce mur ?

source: Sea
fr: Mer

source: You now have to surf these waves of lamps.
fr: Vous devez maintenant surfer sur cette mer de lampes.

source: Escher Castle
fr: Le chateau d'Escher

source: This one aint easy.
fr: Celui-ci est loin d'être facile.

source: Close to 10
fr: Proche de 10

source: Given 2 int values, return whichever value is nearest to the value 10, or return 0 in the event of a tie. Note that Math.abs(n) returns the absolute value of a number.
fr: Étant donné deux nombres entiers, retourner la valeur la plus proche de 10, ou 0 en cas de match nul. Remarquez que Math.abs(n) retourne la valeur absolue d'un nombre.

source: Given 2 int values, return whichever value is nearest to the value 10, or return 0 in the event of a tie. Note that math.fabs(n) returns the absolute value of a number.
fr: Étant donné deux nombres entiers, retourner la valeur la plus proche de 10, ou 0 en cas de match nul. Remarquez que math.fabs(n) retourne la valeur absolue d'un nombre.

source: This exercise was converted to JLM from the excellent exercising site http://javabat.com/
fr: Cet exercice a été extrait de l'excellent site d'exercices http://javabat.com/ pour JLM.

source: Count Teen
fr: Compter les ados

source: We'll say that a number is "teen" if it is in the range 13..19 inclusive. Given 4 int values, return the amount of teen ones.
fr: On dira qu'un nombre est "ado" s'il appartient à l'intervale [13;19]. Étant donné quatre nombres entiers, retournez combien d'entre eux sont ados.

source: This exercise was written by Martin Quinson.
fr: Cet exercice a été écrit par Martin Quinson.

source: Given an int n, return the absolute difference between n and 21, except return double the absolute difference if n is over 21.
fr: Étant donné un entier n, retournez la différence absolue entre n et 21, sauf si n est plus grand que 21. Dans ce cas, doublez la différence absolue.

source: Has Teen
fr: A des ados

source: We'll say that a number is "teen" if it is in the range 13..19 inclusive. Given 3 int values, return true if 1 or more of them are teen.
fr: On dira qu'un nombre est "ado" s'il appartient à l'intervale [13;19]. Étant donné trois nombres entiers, retournez vrai ssi un ou plusieurs d'entre eux sont ados.

source: Icy Hot
fr: Feu glacé

source: Given two temperatures, return true if one is less than 0 and the other is greater than 100.
fr: Étant donné deux températures, retournez vrai si l'une est inférieure à zéro et l'autre supérieure à 100.

source: In [10;20]
fr: Dans [10;20]

source: Given 2 int values, return true if either of them is in the range 10..20 inclusive.
fr: Étant donné deux nombres entiers, retournez vrai s'un d'entre eux est dans l'intervale [10;20].

source: In [30;50]
fr: Dans [30;50]

source: Given 2 int values, return true if they are both in the range 30..40 inclusive, or they are both in the range 40..50 inclusive.
fr: Étant donné deux nombres entiers, retournez vrai s'ils sont tous les deux dans l'intervale [30;40], ou s'ils sont tous les deux dans l'intervale [40;50].

source: LastDigit
fr: Dernier chiffre

source: Given two non-negative int values, return true if they have the same last digit, such as with 27 and 57. Note that the % "mod" operator computes remainders, so 17 % 10 is 7.
fr: Étant donné deux nombres entiers positifs, retournez vrai s'ils ont le même dernier chiffre, comme 27 et 57. Remarquez que l'opérateur % (modulo) calcule le reste de la division entière (donc 17 % 10 vaut 7).

source: Lone Teen
fr: Ado solitaire

source: We'll say that a number is "teen" if it is in the range 13..19 inclusive. Given 2 int values, return true if one or the other is teen, but not both.
fr: On dira qu'un nombre est "ado" s'il appartient à l'intervale [13;19]. Étant donné deux nombres entiers, retournez vrai si l'un d'entre eux est ado, mais pas les deux.

source: Boolean fun
fr: Jeux booléens

source: Boolean operations are one of the very basic task in programming. As long as you cannot write a not so simple boolean test under the minute, you probably will have a very bad time writing a real program.
fr: Les opérations booléennes sont l'une des fondements de la programmation. Tant que vous ne pourrez pas écrire des tests booléens (même non triviaux) en moins d'une minute, il vous sera difficile d'écrire un vrai programme.

source: That is why this lesson provides you a bunch of such exercises, so that you can get trained in this.
fr: C'est pourquoi cette leçon vous propose une certaine quantité de tels exercices pour vous permettre de vous entrainer.

source: Makes 10
fr: Font 10

source: Given 2 ints, a and b, return true if one if them is 10 or if their sum is 10.
fr: Étant donné deux nombres entiers, retournez vrai si l'un d'entre eux vaut 10, ou si leur somme vaut 10.

source: Given 2 positive int values, return the larger value that is in the range 10..20 inclusive, or return 0 if neither is in that range.
fr: Étant donné deux nombres entiers, retournez la plus grande valeur dans l'intervale [10;20], ou retournez 0 si aucun des nombres n'est dans cet intervale.

source: MonkeyTrouble
fr: Problème de singe

source: We have two monkeys, a and b, and the parameters aSmile and bSmile indicate if each is smiling. We are in trouble if they are both smiling or if neither of them is smiling. Return true if we are in trouble.
fr: Nous avons deux singes, a et b, et les paramètres aSmile et bSmile indiquent s'ils sourient. Nous avons un problème s'ils sourient tous les deux en même temps, ou si aucun des deux ne sourit. Retournez vrai si nous avons un problème.

source: Near Hundred
fr: Presque 100

source: Given an int n, return true if it is within 10 of 100 or 200. Note Math.abs(n) returns the absolute value of a number.
fr: Étant donné un entier n, retournez vrai s'il est à 10 près de 100 ou de 200. Remarquez que Math.abs(n) retourne la valeur absolue d'un nombre.

source: Parot Trouble
fr: Problème de perroquet

source: We have a loud talking parrot. The "hour" parameter is the current hour time in the range 0..23. We are in trouble if the parrot is talking and the hour is before 7 or after 20. Return true if we are in trouble.
fr: Nous avons un perroquet très bruyant. Le paramètre "hour" indique l'heure courante (dans l'intervale [0;23]). Nous avons un problème si le perroquet parle avant 7h ou après 20h. Retournez vrai si nous avons un problème.

source: Positive Negative
fr: Positif Negatif
