Repository: BuggleInc/PLM
Catalog: lib/l10n/*.po
Languages: fr

source: <code>answerWorld</code> is the one displayed by the "Objective" world. Basically, it's a copy of the initial world, on which we let the specific answer entity of this exercise run. This default behavior can be overloaded by exercises, but you'll probably never have to do so. We will come back on this in a subsequent exercise.
fr: <code>answerWorld</code> est celui affiché par le monde "Objective". Concrètement, il s'agit d'une copie du monde initial, sur lequel on a lancé le programme de l'"answer entity" de l'exercice. Ce comportement par défaut peut être modifié par les exercices, mais vous n'aurez probablement jamais à le faire. Nous reviendrons là dessus dans un exercice ultérieur.

source: Implementing basic Worlds
fr: Implémenter des mondes basiques

source: The internal use of Worlds hidden, but the important point is that every World object has extend the jlm.universe.World class and define the following methods and constructors:
fr: L'utilisation interne des mondes est cachée, mais le point important est que chaque objet World hérite de la classe jlm.universe.World et définit les méthodes et constructeurs suivants :

source: <b>a copy constructor</b> which is used to copy initial worlds into currentWorld and answerWorld. Its argument must be of the exact same type than the class itself, not Object (this is because we use Java introspection mechanism to search for such a constructor of the class). For example, if you create a TotoWorld, your copy constructor must be declared as this:
fr: <b>un constructeur copie</b> qui est utilisé pour copier le monde initial en currentWorld et answerWorld. Son argument doit être du même type que la classe elle-même, et non pas de type Object ( c'est parce que nous utilisons le mécanisme d'introspection Java pour rechercher un tel constructeur dans la classe). Par exemple, si vous créer un TotWorl, votre constructeur votre constructeur copie doit être déclaré ainsi :

source: public TotoWorld(TotoWorld other) {...} // Correct public TotoWorld(Object other) {...} // FALSE public TotoWorld(World other) {...} // also FALSE
fr: public TotoWorld(TotoWorld other) {...} // Correct public TotoWorld(Object other) {...} // Faux public TotoWorld(World other) {...} // Faux

source: The content of this constructor is usually a simple call to the <code>super(World w)</code> constructor, but this constructor cannot be omitted.
fr: Le contenu de ce constructeur est généralement un simple appel au constructeur<code>super(World w)</code>, mais ce constructeur copie doit exister.

source: One or several <b>regular constructors</b> initializing the state of the object. They will be used by the exercise constructor to instantiate your world. Since you usually write both the world and the lessons, you are completely free to specify the parameters you want to your constructor. It should use the <code>super(String name)</code> constructor to setup the very basic elements of your world.
fr: Un ou plusieurs <b>constructeurs normaux</b> initialisant l'état de l'objet. Ils seront utilisés par le constructeur de l'exercice pour instancier votre monde. Puisque vous écrivez généralement le monde et les leçons, vous êtes complètement libre de spécifier les paramètres que vous voulez pour votre constructeur. Il doit néanmoins utilise le constructeur <code>super(String name)</code> pour initialiser les éléments basiques de votre monde.

source: Optionally, you may also want to use the <code>setDelay(int delay)</code> method to change the initial animation delay. For example, the SortingWorld set this to 1 to speed animations up. This is the delay in milliseconds between each animation step during a continuous run.
fr: Vous pouvez, de manière facultative, utiliser la méthode <code>setdelay(int delay)</code> pour changer le délai initial de l'animation. Par exemple, dans SortingWorld, mettez le à 1 pour accélérer l'animation. C'est le délai en millisecondes entre chaque pas d'animation durant un programme continu.

source: A <b>reset() method</b> taking one World as parameter, and in charge of copying the state of the parameter into the current world. This is naturally used when you press the "Reset" button, or at the beginning of each run.
fr: Une méthode <b>reset()</b> prenant un World en paramètre, et ayant pour mission d'affecter l'état du paramètre dans le monde courant. C'est naturellement utilisé quand vous appuyez sur le bouton "Reset", ou au début de chaque lancement de programme.

source: The length of this method naturally depends on the complexity of your world state. In hanoi, there is only 3 slots containing a list of disc so that will be quite easy, but this can be quite complicated for complex worlds such as BuggleWorld.
fr: La longueur de cette méthode dépend naturellemetn de la complexité de l'état de votre monde. Dans Hanoi, il y a seulement trois tours contenant une liste de disques, cela sera donc très facile, mais cela peut être bien plus compliqué avec des mondes complexes comme BuggleWorld.

source: Allowing the graphical rendering of Worlds
fr: Permettre le rendu graphique des mondes

source: Some specific steps naturally must be taken so that JLM can graphically display your world. Usually, you must write a specific class extending jlm.universe.WorldView, and provide some protected methods so that the View can retrieve the state to display. In this particular exercise, the view is provided (you will write you own one in next exercise), so you only have to implement the right accessor.
fr: Certaines étapes spécifiques doivent naturellement être prise afin que la JLM puisse afficher graphique votre monde. Usuellement, vous devez écrire une classe spécifique héritant de jlm.universe.WorldView, et fournissant des méthodes "protected", afin que la vue puisse récupérer l'état à afficher. Dans cet exercice particulier, la vue vous est fournie ( vous en écrirez une dans le prochain exercice ), donc vous n'avez qu'à implémenter le bon accesseur.

source: Implementing your HanoiWorld
fr: Implémenter votre HanoiWorld

source: The main task of this exercise is to modify the provided template to store the state of the world. Since the exercise provides a view and automatically instantiate your world, you cannot change the instantiation constructor, nor the rendering accessor (see the code template for there prototype). But you are completely free about how you actually store the state in your object.
fr: La tâche principale de cet exercice est de modifié le code fourni pour sauvegarder l'état du monde. Puisque l'exercice fournit une vue et instancie automatiquement le monde, vous ne pouvez pas changer le constructeur d'instanciation, ni l'accesseur de rendu graphique ( regardez le code fourni pour leurs prototypes ). Mais vous êtes complètement libre sur comment vous allez sauvegarder l'état dans votre object.

source: During the implementation of the Hanoi world, I changed my internal representation several times, to adapt to the code needs. My first try was only simply three ArrayList&lt;Integer>, for each slots, while the final design used an inner class called HanoiSlot, containing an integer array and providing friendly functions such as <code>push()</code>, <code>pop()</code> and <code>top()</code>. Even if it really becomes necessary when implementing the action methods allowing the entities to interact with their world, I advise you to design an inner class from the beginning.
fr: Pendant l'implémentation du monde des Tours de Hanoï, j'ai changé ma représentation interne à plusieures reprises, afin de l'adapter aux besoins du code. Mon premier essai était simplement trois ArrayList&lt;Integer>, une pour chaque tour, tandis que la version finale fournit une classe interne, nommé HanoiSlot, contenant un tableau d'entier et fournissant des fonctions sympathiques telles que <code>push()</code>, <code>pop()</code> and <code>top()</code>. Même si cela ne devient réellement nécessaire que quand vous implémenter les méthodes d'actions permettant aux entitées d'intéragir avec leur monde, je vous conseille de concevoir une classe interne dès le départ.

source: You probably want to add 3 fields to your World, one for each slot (we will never try to have worlds with more than 3 slots), store the content of each slot in the instantiation constructor, and retrieve the content of a specific slot in the rendering accessor (<code>Integer[] values(Integer i)</code>).
fr: Vous voudrez probablement ajouter trois champs à votre monde, un pour chaque tour (on n'essayera jamais d'avoir des mondes avec plus de trois tours), sauvegarder le contenu de chaque tour dans le construction d'instanciation, et récupérer le contenu d'une tour donnée dans l'accesseur de rendu graphique (<code>Integer[] values(Integer i)</code>).

source: That seems quite a lot of code to write compared to the other JLM exercises, but at the end, my HanoiWorld implementation is less than 100 lines long, which is not that much.
fr: Cela semble être beaucoup de code à écrire comparé aux autres exercices de la JLM, mais en fin de compte, mon implémentation de HanoiWorld fait moints de cent lignes, ce qui n'est pas beaucoup.

source: Meta lesson
fr: Meta leçon

source: The purpose of this lesson is to teach you how to write lessons for JLM.
fr: Le but de cette leçon est de vous apprendre comment écrire des leçons pour la JLM.

source: First steps
fr: Premiers pas

source: This first lesson will lead your first steps in Java programming. It is intended for beginners. List of seen notions per exercise:
fr: Cette première leçon va vous guider dans vos premiers pas en programmation Java. Elle est destinée aux débutants en Java.

source: Comments
fr: Commentaires

source: Conditionals/ Expressions
fr: Instructions conditionnelles et expressions

source: While loops
fr: Boucles tant que <tt>(while)</tt>

source: For loops
fr: Boucles pour <tt>(for)</tt>

source: Do/While loops
fr: Boucles jusqu'à

source: Methods
fr: Méthodes

source: Arrays
fr: Tableaux

source: Welcome in the Buggles' World
fr: Bienvenue dans le monde des buggles

source: Java Instructions
fr: Les instructions Java

source: Writing more complex programs
fr: Écrire des programmes plus complexes

source: Conditional instructions
fr: Instructions conditionnelles

source: Baggle Seeking
fr: Chercheur de baggles

source: Storing and manipulating data
fr: Stocker et manipuler des données

source: Do .. while loops
fr: Boucles jusqu'à<tt> (do ... while)</tt>

source: Building methodically
fr: Construire avec méthode

source: Methods returning a result
fr: Méthodes retournant un résultat

source: Methods with parameters
fr: Méthodes avec paramètres

source: Methodically drawing
fr: Dessiner avec méthode

source: Methodically drawing (only bigger)
fr: Dessiner avec méthode (en plus grand)

source: Drawing bigger and bigger
fr: Dessiner de plus en plus grand

source: Even more pattern to draw
fr: Encore des motifs à dessiner

source: Slug Hunting
fr: Chasse à la limace

source: Slug Tracking
fr: Pistage de la limace

source: Snake World
fr: Monde de serpents

source: Knitting and Arrays
fr: Tricots et tableaux

source: Knitting, Arrays and modulos
fr: Tricots, tableaux et modulos

source: Traversal by column
fr: Parcours en colonne

source: Traversal by line
fr: Parcours en ligne

source: Zig-zag traversal
fr: Parcours en zig-zag

source: Diagonal Traversal
fr: Parcours en diagonal

source: Meaning of the symbols
fr: Légende

source: Introducing the concept
fr: Le concept est introduit

source: Working on the concept
fr: L'exercice travaille sur le concept

source: Concept assumed mastered
fr: Le concept est supposé maîtrisé

source: Concept not mandated by the exercise
fr: Le concept n'est pas indispensable à l'exercice

source: You just started the Java Learning Machine. This is a Learning Management System (LMS) aiming at teaching the art of computer programming through interactive exercises. It is constituted by a set of exercises grouped by lessons, allowing you to practice at your own pace. By default, the environment is configured to be programmed in the Java programming language, but you can change it from the Language menu if you want.
fr: Vous venez de lancer la Java Learning Machine. Il s'agit d'une plate-forme pédagogique destinée à simplifier l'apprentissage de la programmation. Il est constitué d'un ensemble d'exercices groupés par leçons, pour vous permettre de progresser à votre rythme. Par défaut, l'outil est configuré pour vous permettre de programmer en Java, mais vous pouvez changer de langage de programmation grâce au menu Language si vous le désirez.

source: In this first lesson, the buggles will lead your first steps in programming.
fr: Dans cette première leçon, les buggles guideront vos premiers pas en programmation.

source: The <i>buggles</i>? What is this??
fr: Les <i>buggles</i> ? Qu'est ce que c'est ??

source: The buggles are little animals obeying any order you may give them. In each exercise, you have to provide them with the right instructions so that the world turns into the objective of the exercise. For example in this exercise, you show instruct your buggle to move forward once. You can see that by checking the difference between the <i>World</i> view and the <i>Objective</i> one. Depending on the lessons (and your settings in the Language menu), your code must be written in either Java, JavaScript, Python or Ruby.
fr: Les buggles sont de petites bêtes qui obéissent aux ordres que vous leur donnez. Dans chaque exercice, vous devez donner des ordres à vos buggles pour faire en sorte que le monde ressemble à l'objectif de l'exercice. Par exemple dans cet exercice, vous devez instruire votre buggle pour qu'elle avance d'un pas. Observez la différence entre l'état initial et l'objectif en utilisant les panneaux à droite. Selon la leçon (et vos réglages dans le menu Language), vous devez écrire vos programme dans l'un des langages de programmation suivant : Java, JavaScript, Python ou Ruby.

source: Working environment
fr: L'environnement de travail

source: Before going any further, get familiar with the working environment. Have a look at the several elements composing the main window, move your mouse over them to show the tooltip, and experiment with the elements to see what they do. The white area below is the console: this is where errors and messages get displayed. If you have access to the net, try to open the forum in the help menu to check if other people are connected right now. Note that when you successfully solve an exercise, the good news is spread on twitter. Keep posted to the progress of your friends by following @jlmlovers :)
fr: Avant d'aller plus loin, familiarisez vous avec l'environnement. Observez les différents éléments composant la fenêtre, et placez la souris sur dessus pour voir les bulles d'aide, et essayez les pour voir ce qu'ils font. La zone blanche en bas est la console : c'est là que les erreurs et messages sont affichés. Si vous avez accès à internet, connectez vous au forum par le menu d'aide pour voir si d'autres personnes sont connectés. Notez que quand vous réussissez un exercice, la bonne nouvelle est envoyée sur twitter. Suivez les progrès de vos amis en suivant #jlmlovers :)

source: If your code contains errors (and code always do at some point), the computer will display error messages in the console. You obviously have to fix the errors to pass the exercises. The messages that get displayed may sound scary at first glance, but don't panic. The compiler is only somehow limited in its communication abilities, but he's not mean. If you look closer, the solution to solve your issue is written in the middle of those cryptic messages. You'll see, with a bit of habit, we get used to it.
fr: Si votre code contient des erreurs (et les programmes finissent toujours par en contenir), l'ordinateur affichera les messages d'erreur sur la console. Vous devez bien entendu corriger ces erreurs pour réussir les exercices. Les messages affichés peuvent paraître inquiétant au premier abord, mais pas de panique. Le compilateur est seulement pas très doué pour communiquer, il n'est pas fondamentalement méchant. En regardant de plus près, la solution pour corriger les problèmes est inscrite dans ces messages cryptiques. Vous verrez, avec un peu d'entraînement, vous vous y habituerez.

source: What am I supposed to do?
fr: Que dois-je faire ?

source: It's time to write your first program. Simply ask your buggle to move one step forward using the Source Code pane. For that, simply write the following code (clicking on the interactive controls is not enough: You have to write the code after experimenting interactively).
fr: Il est temps d'écrire votre premier programme. Demandez simplement de faire un pas en avant dans le panneau de Code Source. Pour cela, écrivez simplement le code suivant. Cliquer sur les contrôles interactifs ne suffit pas. Il faut écrire le code après avoir expérimenté interactivement.

source: Do not forget the final <code>;</code> which tells the compiler that the instruction is over (yes, computers are so dumb that they cannot <i>guess</i> obvious stuff like this).
fr: N'oubliez pas le <code>;</code> final, car cela indique au compilateur que l'instruction est terminée (oui, les ordinateurs sont si stupides qu'il faut leur préciser des choses aussi simples).

source: Once done, clic on run, and proceed to next exercise using the File menu entry
fr: Une fois terminé, cliquez sur "run", et passez à l'exercice suivant avec le menu File.

source: (or keep around to experiment further if you feel so).
fr: (ou restez ici pour expérimenter un peu si vous le voulez).

source: Congratulations! You just wrote your first program! You got the idea now: programming is nothing more than giving simple instructions to the computer that blindly apply them. The main difficulty is to explain stuff to someone as stupid as a computer...
fr: Félicitations ! Vous venez d'écrire votre premier programme ! Vous avez compris l'idée maintenant : programmer, c'est simplement donner des instructions à l'ordinateur, qui les applique aveuglément. La plus grande difficulté est d'expliquer quoi faire à quelqu'un d'aussi bête que l'ordinateur...

source: Programs are mainly suites of method calls, which are no more than a list of simple order given to the machine. It is very similar to a recipe stating <i>Melt the chocolate pieces, add sugar, cool the mix and serve</i>. In your programs, such built instructions are called functions or methods, and you should add parenthesis to invoke them, as in
fr: Le programme le plus simple est formé d'une suite d'ordres simples donnés à la machine. C'est assez comparable à une recette de cuisine où l'on dit <i>cassez les oeufs puis ajoutez du sel puis mélangez le tout puis faites cuire</i>. Dans les programmes, de tels instructions sont appellées fonctions ou méthodes, et vous devez les doter de parenthèses comme dans

source: nameOfTheMethod()
fr: nomDeLaMethode()

source: Java want to have the instructions separated by semi-columns (;). The previous example would thus be written in a similar way:
fr: Java veut que les instructions soient séparées par des points-virgules (;). L'exemple ci-dessus de recette s'écrirait donc à peu près ainsi:

source: meltTheChocolatePieces(); addSugar(); coolMix(); serve();
fr: casserLesOeufs(); ajouterDuSel(); melangerLeTout(); faireCuire();

source: Python want to have the instructions separated by either semi-columns (;) or by new lines. The previous example would thus be written the following way.
fr: Python veut que les instructions soient séparées soit par des points-virgules (;), soit par des retours à la ligne. L'exemple ci-dessus de recette s'écrirait donc à peu près ainsi:

source: meltTheChocolatePieces() addSugar() coolMix() serve()
fr: casserLesOeufs() ajouterDuSel() melangerLeTout() faireCuire()

source: It could also be written in the following way, but it's generally considered as a bad practice to group several instructions on the same line since it greatly hinders the readability.
fr: Il serait également possible de l'écrire sous la forme suivante, mais placer plusieurs instructions sur la même ligne est généralement considéré comme une très mauvaise habitude car cela complique grandement la relecture du code après coup.

source: meltTheChocolatePieces(); addSugar(); coolMix(); serve()
fr: casserLesOeufs(); ajouterDuSel(); melangerLeTout(); faireCuire();

source: Of course, these specific methods do not exist in Java, but it may be possible to define them by yourself (we'll see later how to define your how methods).
fr: Bien entendu, ces méthodes n'existent pas en Java, mais il serait possible de les définir par vous même (nous verrons plus tard comment définir vos propres méthodes).

source: Of course, these specific methods do not exist in Python, but it may be possible to define them by yourself (we'll see later how to define your how methods).
fr: Bien entendu, ces méthodes n'existent pas en Python, mais il serait possible de les définir par vous même (nous verrons plus tard comment définir vos propres méthodes).

source: For now, we'll simply go for the buggle instructions. There is a method for each button of the interactive control panel. To achieve the same effect than the <b>forward</b> button (making the buggle moving one step forward), you need to write the following in the editor:
fr: Pour l'instant, nous allons utiliser les instructions de la buggle. Il y a une méthode pour chaque bouton du contrôle interactif. Pour faire la même chose que le bouton <b>forward</b> (faire avancer la buggle d'un pas), il faut écrire dans l'éditeur :

source: Likewise, to achieve the same effect than the <b>backward</b>, <b>turn left</b> and <b>turn right</b> buttons, you need to use respectively:
fr: De même, pour faire l'équivalent des boutons <b>backward</b>, <b>turn left</b> et <b>turn right</b>, il faut utiliser respectivement :

source: The <b>mark</b> button is a bit particular, since it correspond to two methods: the first one moves the pen up while the second moves it down.
fr: Le bouton <b>mark</b> est un peu particulier, puisqu'il correspond à deux méthodes : la première lève le crayon, tandis que la seconde le baisse.

source: The buggle offers other methods, that are presented from the "Help/about this world" menu and will be introduced on need.
fr: La buggle offre d'autres méthodes, présentées dans le menu "Help/about this world". Elles seront introduites au fur et à mesure des besoins.

source: Exercise goal
fr: Objectif de cet exercice

source: <a name="Objectives"> Our second program will be a bit more complicated, but not much. The goal for your buggle is simply to draw a house (a box), and hide inside. Check the objective world to see exactly what this means.
fr: <a name="Objectives"> Notre second programme sera un peu plus compliqué, mais pas tellement. L'objectif de votre buggle est simplement de se dessiner une maison (une boîte), et de se cacher dedans. Vérifiez le monde objectif pour voir exactement ce que cela veut dire.

source: Now that we know how to draw things on the board, we'll enjoy this ability and draw a beautiful G on the board (check Objective panel for details on what's expected).
fr: Maintenant que vous savez écrire des choses sur le sol, nous allons utiliser cette compétence pour dessiner un merveilleux G par terre. Consultez le panneau d'objectif pour les détails de ce qui est attendu.
