Repository: BuggleInc/PLM
Catalog: lib/l10n/*.po
Languages: fr

source: An array is a sequence of positions in which one can store values of the same kind (one value per cell). It is thus a sequence of values of the same kind:
fr: Un tableau est une séquence d'emplacements dans lesquels on peut mettre des valeurs de même type (une par emplacement). C'est donc une séquence de cases de même type :

source: T is the array's name, T[0] is the name of the first cell, T[1] the name of the second cell, T[2] the third one, etc. And yes, the first cell in numbered T[0] and the last one of an array of size N is T[N-1].
fr: T est le nom du tableau, T[0] est le nom de la première case, T[1] de la deuxième case, T[2] de la troisième case, etc... Et oui, la première case est T[0] et la dernière case d'un tableau de dimension N est T[N - 1].

source: We can use an integer variable <i>i</i> to access with T[i] to the array's cells: when the value of <i>i</i> is 0, then T[i] accesses T[0], when the value of <i>i</i> is 10, then T[i] accesses T[10]. <i>i</i> is said to be the indice in the array T.
fr: On peut utiliser une variable entière <i>i</i> pour accéder avec T[i] aux cases d'un tableau : lorsque <i>i</i> vaut 0 alors T[i] dénote la case T[0], lorsque <i>i</i> vaut 10, T[i] dénote T[10]. On dit alors que <i>i</i> est un <b>indice</b> dans le tableau T .

source: Initializing an array
fr: Remplissage d'un tableau

source: Let <code>T</code> be an array of 10 integer elements. It can then be initialized this way:
fr: Supposons que <code>T</code> soit un tableau de 10 éléments entiers. On peut alors le remplir de la manière suivante :

source: <code>T[i]</code> can be used just like a variable. We can set a new value:
fr: <code>T[i]</code> s'utilise comme une variable. On peut l'affecter :

source: We can access its value:
fr: On peut lire sa valeur :

source: We can test this value:
fr: On peut tester cette valeur :

source: Declaring an array
fr: Déclaration d'un tableau

source: An array can be declared the following way:
fr: Un tableau se déclare de la manière suivante :

source: <code>int</code> means that the elements of the array are of type integer; <code>T</code> is the name of the array and <code>[]</code> means that we are speaking of an array. It is also possible to declare the same array the following way. Both writings are equivalent, but the first one is often prefered in Java.
fr: <code>int</code> indique que les éléments du tableau <code>T</code> sont de type entier est le nom du tableau, <code>[]</code> indique qu'il s'agit d'un tableau. On peut aussi écrire cette déclaration de la manière suivante. Les deux écritures sont syntaxiquement équivalente, mais la première est souvent préférée en Java.

source: Allocating an array
fr: Allocation d'un tableau

source: Declaring an array <code>T</code> only reserve the name <code>T</code> for later use. But the array is not initialized yet: it does not have any value. What would <code>T[4]</code> mean if we didn't say that the array is at least 5 cells long?
fr: Déclarer un tableau <code>T</code> nous réserve juste le nom <code>T</code> pour l'utiliser plus tard. Mais le tableau n'est pas initialisé : il n'a pas de valeur. Que voudrait dire <code>T[4]</code> si nous n'avons pas encore dit que <code>T</code> est un tableau d'au moins 5 éléments ?

source: First and foremost, we have to give a value to <code>T</code>:
fr: Avant tout, il faut donc lui affecter une valeur à <code>T</code>:

source: <code>new</code> means that we want to create something, and <code>int[10]</code> means that it is an array of 10 integer values. In return, an array of 10 integer cells is created in memory, and the <code>T</code> variable reference this array.
fr: <code>new</code> indique qu'il faut créer quelque chose, et <code>int[10]</code> indique qu'il s'agit d'un tableau de 10 valeur entières. En réponse, un tableau d'entiers de longueur 10 est crée en mémoire, et la variable <code>T</code> référence ce tableau.

source: The size of an array is fixed and cannot be changed after the creation of the array. To know the size of a <code>T</code> array, we can consult the value of the variable <code>T.length</code>.
fr: La taille d'un tableau est fixée et ne peut plus être changée après la création du tableau. Pour connapitre la taille d'un tableau <code>T</code>, on peut consulter la valeur de la variable <code>T.length</code>.

source: It is forbidden to write:
fr: On ne peut pas écrire :

source: int T[10]; // WRONG!!!
fr: int T[10]; // FAUX !!!

source: You are required to use the <code>new</code> instruction. On the other hand, you perfectly can specify the size with a variable <code>i</code>.
fr: Il faut absolument utiliser l'instruction <code>new</code>. Par contre, on peut très bien donner la dimension par une variable <code>i</code>.

source: In this case, the array's size will be set to the value of <code>i</code> <b>when <code>new</code> gets called</b>. If the variable changes afterward, it won't change the array's size.
fr: Dans ce cas, la taille du tableau sera la valeur de <code>i</code> <b>au moment où on a fait le</b> <code>new</code>. Si <code>i</code> change après coup, cela ne modifie pas la taille du tableau.

source: Declaration and allocation
fr: Déclaration et allocation

source: We declare and allocate the array on the same line.
fr: On déclare et alloue le tableau en une seule ligne.

source: Declaration and initialization
fr: Déclaration et initialisation

source: We declare, allocate and initialize the array on the same line. To know the size of the array to allocate, the compiler counts the provided values. This code is equivalent to:
fr: On déclare, alloue et initialise le tableau en une seule ligne. Pour connaître la taille du tableau à allouer, le compilateur compte les valeurs données. Ce code est équivalent à :

source: It is also equivalent to:
fr: C'est aussi équivalent au code :

source: Arrays and method parameters
fr: Tableaux et paramètres de méthode

source: It is perfectly ok to pass an array to a method as a parameter. The method must have a prototype similar to:
fr: On peut tout à fait passer un tableau en paramètre d'une méthode. La méthode doit l'indiquer dans son prototype de la façon suivante:

source: void myMethod(int[] values) { // do something }
fr: void maMethode(int[] valeurs) { // faire quelque chose }

source: On the caller side, that also very simple:
fr: Coté appelant, c'est aussi simple :

source: int[] tab = new int[10]; // initalize the values myMethod(tab);
fr: int[] tab = new int[10]; // initialiser les valeurs maMethode(tab);

source: We can also have methods returns arrays as results:
fr: On peut également avoir des méthodes renvoyant des tableaux en résultat :

source: int[] otherMethod() { int[] result = new int[10]; // do something return result; }
fr: int[] autreMethode() { int[] resultat = new int[10]; // faire quelque chose return resultat; }

source: The <code>run()</code> method that you should write must declare an array of colors (<code>Color[]</code>) and allocate it. Beware, the first world is 6x6, but this is not the case of the others. Use the <code>getWorldHeight()</code> method to retrieve the amount of lines in the current world.
fr: La méthode <code>run()</code> que vous devez écrire doit commencer par déclarer un tableau de couleurs (<code>Color[]</code>) et l'allouer. Attention, le premier monde est de taille 6x6, mais ce n'est pas le cas des autres. Utilisez donc la méthode <code>getWorldHeight()</code> pour retrouver le nombre de lignes du monde actuel.

source: Once the array allocated, we have to fill it. For each cel of the row, read the ground color (with <code>getGroundColor()</code>), and store it in the right cell of the array.
fr: Une fois le tableau alloué, il faut le remplir. Pour chaque case de la colonne, lisez la couleur du sol (avec <code>getGroundColor()</code>), et stockez le résultat de cette méthode dans la bonne case du tableau.

source: Once hte array initialized, you have to reapply the pattern on every rows, for example by excuting <code>getWorldHeight()</code> times a method written specifically for this.
fr: Une fois le tableau initialisé, il faut répliquer le motif sur toutes les colonnes, par exemple en exécutant <code>getWorldWidth()</code> fois une méthode écrite tout exprès.

source: This exercise is similar to the previous one: you have to reproduce the color pattern of the first cell into the other ones.
fr: Cet exercice ressemble au précédent : il faut reproduire le motif de couleurs de la première colonne dans les colonnes suivantes.

source: The first difference is that the world is bordered of walls: you thus have to slightly modify your trajectory to ensure that the buggle does not crash into a wall. The simpler for that is to handle the first cell out of the <code>for</code> loop and do only <code>getWorldHeight()-1</code> steps in the loop.
fr: La première différence est que le monde est entouré d'un mur : il faut donc modifier légèrement les parcours pour s'assurer que la buggle ne se cogne pas sur les bords. Le plus simple est de traiter la première case de la colonne en dehors de la boucle <code>for</code> (avant la boucle), et faire seulement <code>getWorldHeight()-1</code> pas dans la boucle.

source: The other difference is that the offset to apply between columns is not fixed, but written on the first cell of each column. To get the info as an integer, we can use:
fr: La seconde différence est que le décalage à effectuer entre les colonnes n'est pas fixe, mais écrit sur la première case de chaque colonne. Pour obtenir l'information sous forme d'un entier, on peut utiliser:

source: <code>readMessage()</code> gets the message on the ground as a String, while <code>Integer.parseInt()</code> transforms a String into an integer by <i>reading</i> it.
fr: <code>readMessage()</code> lit l'indication au sol sous forme d'une chaine de caractères, tandis que <code>Integer.parseInt()</code> transforme une chaine de caractères en entiers en la <i>lisant</i>.

source: Then, to pick the right color, the easier is to use the <code>%</code> (modulo) operator. For example, <code>(i + 5) % size</code> allows to retrieve teh <code>i</code>th cell of an array of size <code>size</code> with an offset of <code>5</code>.
fr: Ensuite, pour trouver la bonne couleur à utiliser, le plus simple est d'utiliser l'opérateur <code>%</code> (modulo). Par exemple, <code>(i + 5) % taille</code> permet de trouver la <code>i</code>ieme case d'un tableau de taille <code>taille</code> quand on applique un décalage de <code>5</code> cases.

source: Searching a given value
fr: Indice d'une valeur donnée

source: The goal of this exercise is to search the cell of value 17 in an array, and return its position.
fr: L'objectif de cet exercice est de calculer l'indice d'une valeur donnée (17 dans cet exercice) dans un tableau.

source: To that extend, you should fill the method <code>indexOf(int[] tab, int lookingFor)</code>, which parameters are the array to explore, and the value to search. If the value <code>lookingFor</code> is not in the array <code>tab</code>, the method should return -1.
fr: Pour cela, il vous faut remplir le corps de la méthode <code>indexOf(int[] tab, int lookingFor)</code>. Ses paramètres sont le tableau à explorer et la valeur à chercher. Si la valeur <code>lookingFor</code> n'est pas dans le tableau <code>tab</code>, la méthode doit renvoyer -1.

source: The idea of the algorithm is to sweep over the whole array, checking the value of each cell. If it's the searched value, you should return the index of the cell currently checked.
fr: L'idée de l'algorithme est de parcourir tout le tableau en vérifiant la valeur contenue dans chaque case. S'il s'agit de la valeur cherchée, vous devez renvoyer l'indice de la case actuellement explorée.

source: The first thing to remember about arrays is that their indices begin at 0. So, if there is 3 cells, their indices will be 0, 1 and 2. There would not be any cell numbered 3.
fr: La première chose dont il faut se souvenir à propos des tableaux est que leurs indices sont numérotés à partir de 0. Donc, si vous avez 3 cases, leurs indices seront 0, 1 et 2. Il n'y aura pas de case numérotée 3.

source: Then, remember that the amount of cells in an array can be retrieved using the <code>length</code> attribute. So, if your array is called <code>tab</code>, its size can be retrieved as <code>tab.length</code>. Note that there is no () after <code>length</code>. An attribute is a sort of variable embedded in another object (here, the array).
fr: Ensuite, souvenez vous que le nombre de cases d'un tableau peut être retrouvé grâce à l'attribut <code>length</code>. Donc, si votre tableau s'appelle <code>tableau</code>, sa taille sera <code>tableau.length</code>. Notez qu'il n'y a pas de () après <code>length</code>. Un attribut est une sorte de variable embarquée dans un autre objet (ici, le tableau).

source: So, the last value of an array is given by <code>tab[tab.length - 1]</code>.
fr: Donc, la dernière valeur d'un tableau est donnée par <code>tab[tab.length -1]</code>.

source: Index of the maximum value
fr: Indice de la valeur maximale

source: In this exercise, you must compute the indice of the tab cell containing the biggest value.
fr: Dans cet exercice, vous devez calculer l'indice de la case contenant la plus grande valeur du tableau.

source: For that, fill the <code>indexOfMaximum(int[] tab)</code> method. Its parameter is the array to explore. Should the array contain the searched value several times, you should return the indice of the first occurrence.
fr: Pour cela, remplissez la méthode <code>indexOfMaximum(int[] tab)</code> dont le paramètre est le tableau à explorer. Si jamais la plus grande des valeurs du tableau est répétée plusieurs fois, votre méthode doit renvoyer la position de la première occurence.

source: To solve this exercise, you should sweep over the whole array. For each value, if it's bigger than the biggest value you saw so far, you must save this new champion and its position. You will thus need 2 extra variables; the initial value of the champion could be the value of the first cell.
fr: Pour résoudre cet exercice, vous devez parcourir le tableau. Pour chaque case, si sa valeur est plus grande que la plus grande des valeurs que vous avez rencontré jusque là, sauvegardez cette nouvelle championne et sa position. Il vous faut donc deux nouvelles variables; la valeur initiale de la championne pourrait être la valeur rangée dans la première case.

source: Average value
fr: Valeur moyenne

source: The objective of this exercise is to compute the average value of the integer values stored in an array.
fr: L'objectif de cet exercice est de calculer la valeur moyenne d'un tableau de valeur entière.

source: You have to fill the body of the method <code>average(int[] tab)</code> which takes as parameter the array of integers of which it computes and returns the average value. Please note that the return type of the method has type <code>int</code>.
fr: Vous devez donc remplir le corps de la méthode <code>average(int[] tab)</code> qui prend en paramètre le tableau, et qui retourne en résultat la valeur moyenne. Notez bien que le résultat de cette méthode est de type <code>int</code>

source: To compute the average value of an integer, it is necessary to traverse the whole array and to compute the sum of all its values (so you will need a variable to store this temporary result), then you have to divide this sum by the size of the array. In Java, you can get the size of an array <code>myarray</code> by consulting its <code>length</code> attribute (in other words, <code>myarray.length</code>).
fr: Pour calculer la valeur moyenne d'un tableau, il faut parcourir l'ensemble des valeurs du tableau, en faire la somme (vous aurez donc besoin d'une variable pour conserver le résultat intermédiaire), puis diviser cette somme par le nombre de valeur contenu dans le tableau. On vous rappelle que vous pouvez obtenir la taille d'un tableau <code>montableau</code> en consultant la valeur de l'attribut <code>length</code> de ce tableau (autrement dit <code>montableau.length</code>).

source: Maximal value
fr: Valeur maximale

source: In this exercise, you must compute the maximal value contained in an array. For that, fill the <code>maximum(int[] tab)</code> method, which parameter is the array to explore.
fr: Dans cet exercice, vous devez retrouver le maximum des valeurs stockées dans un tableau. Pour cela, remplissez le corps de la méthode <code>maximum(int[] tab)</code>, dont le paramètre est le tableau à explorer.

source: To compute this value, sweep over the whole parameter. For each value, if it's bigger than the biggest value you saw so far, you must save this value somewhere to remember it afterward. You thus need an extra variable, which can be initialized to the value of the first array cell. Another possibility is to initialize it to the smallest integer that Java knows about (which can be retrieved through <code>Integer.MIN_VALUE</code>).
fr: Pour résoudre cet exercice, parcourez le tableau. Pour chaque case, si sa valeur est plus grande que la plus grande des valeurs que vous avez rencontré jusque là, sauvegardez cette nouvelle championne pour retrouver sa valeur plus tard. Il vous faut donc une nouvelle variable; la valeur initiale de la championne pourrait être la valeur rangée dans la première case. Une autre possibilité est d'utiliser pour cela la plus petite valeur entière connue de Java (qui s'écrit <code>Integer.MIN_VALUE</code>).

source: Occurrence of a value
fr: Occurrences d'une valeur

source: In this exercise, you must compute the amount of occurrences of a given value in an array (that is, the amount of time that this value appears in the array). For that, fill the <code>occurrences(int[] tab, int lookingFor)</code> method, which returns the number of occurrence of <code>lookingFor</code> in <code>tab</code>.
fr: Dans cet exercice, il vous faut calculer le nombre d'occurrences d'une valeur donnée, c'est à dire le nombre de fois que cette valeur apparaît dans le tableau. Pour cela, remplissez le corps de la méthode <code>occurrences(int[] tab, int lookingFor)</code>, qui retourne le nombre d'occurrences de <code>lookingFor</code> dans <code>tab</code>.

source: To compute this value, simply sweep over the array counting for the amount of cells containing the searched value. You thus need an extra variable for that.
fr: Pour calculer cette valeur, parcourez simplement le tableau en comptant le nombre de cases contenant la valeur cherchée que vous rencontrez. Il vous faut donc un paramètre supplémentaire pour cela.

source: PancakeWorld
fr: Monde des crêpes

source: Functions provided :
fr: Fonctions fournies :

source: Returns the size of the stack, in other words the amount of pancakes it contains.
fr: Renvoie la taille du tas de crêpes, en d'autres mots, le nombre de crêpes qui le compose.

source: Returns the radius of the pancake you gave in argument.
fr: Renvoie le rayon de la crêpe donnée en argument.

source: Returns true if the burned side of the pancake you gave in argument is up, false if not.
fr: Renvoie vrai si le côté brûlé de la crêpe passée en argument est vers le haut, faux sinon.

source: Flips the <code>numberOfPancakes</code>code> first pancakes composing the stack, from the top of it.
fr: Retourne les <code>numberOfPancakes</code> premières crêpes de la pile, en partant du sommet de celle-ci.

source: Tells if the stack of pancakes is correctly sorted according to the control freak pancake seller
fr: Indique si le tas de crêpes est trié correctement au sens du vendeur de crêpe psychorigide.

source: The color of a base is given by its index. The hole has a color of -1. The base which has only one player on the field has <i>getAmountOfBases()-1</i> as index
fr: La couleur d'un base est donnée par son index. Le trou a -1 comme couleur. La base qui a un seul joueur sur le terrain a <i>getAmountOfBases()-1</i> comme index

source: <u>Functions provided:</u>
fr: <u>Fonctions fournies :</u>

source: Move the player on position <code>playerLocation</code> from the base <code>baseSrc</code> to the hole.
fr: Déplace le joueur de la position <code>playerLocation</code> de la base <code>baseSrc</code> au trou.

source: Return the color of the player on position <code>playerLocation</code> ( 0 or 1 ) from the base <code>baseIndex</code>.
fr: Renvoie la couleur du joueur de la position <code>playerLocation</code> ( 0 ou 1 ) de la base <code>baseIndex</code>.

source: Return the index of the base where the hole is located
fr: Renvoie l'index de la base où se trouve le trou

source: Return the player's position in the base where the hole is located
fr: Renvoie la position de joueur vide dans la base où se situe le trou

source: Return TRUE if all players of the base <code>baseSrc</code> are home
fr: Renvoie VRAI si tous les joueurs sur la base <code>baseSrc</code> sont sur la bonne base.

source: Return the amount of bases in the field.
fr: Renvoie le nombre de bases dans le terrain

source: Return the amount of players locations available on each base of the field
fr: Renvoie le nombre de positions de joueur disponible sur chaque base du terrain

source: Computer Science in Real Life
fr: Sciences Manuelles du Numérique

source: Few activities developped for Computer Science in Real Life
fr: Différentes activités développées pour les Sciences Manuelles du Numérique

source: This world implements the control freak pancake seller problem, who wants his pancakes to be sorted on their plate from the biggest to the smallest, with the most burned face downside, so that we cannot see it.
fr: Ce monde implémente le problème du crêpier psychorigide, qui souhaite trier ses crêpes de la plus grande à la plus petite, et avec la face brûlée cachée ( donc vers le bas, afin que l'on ne puisse pas la voir ).

source: You are asked to resort a pancakes stack to make him happy. Since it is obviously forbidden to place a pancake on the dirty table, the only allowed action is to flip one or more pancakes on the top of the stack. A pancake is defined by its radius and position on the stack, from the top to the bottom. These characteristics are positive integers.
fr: Votre mission si vous l'acceptez est de trier un tas de crêpe pour le rendre heureux. Puisque qu'il est évidemment interdit -- pour des questions d'hygiène -- de poser une crêpe sur la table, la seule action autorisée est de retourner une ou plusieures crêpes depuis le haut de la pile. Une crêpe est définie par son rayon et par sa position dans la pile, en partant du haut. Ces attributs sont des entiers positifs.

source: Only four functions are provided :
fr: Seulement quatre fonctions vous sont fournies :

source: Returns the radius of the pancake <code>pancakeNumber</code>.
fr: Renvoie le rayon de la crêpe <code>pancakeNumber</code>.

source: Returns true if the burned side of the pancake <code>pancakeNumber</code> is up, false if not.
fr: Renvoie vrai si le côté brûlé de la crêpe <code>pancakeNumber</code> est vers le haut, faux sinon.

source: Flips the <code>numberOfPancakes</code> first pancakes composing the stack, from the top of it.
fr: Retourne les <code>numberOfPancakes</code> premières crêpes de la pile, en partant du sommet de celle-ci.

source: This world implements the control freak pancake seller problem, who wants his pancakes to be sorted on their plate from the biggest to the smallest.
fr: Ce monde implémente le problème du crêpier psychorigide, qui souhaite trier ses crêpes de la plus grande à la plus petite.

source: Only three functions are provided :
fr: Seulement trois fonctions sont fournies :
