Repository: BuggleInc/PLM
Catalog: lib/l10n/*.po
Languages: fr

source: It becomes harder when we want to draw two doghouses: we have to rewrite the same code twice, which is not really handy. Even worse: it's definitively not good form to duplicate code this way. Indeed, if you realize that an error sneaked into a code that you copied at several locations, you will have to fix it several times. And mind your back if you forget one of these locations.
fr: Les problèmes commencent quand nous voulons faire faire deux cabanes à la buggle : Il faut réécrire le code deux fois, ce qui n'est pas très pratique. Pire que ça, une telle duplication de code est en général très mal vu. En effet, si vous vous rendez compte que vous vous êtes trompé dans votre code, et que vous l'avez recopier à plusieurs endroits, il va falloir le corriger plusieurs fois. Et gare si vous oubliez de corriger un exemplaire.

source: It is good form to <b>factorize your code</b>, ie to write it only once, for example in a method. This is what you will do now. It is even possible to go further by factorizing the method body with a <code>for</code> loop, as seen previously.
fr: Il est bien préférable de <b>factoriser votre code</b>, c'est-à-dire d'écrire le code une seule fois, par exemple dans une méthode. C'est ce que vous allez faire maintenant. Il est même possible d'aller plus loin en factorisant le code de la méthode avec une boucle <code>for</code> comme vu précédemment.

source: The goal of this exercise is to write a method called <code>dogHouse</code> achieving the same result than the code above. The buggle will call your creation to create several dog houses around its world. Remind to factorize your method with a for loop.
fr: <a name="Objectifs"> L'objectif de cet exercice est d'écrire une méthode nommée <code>dogHouse()</code> et exécute le code ci-dessus. La buggle invoquera plusieurs fois votre oeuvre afin de dessiner des cabanes un peu partout. Pensez à factoriser le code de votre méthode avec une boucle for.

source: You're up.
fr: À vous de jouer.

source: Writing a method returning a result is not really more work than writing a method without any result. <span class="Java">You simply have to specify the data type of expected results before the method name</span>. And, then write a <code>return</code> instruction in your method body to specify the actual value to return.
fr: Écrire des méthodes retournant un résultat n'est pas bien plus compliqué qu'écrire une méthode n'en renvoyant pas. <span class="Java"> Vous devez simplement indiquer le type du résultat attendu avant le nom de la méthode</span>. Il faut écrire dans le corps de la méthode une instruction <code>return</code> qui précise la valeur à renvoyer.

source: double pi() { &nbsp;&nbsp;&nbsp;&nbsp;return 3.14159; } boolean isNumberTwoEven() { &nbsp;&nbsp;&nbsp;&nbsp;return true; }
fr: double pi() { &nbsp;&nbsp;&nbsp;&nbsp;return 3.14159; } boolean deuxEstIlPair() { &nbsp;&nbsp;&nbsp;&nbsp;return true; }

source: def pi(): &nbsp;&nbsp;&nbsp;&nbsp;return 3.14159 def isNumberTwoEven(): &nbsp;&nbsp;&nbsp;&nbsp;return True
fr: def pi(): &nbsp;&nbsp;&nbsp;&nbsp;return 3.14159 def deuxEstIlPair(): &nbsp;&nbsp;&nbsp;&nbsp;return True

source: It is possible to have several <code>return</code> instructions in several branches of a conditional. It is even forbidden to have one execution path of your body without any <code>return</code>, or to write some code after the <code>return</code> instruction.
fr: Il est possible d'avoir plusieurs instructions <code>return</code> dans différentes branches de <code>if</code>. Ce qui est interdit, c'est d'avoir une branche du code qui n'est pas terminée par un <code>return</code>, ou d'écrire du code après le <code>return</code>.

source: Indeed, if the machine reaches the end of the method without finding any <code>return</code>, it cannot know what actual value to give back to the method caller. Moreover, <code>return</code> interrupts immediately the method execution (why bother looking further when you know the method result?). So, if there is some code after a <code>return</code>, it must be an error and the compiler warns you.
fr: En effet, si la machine arrive à la fin de la méthode sans avoir rencontré de <tt>return</tt>, elle ne peut pas savoir quelle valeur communiquer à celui qui a appelé la méthode. De plus, le <tt>return</tt> interrompt immédiatement l'exécution de la méthode (pourquoi continuer à chercher quand on a déjà trouvé le résultat de la méthode?). Donc, s'il y a du code après un <tt>return</tt>, c'est sans doute une erreur, et le compilateur vous l'indique.

source: boolean negation(boolean cond) { &nbsp;&nbsp;&nbsp;&nbsp;if (cond == true) { &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;return true; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span class="comment">/* no code allowed here */</span> &nbsp;&nbsp;&nbsp;&nbsp;} else { &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;return false; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span class="comment">/* here neither */</span> &nbsp;&nbsp;&nbsp;&nbsp;} &nbsp;&nbsp;&nbsp;&nbsp;<span class="comment">/* even here, forget it */</span> }
fr: boolean negation(boolean cond) { &nbsp;&nbsp;&nbsp;&nbsp;if (cond == true) { &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;return true; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span class="comment">/* interdit d'écrire du code ici */</span> &nbsp;&nbsp;&nbsp;&nbsp;} else { &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;return false; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span class="comment">/* ici aussi */</span> &nbsp;&nbsp;&nbsp;&nbsp;} &nbsp;&nbsp;&nbsp;&nbsp;<span class="comment">/* même ici */</span> }

source: def negation(cond): &nbsp;&nbsp;&nbsp;&nbsp;if cond == True: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;return True &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span class="comment"># no code allowed here</span> &nbsp;&nbsp;&nbsp;&nbsp;else: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;return False &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span class="comment"># here neither</span> &nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;<span class="comment"># even here, forget it</span>
fr: def negation(cond): &nbsp;&nbsp;&nbsp;&nbsp;if cond == True: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;return True &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span class="comment"># interdit d'écrire du code ici</span> &nbsp;&nbsp;&nbsp;&nbsp;else: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;return False &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span class="comment"># ici aussi</span> &nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;<span class="comment"># même ici</span>

source: You will once again write a method that the buggle will use. Its name must be <code>haveBaggle</code>, and it returns a boolean value indicating whether the row in front of the buggle contains a baggle or not. The buggle will use it to search the first row containing a baggle, and stop here.
fr: <a name="Objectifs"> Vous allez encore une fois écrire une méthode qui sera utilisée par la buggle. Son nom doit être <code>haveBaggle</code>, et elle doit renvoyer un booléen indiquant si la colonne face à la buggle contient un baggle ou non. Votre buggle va s'en servir pour chercher la première colonne contenant un baggle et s'y arrêter.

source: The easier for this method is to use a boolean variable called <code>seenBaggle</code> indicating whether or not we saw a baggle so far. It initial value is 'false'.
fr: Le plus simple pour écrire cette méthode est peut être d'utiliser une variable booléenne <code>vuBaggle</code> indiquant si on a vu un baggle jusque là. Initialement, elle contient faux.

source: Then, move 6 steps forward (the world contains 7 cells and we already are one one of them). For each cell, if it contains a baggle, we store true in <code>sawBaggle</code> (and we don't do anything but moving forward if not).
fr: Ensuite, on avance de 6 cases (le monde contient 7 cases, et on est déjà sur l'une d'entre elles). Pour chaque case, si elle contient un baggle, on range la valeur vrai dans <tt>vuBaggle</tt> (et on ne fait rien d'autre qu'avancer si non).

source: At the end, we move back by 6 steps, and we return the value of <code>seenBaggle</code> to the caller.
fr: Quand on est arrivé à la fin, on recule de 6 cases, et on retourne le contenu de <tt>vuBaggle</tt> à l'appelant.

source: This exercise is a bit different since there is two initial worlds, each with a specific objective. Your code must work for each of them. Observe that the world selection scrolling menu (right below the speed slider) allows to switch the observed world.
fr: Cet exercice est un peu particulier, puisqu'il a deux mondes initiaux, chacun ayant un objectif particulier. Votre code doit fonctionner pour chacun d'entre eux. Remarquez que le menu déroulant de sélection du monde (juste sous la barre de réglage de la vitesse) permet de spécifier le monde que vous souhaitez observer.

source: When your method <code>haveBaggle</code> works, proceed to next exercise.
fr: Quand votre méthode <tt>haveBaggle</tt> fonctionne, passez à l'exercice suivant.

source: Don't you get tired of writing again and again the code to move by a fixed amount of steps? On the other hand, writing <tt>forward2()</tt>, <tt>forward3()</tt>, <tt>forward4()</tt>, as well as <tt>backward2()</tt>, <tt>backward3()</tt>, <tt>backward4()</tt>, and so on does not really help
fr: N'êtes vous pas fatigué d'écrire encore et encore le code qui permet d'avancer ou de reculer d'un nombre prédéterminé pas ? Oui, mais écrire les méthode <tt>forward2()</tt>, <tt>forward3()</tt>, <tt>forward4()</tt>, et <tt>backward2()</tt>, <tt>backward3()</tt>, <tt>backward4()</tt>, et ainsi de suite, ça ne constitue pas un réel gain de temps...

source: Luckily, it is possible to pass <b>parameters</b> to your methods. You have to specify their type and name between the parenthesis after the method name. Then, you can use them in the method body as if it were variables defined in there, and which initial value is what the caller specified.
fr: Heureusement, il est possible de donner des <b>paramètres</b> à vos méthodes. Il faut marquer leur type et leur nom entre les parenthèses qui suivent le nom de la méthode. Ensuite, on peut les utiliser dans le corps de la fonction comme s'il s'agissait de variables définies ici.

source: double divideByTwo(double x) { &nbsp;&nbsp;return x / 2; }
fr: double diviseParDeux(double x) { &nbsp;&nbsp;return x / 2; }

source: def divideByTwo(x): &nbsp;&nbsp;return x / 2
fr: def diviseParDeux(x): &nbsp;&nbsp;return x / 2

source: As caller, you have to specify the initial value of this "variables" between the call's parenthesis.
fr: À l'usage, il faut indiquer les valeurs qu'elles doivent prendre entre les parenthèses de l'appel.

source: double y = divideByTwo(3.14);
fr: double y = diviseParDeux(3.14);

source: y = divideByTwo(3.14)
fr: y = diviseParDeux(3.14);

source: If you want several parameters, you need to separate them with comas (,) both in the declaration and calls.
fr: Si on veut avoir plusieurs paramètres, il faut les séparer par des virgules, lors de la déclaration comme lors de l'appel.

source: double divide(double x, double y) { &nbsp;&nbsp;return x / y; }
fr: double divise(double x, double y) { &nbsp;&nbsp;return x / y; }

source: double y = divide(3.14 , 1.5);
fr: double y = divise(3.14 , 1.5);

source: def divide(double x, double y): &nbsp;&nbsp;return x / y }
fr: def divise(double x, double y): &nbsp;&nbsp;return x / y }

source: y = divide(3.14 , 1.5)
fr: y = divise(3.14 , 1.5);

source: In Java, you can declare several methods of the same name as long as they don't have the same parameter types and number (they are said to have different <b>signature</b>).
fr: En Java, il est possible d'avoir plusieurs méthodes du même nom, à condition qu'elles n'aient pas le même nombre et les mêmes types de paramètres (on dit qu'elles n'ont pas la même <b>signature</b>).

source: int max(int x, int y) { if (x > y) { return x; } return y; } int max(int x, int y, int z) { if (x > y && x > z) { return x; } if (y > z) { return y; } return z; }
fr: int max(int x, int y) { &nbsp;&nbsp;if (x > y) { &nbsp;&nbsp;&nbsp;&nbsp;return x; &nbsp;&nbsp;} &nbsp;&nbsp;return y; } int max(int x, int y, int z) { &nbsp;&nbsp;if (x > y && x > z) { &nbsp;&nbsp;&nbsp;&nbsp;return x; &nbsp;&nbsp;} &nbsp;&nbsp;if (y > z) { &nbsp;&nbsp;&nbsp;&nbsp;return y; &nbsp;&nbsp;} &nbsp;&nbsp;return z; }

source: Observe that we omitted the <tt>else</tt> branches of each <tt>if</tt>. It works anyway because a <tt>return</tt> interrupts the method execution. If we arrive to the last line of <code>max(int,int)</code>, we know that <code>x&lt;=y</code> because on the other case, the <tt>return</tt> of line 2 would have stopped the execution.
fr: Remarquez que nous avons ici laissé de coté les <tt>else</tt> de chaque alternative. Cela fonctionne tout de même car un <tt>return</tt> interrompt l'exécution de la méthode. Si on arrive à la dernière ligne de <code>max(int,int)</code>, on est donc sur que <code>x&lt;=y</code> car dans le cas contraire, le <tt>return</tt> de la deuxième ligne aurait arrêté l'exécution de la fonction.

source: This time, you have to write a <code>move(int stepCount,boolean forward)</code> method which move forward of <code>stepCount</code> if <code>forward</code> is true, and move back of that amount of steps if the boolean is false. The buggle will use some methods we did not introduce yet to guess its position and orientation in order to determine the amount of steps to do and their direction, but it is not relevant here.
fr: <a name="Objectifs"> Il s'agit cette fois d'écrire une méthode <code>move(int nbPas, boolean forward)</code> qui avance de <code>nbPas</code> si <code>forward</code> est vrai, et recule d'autant de pas si le booléen est faux. La buggle s'en servira pour retourner sur la ligne du haut. Elle utilisera au passage des méthodes que l'on ne connaît pas encore pour deviner sa position et sa direction actuelles afin de calculer le sens et le nombre de pas à faire (mais ce n'est pas important ici).

source: This time, there is only one world, and seven buggles. But it does not change anything for you, since the same code is used for any buggles.
fr: Cette fois, il y a un seul monde, et sept buggles. Mais ça ne change pas grand chose pour vous, puisque toutes sont ici régies par le même code.

source: The code of the method to write should not be really problematic for you.
fr: Le code de la méthode à proprement parler ne devrait pas poser de problème.

source: What's coming next?
fr: Et ensuite?

source: You now know the very basics of programming. At least, we introduced all the important concepts, and you should be able to read most code by now. If you want to play safe, you should proceed to the next exercises of this lesson to solidify your knowledge by reusing these concepts in various simple situations. After taking them, you'll master what's called "Tactical programming", meaning that you will master the syntax enough to not have any issue with it, allowing you to focus on the fundamental problems of what you want to solve instead of struggling with syntaxic difficulties. Some of these exercises are even fun to do ;)
fr: Vous connaissez maintenant les bases de la programmation. Disons au moins que vous avez vu les concepts les plus important et que vous devriez être capable de lire et comprendre la plupart des programmes écrits. Pour plus de sécurité, vous devriez faire les autres exercices de cette leçon pour solidifier vos acquis en les réutilisant dans diverses situations. Après cela, vous maîtriserez ce qu'on appelle la "programmation tactique", ce qui veut dire que votre maîtrise de la syntaxe vous permettra de vous concentrer sur les problèmes à résoudre sans vous battre contre le compilateur à propos de la syntaxe. Certains de ces exercices sont même amusants à résoudre ;)

source: If you are in a hurry and want more, you can skip these exercises and proceed directly to more interesting challenges. For example, the <i>Labyrinths</i> lesson will teach you about maze escaping algorithms, which are not rocket science but require several improvements to work for any kind of maze. The <i>Lightbot</i> lesson is a little programming game where you control a little robot wanting to light the world. Since it is not programmed in a language but graphically, the first exercises can be used as an introduction activity to what programming means for real beginners, but the last exercises constitute challenges and brain teaser even to professional programmers.
fr: Si vous êtes pressés et voulez plus, vous pouvez sauter ces exercices et passer directement à des exercices plus complets et plus intéressants. Par exemple, la leçon sur les <i>Labyrinthes</i> vous apprendra à sortir d'un labyrinthe. Les algorithmes impliqués ne sont pas ultra complexes, mais vous serez amenés à améliorer votre code à plusieurs reprises afin de pouvoir sortir de n'importe quel type de labyrinthe. La leçon <i>LightBot</i> est un petit jeu de programmation où vous contrôlez un robot voulant éclairer le monde. Comme il est programmé graphiquement et non dans un language syntaxique, les premiers exercices peuvent être utilisés comme une introduction à ce que programmer veut dire pour les débutants. Mais les derniers exercices sont plus difficiles et devraient constituer des casse-têtes même pour les programmeurs professionnels.

source: In this exercise, we will reproduce the geometric drawing that you can see in the "Objective" tab.
fr: Dans cet exercice, nous allons reproduire un dessin géométrique, que vous pouvez voir en cliquant sur l'onglet "Objective".

source: Your goal (here and in any well written program) is to write the simplest possible <code>run()</code>. For that, you have to decompose your work in sub-steps, and write a specific method for each sub-step.
fr: Votre objectif (ici, et dans tous les programmes bien faits) est d'écrire une méthode <code>run()</code> la plus simple possible. Pour cela, vous veillerez à décomposer le travail à faire en sous-étape, et à faire réaliser chaque sous-étape par une méthode particulière.

source: Your goal (here and in any well written program) is to write the simplest possible main code. For that, you have to decompose your work in sub-steps, and write a specific method for each sub-step.
fr: Votre objectif (ici, et dans tous les programmes bien faits) est d'écrire une méthode principale la plus simple possible. Pour cela, vous veillerez à décomposer le travail à faire en sous-étape, et à faire réaliser chaque sous-étape par une méthode particulière.

source: If you observe carefully the picture to draw, it is constituted of four parts depicting a sort of V using a different color. A possible decomposition is to write a method in charge of drawing a V of the specified color from the current position. Its prototype can be:
fr: Si on observe attentivement le modèle à dessiner, on remarque qu'il est composé de quatre formes en sorte de V de couleurs différentes, et à des positions différentes. Un découpage possible est d'écrire une fonction chargée de faire un V de la couleur indiquée à partir de la position courante. Son prototype peut être :

source: The <code>Color</code> data type naturally describes a particular color. Your <code>run()</code> method should probably call <code>makeV</code> with the following arguments (a different color for each call):
fr: Le type de données <code>Color</code> représente naturellement une couleur en particulier. Votre méthode <code>run()</code> invoquera sans doute <code>makeV</code> avec les arguments suivants (une couleur différente à chaque appel) :

source: In <code>makeV()</code>, you should use the <code>setBrushColor()</code> method (predefined in the buggle) to change the color of the buggle's brush, as well as <code>brushUp()</code> and <code>brushDown()</code> to change the brush position.
fr: Dans la méthode <code>makeV()</code>, il faut utiliser la méthode <code>setBrushColor()</code>, qui est prédéfinie dans la buggle, pour changer la couleur du pinceau, ainsi que <code>brushUp()</code> et <code>brushDown()</code> pour lever et baisser le pinceau.

source: It may be wise to write the <code>makeV()</code> so that it places directly the buggle in position for the next V.
fr: Il faudrait également que la méthode <code>makeV()</code> place la buggle en position pour dessiner le prochain V directement.

source: Your turn. The <code>run()</code> method should not be longer than 4 lines...
fr: À vous de jouer. La méthode <code>run()</code> ne devrait pas prendre plus de quatre lignes...

source: We will now reproduce an even bigger geometrical drawing. Once again, you can see the model by clicking on the "Objective" tab.
fr: Nous allons maintenant reproduire un dessin géométrique plus grand. Encore une fois, vous pouvez voir le modèle en cliquant sur l'onglet "Objective".

source: You can naturally reuse all the code you typed in previous exercise (select the other exercise, do Ctrl-C, come back to the code of this exercise, do Ctrl-V).
fr: Vous pouvez bien entendu réutiliser tout le code que vous aviez tapé à l'exercice précédent (sélectionnez l'autre exercice, allez dans le code, sélectionner tout, faites Ctrl-C, revenez dans le code de l'exercice courant, faites Ctrl-V).

source: But you want to keep your main<code>run()</code> as simple as possible. For that, define new methods to deal simply with the repetitions in the pattern. For example, a method <code>makePattern()</code> achieving the pattern of previous example seems to be a good idea (but this may not be enough).
fr: Mais pour que votre méthode principale <code>run()</code> reste aussi simple que possible, il faudra définir de nouvelles méthodes afin de gérer simplement les répétions du motif. Par exemple, une méthode <code>makePattern()</code> réalisant le motif de l'exercice précédent semble être un bon départ (mais ce n'est sans doute pas suffisant).

source: But you want to keep your main code as simple as possible. For that, define new methods to deal simply with the repetitions in the pattern. For example, a method <code>makePattern()</code> achieving the pattern of previous example seems to be a good idea (but this may not be enough).
fr: Mais pour que votre méthode principale reste aussi simple que possible, il faudra définir de nouvelles méthodes afin de gérer simplement les répétions du motif. Par exemple, une méthode <code>makePattern()</code> réalisant le motif de l'exercice précédent semble être un bon départ (mais ce n'est sans doute pas suffisant).

source: Why don't you give it a shot? The <code>run()</code> method shouldn't take more than 2 lines (included in a for loop)
fr: À vous de jouer. La méthode <code>run()</code> ne devrait pas prendre plus de 2 lignes, incluses dans une boucle for...

source: Why don't you give it a shot? The main code method shouldn't take more than 2 lines (included in a for loop)
fr: À vous de jouer. Le code de la méthode principale ne devrait pas prendre plus de 2 lignes ( incluses dans une boucle for)

source: As you can imagine, you have to reproduce the geometric drawing depicted in the "Objectives" tab. As you can see, it is even bigger than the previous one.
fr: Vous vous en doutez, il vous faut encore une fois reproduire un dessin géométrique dont le modèle se trouve dans l'onglet "Objective". Comme vous le voyez, il est encore plus grand que le précédent.
