Repository: BuggleInc/PLM
Catalog: lib/l10n/*.po
Languages: fr

source: You thus have to declare even more methods to use the repetitions of the pattern and factorize your code. Another solution is to <i>parametrize</i> your functions to reuse the code you wrote previously by changing the size.
fr: Il va donc falloir définir encore plus de méthodes afin de tirer partie des répétitions du motif pour factoriser votre code. Ou alors, il va falloir <i>paramétrer</i> vos fonctions pour réutiliser ce que vous aviez écrit en changant les tailles.

source: Your turn...
fr: À vous de jouer...

source: (and methods to write)
fr: (et des méthodes à écrire)

source: Here is yet another exercise where you have to reproduce the pattern provided in the "Objective" tab.
fr: Voici de nouveau un exercice où il faut reproduire un motif donné dans l'onglet "Objective".

source: This one is a bit more difficult than the one seen previously. Look for repeating patterns, even if the color changes, and write a method drawing each of them.
fr: Celui-ci est un peu plus difficile que ceux vus précédement. Cherchez les motifs qui se répètent, même si la couleur change, et faites une méthode dessinant chacun d'entre eux.

source: Good luck!
fr: Bon courage !

source: Today is a great day: we will learn the buggles to play Dance Revolution, this game beloved of some students where the player has to move its feet on the carpet according to the instructions presented on the screen, and following the music. But before that, we have some details to study first.
fr: Aujourd'hui est un grand jour : nous allons apprendre à nos buggles à jouer à Dance Revolution, ce jeu très prisé de certains étudiants où le joueur doit bouger sur un tapis prévu à cet effet en fonction des consignes présentées à l'écran en rythme avec la musique. Mais avant cela, nous avons quelques détails à étudier.

source: Conditionals without curly braces
fr: Conditionnelles sans accolades

source: There is one detail we omitted about the conditional syntax: if a branch contains only one instruction, then the curly braces become optional. So, the two chunk of code are equivalent:
fr: Il y a un détail que nous avons omis à propos de la syntaxe des conditionnelles : si une branche ne contient qu'une seule instruction, les accolades sont optionnelles. Ainsi, les deux extraits suivants sont équivalents:

source: if (<b>condition</b>) { <b>whatToDoIfTheConditionIsTrue();</b> } else { <b>whatToDoElse();</b> }
fr: if (<b>condition</b>) { <b>quoiFaireSiLaConditionEstVraie();</b> } else { <b>quoiFaireSinon();</b> }

source: if (<b>condition</b>) <b>whatToDoIfTheConditionIsTrue();</b> else <b>whatToDoElse();</b>
fr: if (<b>condition</b>) <b>quoiFaireSiLaConditionEstVraie();</b> else <b>quoiFaireSinon();</b>

source: But beware, this becomes dangerous if you chain the <tt>if</tt> instructions like this:
fr: Mais attention, ceci peut être dangereux si on enchaîne les <tt>if</tt> comme dans l'exemple suivant.

source: In fact, it does not turn right when there is no baggle on the ground AND x equals 5, but when the buggle found a baggle on the ground and x equals anything but 5. Putting this otherwise, the buggle understands the previous code as if it were written the following way (note that the <tt>else</tt> were moved to the right):
fr: En fait, ça ne tourne pas à droite quand il n'y a pas un baggle par terre ET que x vaut 5, mais quand la buggle a trouvé un baggle, et que x vaut une autre valeur. Autrement dit, la buggle lit le code précédent comme suit (notez que le <tt>else</tt> est décalé vers la droite par rapport à précédemment) :

source: The first lesson of this is that the indentation is very helpful to help humans understanding, but it's of no importance for the actual meaning of the code. We could have written the following code and obtain the same result. But beware, if you want a human to read and review your code, you really want to indent it correctly. That's for example the case if you want a professor to read it (to grade it or to answer a question about it), or if you want to reuse your code later.
fr: La première leçon, c'est que l'indentation aide les humains à comprendre, mais elle est sans importance pour la signification du code. On aurait tout aussi bien pu écrire le code suivant et obtenir le même résultat. Mais attention, si on veut qu'un humain puisse relire le code, l'indentation devient très importante voire indispensable. C'est par exemple le cas si votre code doit être relu par un professeur (pour qu'il le note ou pour lui poser une question), ou si vous comptez réutiliser votre code plus tard.

source: The second lesson is that a <tt>else</tt> branch always connects to the closest <tt>if</tt>. This may be a bit troublesome in some case, and it may be easier to add more braces than strictly needed to remove any ambiguity.
fr: La seconde leçon, c'est qu'une branche <tt>else</tt> se raccroche toujours au <tt>if</tt> le plus proche. C'est parfois un peu contre-intuitif, et il est préférable d'ajouter plus d'accolades que nécessaire pour lever toute ambiguïté.

source: Chaining conditionals
fr: Enchaînements de conditionnelles

source: You sometimes want to ask the buggle something similar to:
fr: Il arrive que l'on veuille demander à la buggle quelque chose similaire à :

source: if it's raining, take an umbrella; if not, and if it's a hot day, take a bottle of water; if not and if it's July 4th, take an american flag
fr: s'il pleut, prend un parapluie; si non, s'il fait chaud, prend une bouteille d'eau; si non, si nous sommes le 14 juillet, prend un drapeau français

source: The trap is that we want at most one of these actions to be taken. That is to say, if it's raining a very hot July 4th, we don't want the buggle to get outside with an umbrella, some water and a flag, but simply with an umbrella. The following code is thus WRONG.
fr: Le piège étant que nous voudrions qu'au plus l'une de ces actions soient réalisées. C'est à dire, que s'il pleut un 14 juillet très chaud, on ne veut pas que la buggle sorte avec un parapluie, de l'eau et un drapeau, mais juste avec un parapluie. Le code suivant est donc faux.

source: if (rainy()) { &nbsp;&nbsp;&nbsp;&nbsp;takeUmbrella(); } if (hot()) { &nbsp;&nbsp;&nbsp;&nbsp;takeWater(); } if (todayIsJuly4th()) { &nbsp;&nbsp;&nbsp;&nbsp;takeFlag(); }
fr: if (ilPleut()) { prendreParapluie(); } if (ilFaitChaud()) { prendreDeLEau(); } if (sommes14Juillet()) { prendreDrapeau(); }

source: if rainy(): &nbsp;&nbsp;&nbsp;&nbsp;takeUmbrella() if hot(): &nbsp;&nbsp;&nbsp;&nbsp;takeWater() if todayIsJuly4th(): &nbsp;&nbsp;&nbsp;&nbsp;takeFlag()
fr: if ilPleut(): &nbsp;&nbsp;&nbsp;&nbsp;prendreParapluie() if ilFaitChaud(): &nbsp;&nbsp;&nbsp;&nbsp;prendreDeLEau() if sommes14Juillet(): &nbsp;&nbsp;&nbsp;&nbsp;prendreDrapeau()

source: Indeed, since the conditions are evaluated one after the other, there is a risk that you go to the July 4th march on a rainy day. Instead, we should use something like this:
fr: En effet, toutes les conditions sont évaluées les unes après les autres, et on risque donc d'aller au défilé un jour de pluie. À la place, il faut donc écrire quelque chose comme :

source: if (rainy()) { &nbsp;&nbsp;&nbsp;&nbsp;takeUmbrella(); } else { &nbsp;&nbsp;&nbsp;&nbsp;if (hotDay()) { &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;takeWater(); &nbsp;&nbsp;&nbsp;&nbsp;} else { &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;if (todayIsJuly4th()) { &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;takeFlag(); &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;} &nbsp;&nbsp;&nbsp;&nbsp;} }
fr: if (ilPleut()) { &nbsp;&nbsp;&nbsp;&nbsp;prendreParapluie(); } else { &nbsp;&nbsp;&nbsp;&nbsp;if (ilFaitChaud()) { &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;prendreDeLEau(); &nbsp;&nbsp;&nbsp;&nbsp;} else { &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;if (sommes14Juillet()) { &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;prendreDrapeau(); &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;} &nbsp;&nbsp;&nbsp;&nbsp;} }

source: if rainy(): &nbsp;&nbsp;&nbsp;&nbsp;takeUmbrella() else: &nbsp;&nbsp;&nbsp;&nbsp;if hotDay(): &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;takeWater() &nbsp;&nbsp;&nbsp;&nbsp;else: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;if todayIsJuly4th(): &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;takeFlag()
fr: if ilPleut(): &nbsp;&nbsp;&nbsp;&nbsp;prendreParapluie() else: &nbsp;&nbsp;&nbsp;&nbsp;if ilFaitChaud(): &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;prendreDeLEau() &nbsp;&nbsp;&nbsp;&nbsp;else: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;if sommes14Juillet(): &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;prendreDrapeau()

source: Such a cascade of conditionals are quite difficult to read, and it is better to omit the curly braces for the <tt>else</tt> statements. Some languages even introduce a specific construct for these <tt>else if</tt> (but Java doesn't).
fr: Une telle cascade de conditionnelles est un peu difficile à lire, et il est préférable d'omettre les accolades associées aux <tt>else</tt> comme suit. Il y a même certains langages qui introduisent un mot-clé spécial pour ces <tt>else if</tt> (mais pas Java).

source: if (rainy()) { &nbsp;&nbsp;&nbsp;&nbsp;takeUmbrella(); } else if (hotDay()) { &nbsp;&nbsp;&nbsp;&nbsp;takeWater(); } else if (todayIsJuly4th()) { &nbsp;&nbsp;&nbsp;&nbsp;takeFlag(); }
fr: if (ilPleut()) { prendreParapluie(); } else if (ilFaitChaud()) { prendreDeLEau(); } else if (sommes14Juillet()) { prendreDrapeau(); }

source: Such a cascade of conditionals are quite difficult to read, and it is better to omit extra indentation for the <tt>else</tt> statements. In Python, there is a specific construct for this: <tt>elif</tt>.
fr: Une telle cascade de conditionnelles est un peu difficile à lire, et il est préférable d'omettre les indentations supplémentaires associées aux <tt>else</tt> comme suit. Le mot-clé <tt>elif</tt> du langage Python permet de faire ceci facilement.

source: if rainy(): &nbsp;&nbsp;&nbsp;&nbsp;takeUmbrella() elif hotDay(): &nbsp;&nbsp;&nbsp;&nbsp;takeWater() elif todayIsJuly4th(): &nbsp;&nbsp;&nbsp;&nbsp;takeFlag()
fr: if ilPleut(): &nbsp;&nbsp;&nbsp;&nbsp;prendreParapluie() elif ilFaitChaud(): &nbsp;&nbsp;&nbsp;&nbsp;prendreDeLEau() elif sommes14Juillet(): &nbsp;&nbsp;&nbsp;&nbsp;prendreDrapeau()

source: Graffitis in the Buggle World
fr: Les graffitis dans le monde des buggles

source: Buggles can write graffitis on the ground of their world. For that, they use the four following methods:
fr: Les buggles peuvent écrire des choses par terre dans leur monde. Pour ce faire, elles utilisent les quatre méthodes suivantes:

source: <code>boolean isOverMessage()</code>: returns <code>true</code> if and only if there is a message on the ground.
fr: <code>boolean isOverMessage()</code> : renvoie vrai (<code>true</code>) si et seulement s'il y a un message écrit par terre.

source: <code>boolean isOverMessage()</code>: returns <code>True</code> if and only if there is a message on the ground.
fr: <code>boolean isOverMessage()</code> : renvoie vrai (<code>True</code>) si et seulement s'il y a un message écrit par terre.

source: <code>String readMessage()</code>: returns the message written on the ground (or an empty string if nothing is written).
fr: <code>String readMessage()</code> : renvoie le message qu'il y a écrit par terre (s'il y a rien, on obtient une chaîne vide).

source: <code>void writeMessage(String msg)</code>: writes the specified message down on the ground. If there is already a message on the ground, the new content is added at the end of the existing message.
fr: <code>void writeMessage(String msg)</code> : écrit le message spécifié en argument par terre. S'il y a déjà quelque chose écrit par terre, on ajoute le nouveau message à la fin du précédent.

source: <code>void clearMessage()</code>: clears what is written on the ground.
fr: <code>void clearMessage()</code> : efface ce qui est écrit par terre.

source: <a name="Objectives">The goal is then to organize a BDR game between the buggles by learning them to move according to the instructions written on the ground. These instructions are messages written on the ground, with the following signification:
fr: <a name="Objectifs"> L'objectif est donc d'organiser une partie de BDR entre les buggles en leur apprenant à bouger en fonction des indications écrites par terre. Ces indications sont des messages au sol, avec le code suivant:

source: Message
fr: Indication

source: What to do
fr: Quoi faire

source: Mnemonic
fr: Mnémotechnique

source: Turn right and move one step forward
fr: Tourner à droite et avancer d'une case

source: Turn left and move one step forward
fr: Tourner à gauche et avancer d'une case

source: Turn back (U-turn) and move one step forward
fr: Tourner en sens inverse (demi tour) et avancer d'une case

source: Move one step forward
fr: Avancer d'une case

source: First letter of the alphabet
fr: Première lettre de l'alphabet

source: Move two steps forward
fr: Avancer de deux cases

source: Second letter of the alphabet
fr: Deuxième lettre de l'alphabet

source: Move three steps forward
fr: Avancer de trois cases

source: Third letter of the alphabet
fr: Troisième lettre de l'alphabet

source: Move one step backward
fr: Reculer d'une case

source: One letter before the end of the alphabet
fr: A une lettre de la fin de l'alphabet

source: Move two steps backward
fr: Reculer de deux cases

source: Two letters before the end of the alphabet
fr: A deux lettres de la fin de l'alphabet

source: Move three steps backward
fr: Reculer de trois cases

source: Three letters before the end of the alphabet
fr: A trois lettres de la fin de l'alphabet

source: In any other case, you should stop
fr: Dans tous les autres cas, il faut s'arrêter.

source: Write the code of the dance in the <code>run()</code> method which prototype is already in the editor.
fr: Écrivez le code de la danse dans la méthode <code>run()</code> dont le prototype se trouve déjà dans l'éditeur.

source: Write the code of the dance directly in the editor, out of any function.
fr: Ecrivez directement le code de la danse dans l'éditeur, en dehors de toute fonction.

source: This exercise may seem a bit complex at the first glance, but it comes down to summarizing the information above in a sequence of conditionals.
fr: Cet exercice peut sembler un peu compliqué, mais il s'agit principalement de traduire le contenu du tableau ci-dessus dans un enchaînement de conditionnelles.

source: The first subtlety is that we use the <code>char getIndication()</code> instead of <code>String readMessage()</code>. This method, only known by the buggles of this exercise, return the first char of the message written on the ground (or ' ' if nothing is written down).
fr: La première subtilité est que nous utiliserons la méthode <code>char getIndication()</code> à la place de <code>String readMessage()</code>. Cette méthode, qui n'est connue que des buggles des exercice BDR, renvoie le premier caractère du message au sol (ou ' ' s'il n'y a rien d'écrit au sol).

source: The other subtlety is to keep working as long as there is some work to do, i.e., as long as we did not find a cell which content is not described in the table. The easier for that is to use a boolean variable (<code>finished</code>) that is initialized to <code>false</code> as termination condition for the loop. As soon as the buggle find a cell with a value not described in the table, the boolean variable is set to <code>false</code>. Thus the loop, will stop and the program will terminate.
fr: L'autre subtilité est de travailler tant qu'on du travail à faire, i.e. tant qu'on a pas trouvé une case n'étant pas décrite dans le tableau. Le plus simple pour cela est d'utiliser une variable booléenne (<code>fini</code>) en condition d'arrêt d'une boucle. Cette variable est initialisée à la valeur faux (<code>false</code>). Si on trouve une case ne répondant à aucune ligne du tableau, on change la valeur de cette variable à vrai (<code>true</code>. Cela arrête la boucle, et le programme s'arrête.

source: The other subtlety is to keep working as long as there is some work to do, i.e., as long as we did not find a cell which content is not described in the table. The easier for that is to use a boolean variable (<code>finished</code>) that is initialized to <code>False</code> as termination condition for the loop. As soon as the buggle find a cell with a value not described in the table, the boolean variable is set to <code>False</code>. Thus the loop, will stop and the program will terminate.
fr: L'autre subtilité est de travailler tant qu'on du travail à faire, i.e. tant qu'on a pas trouvé une case n'étant pas décrite dans le tableau. Le plus simple pour cela est d'utiliser une variable booléenne (<code>fini</code>) en condition d'arrêt d'une boucle. Cette variable est initialisée à la valeur faux (<code>False</code>). Si on trouve une case ne répondant à aucune ligne du tableau, on change la valeur de cette variable à vrai (<code>True</code>. Cela arrête la boucle, et le programme s'arrête.

source: The functions having <code>void</code> as return type can contain some <tt>return</tt> without any associated value. It interrupts immediately their execution.
fr: Les fonctions dont le type de retour est <tt>void</tt> peuvent contenir des <tt>return</tt> sans valeur associée. Cela interrompt immédiatement leur exécution.

source: Tips and Hints
fr: Trucs et astuces

source: If you fail understanding why the buggle does not execute the expected steps, try adding <code>brushDown()</code> in your method. This asks the buggle to put down a brush leaving a trail when it moves. It should help you understanding its trajectory, but do not forget to remove this call when you want to test whether your code is a valid solution to the exercise: you are asked to let the buggle dance, not to vandalize the dance floor.
fr: Si vous ne parvenez plus à comprendre pourquoi votre buggle n'exécute pas les pas de danse demandés, essayez d'ajouter <code>brushDown()</code> dans votre méthode. Cela demandera à la buggle de poser un crayon par terre, laissant une trace au sol quand elle avance. Cela devrait vous aider à suivre sa trajectoire, mais pensez à retirer cette appel lorsque vous voulez tester si votre solution marche : on vous demande de faire danser les buggles, pas de dégrader le dance floor.

source: When your program finally works, move on to the next exercise.
fr: Quand votre programme fonctionne enfin, passez à l'exercice suivant.

source: BDR is cool, but it's a bit chaotic. First, the buggles giggle in any directions, and then the code you had to write to let them move is rather difficult to read. Here is a new BDR world where the buggle will dance a gentle circle. We will benefit this tranquillity to clean up a bit our code thanks to the new constructs we will introduce.
fr: Le BDR, c'est cool, mais c'est un peu le chaos. Tout d'abord, les buggles gigotent en tout sens, et en plus, le code que vous avez écrit pour les faire bouger est très difficile à lire. Voici un nouveau monde de BDR, où les buggles vont faire une gentille petite ronde plus reposante. Nous profiterons de cette accalmie pour nettoyer un peu le code grâce aux nouveaux éléments que nous allons maintenant étudier.

source: <tt>switch</tt> conditionals
fr: Branchement conditionnel <tt>switch</tt>

source: The hardest part of previous code is certainly the conditional cascading. Somewhere in your code, you certainly had something similar to:
fr: Le plus difficile à lire du code précédent est certainement la cascade de conditionnelles. Quelque part dans votre programme, vous avez sans doute écrit quelque chose comme:

source: if (getIndication() == 'R') { turnRight(); forward(); } else if (getIndication() == 'L') { turnLeft(); forward(); } else if (getIndication() == 'I') { turnBack(); forward(); /* other else if */ } else { return; }
fr: if (getIndication() == 'R') { turnRight(); forward(); } else if (getIndication() == 'L') { turnLeft(); forward(); } else if (getIndication() == 'I') { turnBack(); forward(); /* d'autres else if */ } else { return; }

source: When you review this code, it may not be clear at the first glance that it is simply a choice with 4 branches depending on the value of getIndication(). To improve this, we will use a <code>switch</code> construct, which Java syntax is the following:
fr: Quand on relit ce programme, on ne voit pas forcément tout de suite qu'il s'agit simplement d'un choix à 4 branches selon la valeur de getIndication(). Pour faire mieux, on va utiliser la construction <tt>switch</tt>, dont la syntaxe est la suivante:

source: switch (<b>expression</b>) { case <b>firstValue</b>: <b>whatToDoIfExpressionEqualsFirstValue();</b> break; case <b>secondValue</b>: <b>whatToDoIfExpressionEqualsSecondValue();</b> break; case <b>thirdValue</b>: <b>whatToDoIfExpressionEqualsThirdValue();</b> break; /* as much similar cases as you want */ default: <b>whatToDoIfExpressionDoesNotEqualsAnySeenValues();</b> }
fr: switch (<b>expression</b>) { case <b>premierValeur</b>: <b>queFaireSiExpressionVautPremiereValeur();</b> break; case <b>deuxiemeValeur</b>: <b>queFaireSiExpressionVautDeuxiemeValeur();</b> break; case <b>troisiemeValeur</b>: <b>queFaireSiExpressionVautTroisiemeValeur();</b> break; /* autant de cas sur le même modèle qu'on le souhaite */ default: <b>queFaireSiExpressionVautAucuneDesValeursProposees();</b> }

source: Observe that each branch of a <tt>switch</tt> must be ended by a <code>break</code>. If you forget this, the machine keeps going and execute the next branch in the list after the branch it jumped to. There is even some <b>rare</b> cases where this behavior reveals helpful.
fr: Remarquez que chaque branche du <tt>switch</tt> doit être terminée par un <code>break</code>. Si on l'oublie, la machine continue d'exécuter le cas suivant dans la liste quand elle a fini le code du cas où elle a sauté dans le switch. Il y a même quelques <b>très rares</b> cas où ce comportement est pratique.

source: It is then possible to rewrite previous BDR code in a cleaner way using the <tt>switch</tt> construct:
fr: On peut réécrire le code BDR précédent bien plus clairement grâce à la construction <tt>switch</tt> de la façon suivante.

source: Variables shared between methods
fr: Variables partagées par les méthodes

source: Another issue in your code is that it begins to be a bit long to be written as a single method. We would like to split it up in two methods:
fr: Un autre problème de votre code est qu'il commence à être un peu long pour être dans une seule fonction. On voudrait découper en deux méthodes:

source: <code>danceOneStep()</code> would take care of achieving a single dance step
fr: <code>danceOneStep()</code> s'occuperait de faire un pas de danse

source: <code>run()</code> would take care of the dance as a whole. It would do the steps while we didn't encounter a cell not asking any further move.
fr: <code>run()</code> s'occuperait de faire la danse en entier, c'est à dire de faire des pas de danse tant que l'on n'est pas arrivé à une case ne demandant pas d'aller plus loin.
