Repository: BuggleInc/PLM
Catalog: lib/l10n/*.po
Languages: fr

source: <i>Declaring</i> (ie, creating) a variable in Python is dead simple: you just need to give it an initial value by writing its name, the equal sign and the value.
fr: <i>Déclarer</i> (ie créer) une variable en Python est extrèmement simple: vous avez juste besoin de lui donner une valeur initiale en écrivant son nom, le signe égal et la valeur.

source: So, to create a variable named <b>x</b> which initial value should be 5, you should type:
fr: Ainsi, pour créer une variable nommée <b>x</b> dont la valeur initiale sera 5, on écrira :

source: firstName = "Martin" lastName = 'Quinson' <span class="comment"># both single and double quote work here</span> motto = "I never finish anyth' (but I keep trying)" <span class="comment"># having single quote within double quote is fine</span> height=1.77 <span class="comment"># in meters</span> married=True <span class="comment"># the contrary would be written False</span>
fr: prenom = "Martin" nom = 'Quinson' <span class="comment"># les simples et les doubles quotes fonctionnent ici</span> devise = "Je ne finis jam' (mais je continue d'essayer)" <span class="comment"># avoir des quotes simples dans des doubles quotes fonctionne</span> taille=1.77 <span class="comment"># en mètre</span> marie=True <span class="comment"># le contraire serait marqué False</span>

source: To the right of the equal symbol, you can put an expression containing constants, variables and operations:
fr: À droite du signe égal, on peut mettre une expression quelconque, qui peut contenir des constantes, des variables et des opérations :

source: x = 3 + 2; x = 3 * x; greeting = "Hello "+name;
fr: x = 3 + 2; x = 3 * x; hello = "Salut "+nom;

source: x = 3 + 2 x = 3 * x greeting = "Hello "+name
fr: x = 3 + 2 x = 3 * x hello = "Salut "+nom

source: It is now time to do more challenging exercises, don't you think? The objective is now to move forward until you find a baggle, pick it up, and then move back to your initial location before dropping the baggle.
fr: Il est temps de faire un exercice un peu plus dur, n'est ce pas ? L'objectif cette fois est d'avancer jusqu'au baggle qui se trouve devant la buggle, le ramasser, revenir à la position initiale, puis de poser le baggle.

source: How to do this?
fr: Comment faire ?

source: To solve this problem, you have to decompose it in easier sub-parts. For example, you may want to do the following steps:
fr: Pour résoudre ce problème, il faut le décomposer en parties que vous savez résoudre. Par exemple, on peut vouloir faire les étapes suivantes :

source: Move forward until located over a baggle
fr: Avancer jusqu'à se trouver sur un baggle

source: Pickup the baggle
fr: Ramasser le baggel au sol

source: Move backward of the same amount of steps than done in first step
fr: Reculer du même nombre de cases que ce qu'on a avancé

source: Drop back the baggle
fr: Reposer le baggel au sol

source: Naturally, it is impossible to do the right amount of steps backward at step 3 if you didn't count the amount of steps done in the first phase. You can use a variable for that, which can be named <code>stepAmount</code>.
fr: Bien entendu, il est impossible de reculer du bon nombre de case à l'étape 3 si l'on a pas compté le nombre de pas faits à la première étape. On va pour cela utiliser une variable, que l'on peut nommer <code>nbPas</code>.

source: Create a variable (of type <code>int</code>) before phase 1, initialize it to 0, and each time you move one step forward, increment its value by one (<code>stepAmount = stepAmount + 1;</code> or <code>stepAmount++;</code>, both syntaxes being equivalent).
fr: On crée cette variable (de type <code>int</code>) avant l'étape 1, on l'initialise à 0, et chaque fois qu'on avance d'un pas, on l'incrémente de 1 (<code>nbPas = nbPas + 1;</code> ou <code>nbPas++;</code>, les deux écritures sont équivalentes).

source: Create a variable before phase 1, initialize it to 0, and each time you move one step forward, increment its value by one (<code>stepAmount = stepAmount + 1</code>).
fr: On crée cette variable (de type <code>int</code>) avant l'étape 1, on l'initialise à 0, et chaque fois qu'on avance d'un pas, on l'incrémente de 1 (<code>nbPas = nbPas + 1;</code> ou <code>nbPas++;</code>, les deux écritures sont équivalentes).

source: Then, phase 3 consists in simply creating a new integer variable <code>doneSteps</code> initialized to 0, and do one step backward until <code>doneSteps</code> equals <code>stepAmount</code>, incrementing <code>doneSteps</code> each time.
fr: Ensuite, l'étape 3 consiste simplement à créer une nouvelle variable entière <code>dejaFait</code> initialisée à zéro, et reculer d'un pas tant que <code>dejaFait</code> n'est pas égal à <code>nbPas</code>, en incrémentant <code>dejaFait</code> à chaque fois.

source: Please note that it is forbidden to use spaces in variable names. So you can name you variable <code>stepAmount</code>, but <code>step Amount</code> is not a valid name.
fr: Attention, il est interdit d'utiliser des caractères accentués ou des espaces dans les noms de variables Java. Vous pouvez donc nommer votre variable <code>dejaFait</code>, mais ni <code>déjaFait</code> ni <code>deja Fait</code> ne sont des noms valides.

source: It's your turn now!
fr: À vous de jouer !

source: While loops are well adapted to situations where you want to achieve an action while a condition stays true, but it is less adapted to achieve a given action a predetermined amount of time. For example, when we wanted to move <code>stepAmount</code> steps backward in previous exercise, you had to create a new variable, initialize it, and move backward until the new variable became equal to <code>stepAmount</code>, incrementing the new variable manually at the end of the loop.
fr: Les boucles <tt>while</tt> sont bien adaptées aux situations où l'on veut réaliser une action tant qu'une condition est réalisée, mais elles sont moins pratiques pour réaliser une action un nombre prédéterminé de fois. Par exemple, lorsque nous voulions reculer de <code>nbPas</code> dans l'exercice précédent, il fallait créer une nouvelle variable, l'initialiser, et demander à reculer tant que la nouvelle variable n'était pas égale à <code>nbPas</code>, en incrémentant cette variable à la main à la fin du corps de la boucle.

source: In such situations, <code>for</code> loops become handy. Their syntax is the following:
fr: Dans ce genre de cas, les boucles de type <code>for</code> sont plus pratique. Leur syntaxe est la suivante :

source: for (<b>initializing</b>; <b>condition</b>; <b>incrementing</b>) { &nbsp;&nbsp;&nbsp;<b>action</b>(); }
fr: for (<b>initialisation</b>; <b>condition</b>; <b>incrémentation</b>) { &nbsp;&nbsp;&nbsp;<b>action</b>(); }

source: for <b>variable</b> in <b>sequence of values</b>: &nbsp;&nbsp;&nbsp;<b>action</b>()
fr: for <b>variable</b> in <b>séquence de valeurs</b>: &nbsp;&nbsp;&nbsp;<b>action</b>()

source: This code is perfectly equivalent to the following:
fr: Ce code est parfaitement équivalent à celui-ci :

source: <b>initializing</b>; while (<b>condition</b>) { &nbsp;&nbsp;&nbsp;<b>action</b>(); &nbsp;&nbsp;&nbsp;<b>incrementing</b>; }
fr: <b>initialisation</b>; while (<b>condition</b>) { &nbsp;&nbsp;&nbsp;<b>action</b>(); &nbsp;&nbsp;&nbsp;<b>incrémentation</b>; }

source: while <b>there is a value in the sequence</b>: &nbsp;&nbsp;&nbsp;<b>set variable to the next unseen value of the sequence</b> &nbsp;&nbsp;&nbsp;<b>action</b>()
fr: while <b> il y a une valeur dans la séquence </b>: &nbsp;&nbsp;&nbsp;<b>mettre la variable à la prochaine valeur non traitée de la séquence</b> &nbsp;&nbsp;&nbsp;<b>action</b>()

source: Please note that in Python the instruction <code>range(n)</code> allows to get a sequence n integer value from 0 to n-1.
fr: Veuillez noter qu'en Python, l'instruction <code>range(n)</code> permet d'obtenir une séquence de n entiers allant de 0 à n-1.

source: For example, both following codes are equivalent. The latter is easier to read, don't you think?
fr: Par exemple, les deux codes suivants sont équivalents. Avouez que la seconde forme est plus lisible, non ?

source: int done = 0; while (done &lt; stepAmount) { &nbsp;&nbsp;&nbsp;backward(); &nbsp;&nbsp;&nbsp;done++; }
fr: int dejaFait = 0; while (dejaFait &lt; nbPas) { &nbsp;&nbsp;&nbsp;backward(); &nbsp;&nbsp;&nbsp;dejaFait++; }

source: for (int done = 0; done &lt; stepAmount; done++) { &nbsp;&nbsp;&nbsp;backward(); }
fr: for (int dejaFait = 0; dejaFait &lt; nbPas; dejaFait++) { &nbsp;&nbsp;&nbsp;backward(); }

source: done = 0 while done &lt; stepAmount: &nbsp;&nbsp;&nbsp;backward() &nbsp;&nbsp;&nbsp;done = done + 1
fr: dejaFait = 0 while dejaFait &lt; nbPas: &nbsp;&nbsp;&nbsp;backward() &nbsp;&nbsp;&nbsp;dejaFait = dejaFait + 1

source: for done in range(stepAmount): &nbsp;&nbsp;&nbsp;backward()
fr: for done in range(nbPas): &nbsp;&nbsp;&nbsp;backward()

source: It is possible to build more advanced <tt>for</tt> loops since any valid instruction can be used as initialization, condition and incrementation. The following example is a bit extreme since it compute the gcd (greatest common divisor) of two numbers without loop body and initialization (everything is in the condition and incrementation).
fr: On peut imaginer des utilisations bien plus avancées des boucles <tt>for</tt> car toute instruction valide peut être utilisée comme initialisation, condition et incrémentation. L'exemple suivant est un peu extrême, puisqu'elle calcule le PGCD de deux nombres sans avoir ni de corps de boucle, ni d'initialisation (tout est fait dans la condition et l'incrémentation).

source: int x=20, y=3, tmp; for (; y!=0 ; tmp=x, x=y, y=tmp%y) { } <span class="comment">/* the gcd is stored in x */</span>
fr: int x=20, y=3, tmp; for (; y!=0 ; tmp=x, x=y, y=tmp%y) { } <span class="comment">/* le PGCD est stocké dans x */</span>

source: If you don't understand every details of this example, don't panic. That's quite logic since it uses some syntax details that we did not introduce yet.
fr: Si vous ne comprenez pas tous les détails de cet exemple, pas de panique, c'est assez logique puisqu'il utilise des points de syntaxe que nous n'avons pas encore vu.

source: <a name="Objectives"> You now have to redo the same exercise than previously (move forward until being over a baggle, pick it up, move back to your original location, drop the baggle), but using a <tt>for</tt> loop instead of a <tt>while</tt> loop to move back to the initial location.
fr: <a name="Objectifs"> Il s'agit de refaire le même exercice que précédemment (avancer jusqu'à trouver un baggle, le ramasser, revenir là où on était au début puis reposer le baggle), mais en utilisant une boucle <tt>for</tt> pour revenir au point de départ à la place d'une boucle <tt>while</tt>.

source: Once done, proceed to next exercise.
fr: Une fois ceci fait, passez à l'exercice suivant.

source: In addition to conditionals, another handy construction is the ability to repeat an action while a specific condition does not appear. A while loop is used for that, with the following syntax:
fr: En plus des instructions conditionnelles, une autre construction pratique est de pouvoir demander à la buggle de répéter une action tant qu'une condition particulière n'est pas arrivée. On utilise pour cela une boucle <tt>while</tt>, dont la syntaxe est la suivante :

source: Naturally, if the chosen action does not modify the value of the condition, the buggle will do the action endlessly. The <b>stop</b> button of the interface becomes then handy. To test this, you can try to type the following code in the editor:
fr: Evidement, si l'action en question ne modifie pas la valeur de la condition, la buggle va exécuter l'action à l'infini. C'est dans ce genre de cas que le bouton <b>stop</b> de l'interface devient utile. Pour tester cela, vous pouvez essayer de taper le code suivant dans l'éditeur :

source: The buggle will turn left while true is true (ie, endlessly), or until you stop it manually using the stop button.
fr: La buggle va tourner vers la gauche tant que <code>true</code> est vrai (sans fin donc) jusqu'à ce que vous l'arrêtiez manuellement avec le bouton stop.

source: <a name="Objective">You now have to write some code so that your buggles move forward until they encounter a wall. The idea is thus to do something like:
fr: <a name="Objectifs"> Il vous faut maintenant écrire le code nécessaire pour que vos buggles avancent jusqu'à rencontrer un mur. L'idée est donc de faire :

source: while we are not facing a wall, do: &nbsp;&nbsp;moveForward()
fr: tant que l'on est pas face à un mur, faire : &nbsp;&nbsp;avancer();

source: Here is another little exercise about loops. It is slightly more complex as we want the action to be executed in any case, even if the condition is false right away. Some languages have specific constructs for that, but not the Python language. No problem, I'm sure you can do it without them, can't you?
fr: Il y a ici un autre petit exercice sur les boucles. Il est légèrement plus complexe comme nous voulons que l'action soit exécutée dans tous les cas, même si la condition est directement fausse. Certains langages ont des constructions spécifiques pour cela, mais pas le langage Python. Mais il n'y a pas de problème, je suis sûr que vous pouvez faire sans, n'est-ce pas ?

source: In a <tt>while</tt> loop, the condition is evaluated before anything else, and if it's false, the loop body is never evaluated. Sometimes (although not that often), you would prefer the loop body to get evaluated at least once, even if the condition is initially false. For that, a variation of the <tt>while</tt> loop gets used, using the following syntax in Java:
fr: Dans une boucle <tt>while</tt>, la condition est évaluée avant toute chose, et si elle est fausse, le corps de la boucle n'est jamais exécuté. Il arrive parfois que l'on veuille que le corps de la boucle soit évalué au moins une fois, même si la condition est initialement fausse. On utilise pour cela une variante de la boucle <tt>while</tt>, dont la syntaxe Java est la suivante :

source: <a name="Objectives"> Some cells of the world are yellow, but your buggle cannot stand being in such cells as it is right now. Write the code needed to move forward until the ground gets white. You can use for that the isGroundWhite() method, that only the buggle of this exercise knows. The trick is that even if the ground is white on the first cell, you still want to move forward to the next cell.
fr: <a name="Objectifs"> Certaines cases du monde sont jaunes, mais votre buggle ne supporte pas de s'y trouver comme c'est son cas actuellement. Écrivez le code lui permettant d'avancer jusqu'à se trouver sur une case blanche. Vous utiliserez pour cela la méthode isGroundWhite(), que seule la buggle de cet exercice connaît. Le truc est que même si le sol de la première case est blanc, il faut quand même faire avancer la buggle d'un pas.

source: The general idea is to do something like:
fr: L'idée général est donc de faire:

source: move forward until located in a white cell
fr: avancer jusqu'à se trouver sur une case blanche

source: <i>Remark:</i> it is also possible to solve this exercise with a classical <tt>while</tt> loop, but it's not the goal.
fr: <i>Remarque :</i> il est également possible de résoudre cet exercice avec une boucle <tt>while</tt> classique, mais ce n'est pas l'objectif.

source: We will now write our own methods. It somehow comes down to extending the buggle vocabulary by learning it new tricks.
fr: Nous allons maintenant voir comment écrire nos propres méthodes. Il s'agit en quelque sorte d'étendre le vocabulaire de la buggle en lui apprenant à faire de nouvelles choses.

source: For example, we saw in previous exercise how to ask the buggle to go get the baggle in front of it, and bring it back. If there is several baggles on the board, and if we want to bring all of them on the bottom line, you have to repeate this code several times, or include it in a loop. In any case, the result may reveal unpleasant to read, and it would be better if the buggle could obey an <code>goAndGet()</code> order just like it understands a <code>forward()</code> one.
fr: Par exemple, nous avons vu à l'exercice précédent comment demander à la buggle d'aller chercher la buggle qui se trouve devant elle, et la ramener à sa position initiale. S'il y a maintenant plusieurs baggles sur le plateau, et que nous voulons tous les ramener sur la ligne du bas, il faut soit répéter ce code plusieurs fois, soit l'inclure dans une boucle. Dans les deux cas, le code résultant n'est pas très lisible, et il serait mieux que la buggle comprenne un ordre de type <code>goAndGet()</code> tout comme elle comprend un <code>forward()</code>.

source: The syntax to write a simple method called <code>goAndGet</code> is the following:
fr: La syntaxe pour écrire une méthode simple nommée <code>goAndGet</code> est la suivante:

source: def goAndGet(): actions(); to(); do();
fr: public void goAndGet() { actions(); aFaire(); }

source: public void goAndGet() { actions(); to(); do(); }
fr: public void goAndGet() { actions(); aFaire(); }

source: The method body (between curly braces) can contain as many instructions as you want, and any construction we saw so far (for, while, if, etc).
fr: Le corps de la méthode (entre les accolades) peut contenir autant d'instructions que vous le souhaitez, et toutes les constructions vues jusque là (for, while, if, etc).

source: The method body (the code that is indended) can contain as many instructions as you want, and any construction we saw so far (for, while, if, etc).
fr: Le corps de la méthode (entre les accolades) peut contenir autant d'instructions que vous le souhaitez, et toutes les constructions vues jusque là (for, while, if, etc).

source: We will come back later on the exact signification of the <code>public</code> keyword. Let's say for now that it means that everybody can use this method.
fr: Nous reviendrons plus tard sur le sens exact du mot-clé <code>public</code>. Disons simplement pour l'instant qu'il indique que tout le monde a le droit d'utiliser cette méthode.

source: <code>void</code> means that the method does not return any result. We said previously that the <code>isOverBaggle()</code> method returns a boolean and can thus be used as a condition in a if or a while. This means that it is declared the following way:
fr: <code>void</code> indique quant à lui que la méthode ne donne pas de résultat. Nous avions vu que la méthode <code>isOverBaggle()</code> renvoie un booléen, et peut donc être utilisé comme une condition dans un if ou un while. Cela signifie qu'elle a été déclarée de la façon suivante :

source: We will introduce in next exercise how to do this kind of tricks. For now, let's just write <code>void</code> at this location.
fr: Nous verrons dans le prochain exercice comment faire ce genre de chose. Pour l'instant, contentons nous d'écrire ce <code>void</code> à cet endroit.

source: In Java, the convention is to use lower case for the first letter of a method name and concatenate every word describing the method using a upper case for each first letter. It is forbidden to use spaces or accentuated letters in a method name. That is why we write "go and get" as goAndGet().
fr: En Java, il est d'usage de mettre la première lettre du nom d'une méthode en minuscules, et de coller tous les mots décrivant la méthode les uns aux autres en mettant une majuscule à chacun. Il est interdit de mettre des espaces ou des accentués dans le nom d'une méthode. C'est pourquoi nous écrivons "go and get" sous la forme "goAndGet".

source: <a name="Objectives"> The goal of this exercise is to write a method called <code>goAndGet()</code> which does the same than in previous exercises (move forward until over a baggle, pick it up, move back to initial position, drop baggle).
fr: <a name="Objectifs"> L'objectif de cet exercice est donc d'écrire une méthode nommée <code>goAndGet()</code> et qui fait la même chose qu'aux exercices précédents (avance tant qu'on ne trouve pas de baggle, ramasser le baggle, reculer à la case départ, poser le baggle).

source: One particularity of this exercise is that all your code should be written in this function, with nothing out of it. The code that calls your function will be automagically added when you click on <b>Start</b>.
fr: La particularité de cet exercice est que tout votre code doit être écrit dans cette fonction, avec rien en dehors. Le code qui appelle votre fonction sera automagiquement ajouté quand vous cliquerez sur <b>Start</b>.

source: One particularity of this exercise is that you shouldn't write directly the code that the buggle should execute, but a method it should use. Actually, in any previous exercise, you wrote the body of a specific method called <code>run()</code> which gets invoked by the environment when you click on <b>Start</b>.
fr: La particularité de cet exercice est que vous n'allez donc pas écrire directement le code que la buggle va exécuter, mais une méthode qu'elle utilisera. En fait, dans tous les exercices précédents, vous avez écrit le corps d'une méthode particulière de la buggle nommée <code>run()</code> et qui est invoquée par l'environnement quand on clique sur le bouton <b>Start</b>.

source: Don't try to define this method here, since the buggle already knows it. This would cause trouble to the compiler, which would give you an error message in exchange. For your information, here is the <code>run()</code> method of this exercise:
fr: N'essayez pas de définir ici cette méthode, puisque la buggle la connaît déjà. Cela troublerait le compilateur qui vous donnerait un message d'erreur en échange. Pour information, voici le corps de la méthode <code>run()</code> de la buggle de cet exercice:

source: Your buggle will repeat 7 times (which matches the world's dimension) sequence constituted of a call to the <code>goAndGet()</code> method that you should write, plus a move to get to the next row (turn right, move forward, turn left). As you can see, the buggle will do one step right from the right border of the world. It will bring it back to the left side since its world is a torus.
fr: Donc, votre buggle va répéter 7 fois (la taille du monde) l'opération <code>goAndGet()</code> que vous allez écrire, plus les opérations nécessaire à se décaler d'une colonne vers la droite (tourner à droite, avancer, tourner à gauche). Notez que la buggle va donc faire un pas vers la droite alors qu'elle sera tout à droite du monde. Cela la ramènera sur le bord gauche, car le monde des buggles est torique.

source: You should now write this goAndGet() method.
fr: À vous d'écrire cette méthode goAndGet().

source: We now would like to learn the buggle to build a doghouse. The seamingly simpler approach consists in directly writing the needed code as follows (it works because the buggle of this exercise leaves a red path as it moves).
fr: Nous souhaitons maintenant apprendre à la buggle à se faire une niche. La première approche, la plus simple au premier abord, est d'écrire directement le code permettant de le faire, comme ci-dessous (cela marche car la buggle de cet exercice laisse une traînée rouge dans son sillage quand elle se déplace).
