Repository: BuggleInc/PLM
Catalog: lib/l10n/*.po
Languages: fr

source: This first sorting algorithm is the most simple one: Bubble sort consists in progressively moving up the smaller elements of the array, as if they were air bubbles moving up to the surface of a liquid. The algorithm traverse the array, and compare any pair of adjacent elements. If two adjacent elements are wrongly sorted, they are swapped. Once the array was completely traversed, the operation starts again from the beginning. When no elements were sorted after a full traversal, it means that the array is completely sorted: the algorithm can stop. Bubble sort is studied because of its simplicity, but it is almost never used in practice because of its bad performance (O(n^2) on average).
fr: Le premier algorithme de tri est le plus simple existant : le tri à bulles ou tri par propagation consiste à faire remonter progressivement les plus petits éléments d'une liste, comme les bulles d'air remontent à la surface d'un liquide. L'algorithme parcourt la liste, et compare les couples d'éléments successifs. Lorsque deux éléments successifs ne sont pas dans l'ordre croissant, ils sont échangés. Après chaque parcours complet de la liste, l'algorithme recommence l'opération. Lorsqu'aucun échange n'a lieu pendant un parcours, cela signifie que la liste est triée : l'algorithme peut s'arrêter. La simplicité de cet algorithme justifie son étude, mais ses piètres performances (O(n2) en moyenne) font qu'il n'est quasiment jamais utilisé en pratique.

source: Show Tip (Pseudo-code)
fr: Montrer l'indice (le pseudo-code)

source: The pseudo-code of the BubbleSort algorithm is the following:
fr: Le pseudo-code de l'algorithme du tri à bulles est donc le suivant :

source: do: For each i in [0,len-2] If cells i and i+1 must be swapped, do it while we swapped something during last traversal
fr: faire: Pour tout i dans [0,lgr-2] Si les cases i et i+1 doivent être inverser, le faire tant qu'on a inverser des choses lors du dernier parcours

source: If you look carefully at the behavior of BubbleSort, a first easy optimization appears: after one traversal, the last element of the array must be the biggest of all since the traversal moved it up like a bubble to its position. More generally, after N traversal, we know that the N last elements of the array are already sorted. It is thus not necessary to compare them again during the subsequent traversals. For now, we will have as many traversal as there is in the array.
fr: En étudiant le comportement du tri à bulle, on peut voir une première optimisation facile à effectuer: Après un parcours, le dernier élément du tableau est forcément le plus grand d'entre tous car le parcours l'a fait remonté comme une bulle à sa position. Plus généralement, après N parcours, on sait que les N derniers éléments du tableau sont déjà triés. En conclusion, il n'est pas utile de les recomparer sur les parcours suivants. Dans un premier temps, nous ferons autant de parcours qu'il y a d'éléments dans le tableau.

source: The pseudo-code of the BubbleSort2 algorithm is the following:
fr: Le pseudo-code de l'algorithme BubbleSort2 est le suivant :

source: For all i in [len-2,0] (traversing from biggest to smallest) For all j in [0, i] If cells j and j+1 must be swapped, do it
fr: Pour tout i dans [lgr-2,0] (parcours du plus grand au plus petit) Pour tout j dans [0, i] Si les cases j et j+1 doivent être inverser, le faire

source: When we run this algorithm, it is quite disappointing to see that it runs approximately at the same speed than the basic version of BubbleSort. This is a graphical effect only since only value changes are graphically represented. Since this variation avoids some useless comparisons, it does exactly the same amount of swaps that the basic version. It is thus quite logical that the graphical interface draws this version at the same pace than the base version. But the statistics on the amount of reads show that we saved about the fourth of the amount of reads, which is not bad.
fr: Lorsqu'on exécute cet algorithme, il peut être un peu décevant de constater qu'il s'exécute à la même vitesse que la version de base de BubbleSort. C'est un effet graphique seulement puisque seules les changements de valeurs dans le tableau sont représentées. Comme cette variante consiste à éviter des comparaisons inutiles, elle effectue très exactement le même nombre d'échanges que la version de base. Il est donc normal que notre interface graphique la représente à la même vitesse que la version de base. Mais les statistiques sur le nombre de lectures montrent bien que l'on a économisé plus d'un quart du nombre de lectures, ce qui n'est pas si mal.

source: From the asymptotic complexity point of view, there is absolutely no difference: this variation is still in O(n^2) on average (our gain is only on the constant term, ignored when computing the asymptotic complexity).
fr: D'un point de vue complexité algorithmique, cela ne change rien: cette variante est toujours en O(n2) en moyenne (on ne gagne que sur la constante).

source: Let's now reintroduce the little optimization we removed at previous step: if a traversal does not swap any element, it means that the array is already sorted. In that case, we want to stop the whole sorting process.
fr: Réintroduisons maintenant la petite optimisation que nous avions retiré à l'étape précédente : Si un parcours n'a rien inversé, c'est que le tableau est maintenant trié. Dans ce cas, il faut arrêter le processus de tri.

source: For that, simply use the <code>break</code> keyword, which breaks the current loop. Beware, if you have several embedded loops, this will apply to the internal one.
fr: Pour cela, utilisez simplement le mot-clé <code>break></code>, qui coupe l'exécutino de la boucle englobante. Attention, si vous avez plusieurs boucles imbriquées, c'est celle situé tout au fond (au plus près du mot-clé break) qui est cassée.

source: If you want, this tip shows the pseudo-code.
fr: Si vous le désirez, cet indice montre le pseudo-code.

source: For all i in [len-2,0] (traversing from biggest to smallest) For all j in [0, i] If cells j and j+1 must be swapped, do it If traversal on j did not swap anything, break the for loop
fr: Pour tout i dans [lgr-2,0] (parcours du plus grand au plus petit) Pour tout j dans [0, i] Si les cases j et j+1 doivent être inverser, le faire Si le parcours sur les j n'a rien inversé, casser la boucle

source: This optimization is even more disappointing: it only provide a gain of a few percents on the amount of reads over BubbleSort2.
fr: Cet optimisation est encore plus décevante : on ne gagne que quelques pourcents en nombre de lectures sur BubbleSort2.

source: CocktailSort and variations
fr: Le tri à bulle et variantes

source: To improve further the BubbleSort algorithm, we need to look closer its behavior. One can notice that big elements are moved very quickly in position while small ones move very slowly to their destination. They are thus traditionally referred to as "rabbits" and "turtles" respectively for big fast values and small slow ones.
fr: Pour améliorer encore notre algorithme, il faut regarder un peu plus en détail son comportement. On peut constater que les grands éléments sont très rapidement mis en place tandis que les petits éléments se déplacent très lentement vers leur destination. On parle classiquement de lièvres et de tortues pour désigner respectivement les grandes valeurs et les petites valeurs.

source: To help the turtles moving faster, the cocktail sort traverse alternatively the array from right to left and from left to right. Here is the pseudo-code:
fr: Pour permettre aux tortues d'aller plus vite, le tri cocktail parcours alternativement le tableau de gauche à droite et de droite à gauche. Voici son pseudo-code:

source: Do For all i in [0,len-2], do: if i and i+1 must be swapped, do it For all i in [len-2,0] (downward), do: if i and i+1 must be swapped, do it while at least one of the traversal swapped an element
fr: Faire Pour tout i dans [0,lgr-2], faire: si i et i+1 doivent être échangées, le faire Pour tout i dans [lgr-2,0] en descendant, faire: si i et i+1 doivent être échangées, le faire tant qu'au moins l'un des parcours a inversé un élément

source: One can see that cocktail sort achieves exactly the same amount of swaps than the bubble sort, but improves slightly on read amount. It is however still worse than BubbleSort2 to that extend.
fr: On constate que le tri cocktail fait très exactement le même nombre d'échanges que le tri à bulle, mais qu'il améliore les choses sur le nombre de lectures. Il reste cependant moins bon que BubbleSort2 en la matière.

source: We will now apply to CocktailSort the same optimization than BubbleSort2 did to BubbleSort. We must remember the limits of the array part not being sorted yet, and traverse it alternatively from left to right and from right to left:
fr: Nous allons appliquer la même optimisation que BubbleSort2 à CocktailSort. Il nous faut nous souvenir des bornes du tableau pas encore trié, et le parcourir alternativement de droite à gauche et de gauche à droite:

source: beg=0; end=len-2 do For all Pour i in [beg,end], do: If cells i and i+1 must be swapped, do it end-- For all Pour i in [beg,end] (downwards), do: If cells i and i+1 must be swapped, do it beg++ while at least one of the traversal swapped an element
fr: debut=0; fin=lgr-2 Faire Pour tout i dans [debut,fin], faire: si i et i+1 doivent être échangées, le faire fin-- Pour tout i dans [fin, debut] en descendant, faire: si i et i+1 doivent être échangées, le faire debut++ tant qu'au moins l'un des parcours a inversé un élément

source: Even if the asymptotic complexity of CocktailSort2 is the same than the one of BubbleSort, it seem to perform better in practice. It is even possible to improve a bit further by stopping it if the first traversal didn't found anything to swap, without achieving the downwards traversal. Likewise, we can stop if the upward traversal found something to swap, but not the downwards one.
fr: Même si la complexité algorithmique de CocktailSort2 est la même que le tri à bulle, il semble bien mieux s'en tirer en pratique. On peut encore l'améliorer un tout petit peu en arretant tout si le parcours dans l'ordre croissant n'a rien inversé, sans faire le parcours dans l'ordre descroissant. De même, on peut quiter si le parcours croissant a inversé des choses, mais pas le parcours décroissant.

source: Insertion algorithms and variations
fr: Algorithme par insertion et variantes

source: This exercise allows you to experiment with the insertion sort and its major variations.
fr: Cet exercice vous permet d'expérimenter avec le tri par insertion et ses variantes les plus classiques.

source: This sorting algorithm is quite simple to understand and write, even if it is not as efficient as possible. Its asymptotic complexity is in O(n2), but it is more efficient in practice (linear in best case, ie when the array is already sorted, and N2/4 on average).
fr: Ce tri est relativement simple à comprendre et à écrire, même s'il n'offre pas les meilleures performances possibles. Il s'agit d'un algorithme quadratique (complexité asymptotique en O(n2)), mais il est plus efficace en pratique (linéaire dans le meilleur des cas, ie quand le tableau déjà trié et N2/4 en moyenne).

source: The idea is to traverse all elements of the array, and to insert each of them into its proper position in the already sorted part of the array. When we look at an element x, the situation is the following: any elements to the left of the array are already sorted, and we have to insert x at its position in the array.
fr: L'idée est de parcourir tous les éléments du tableau, et d'insérer chacun à sa place dans la partie du tableau déjà trié. Lorsque l'on regarde un élément x du tableau, on est dans la situation suivante : tous les éléments à gauche du tableau sont déjà triés, et il faut insérer x à sa place dans le tableau.

source: Once this is done, the situation is the following:
fr: Une fois ceci fait, on se retrouve dans la situation suivante:

source: The pseudo-code of this algorithm is thus the following:
fr: Le pseudo-code de cet algorithme est donc le suivant :

source: For each i in [1,len] store the value of i in a variable val copy the cell i-1 into i if i-1 contains a value bigger than val copy the cell i-2 into i-1 if i-2 contains a value bigger than val copy the cell i-3 into i-2 if i-3 contains a value bigger than val copy the cell i-4 into i-3 if i-4 contains a value bigger than val ... copy val into the last cell copied above
fr: Pour tout i dans [1,lgr] stoquer la valeur de la case i dans une variable val recopier la case i-1 dans i, si i-1 contient une valeur plus grande que val recopier la case i-2 dans i-1, si i-2 contient une valeur plus grande que val recopier la case i-3 dans i-2, si i-3 contient une valeur plus grande que val recopier la case i-4 dans i-3, si i-4 contient une valeur plus grande que val ... recopier val dans la dernière case recopiée plus haut

source: Naturally, you should use a loop to write the big permutation within the given loop. Writing it this way would be really ... counter-productive.
fr: Bien entendu, il faut utiliser une boucle pour écrire la grosse permutation circulaire au coeur de la boucle. L'écrire explicitement de la sorte serait vraiment ... contre-productif.

source: If you've always wondered what computer science researchers do nowadays, here is part of the answer: They improve fundamental algorithms so that others can write efficient programs.
fr: Si vous vous étiez toujours demandé ce que font les chercheurs en informatique à notre époque, voici un élément de réponse: certains d'entre eux améliorent des algorithmes fondamentaux pour permettre à d'autres de faire des programmes efficaces...

source: Other variation of insertion sort
fr: D'autres variantes du tri par insertion

source: TreeSort builds a binary search tree to sort them. It leads to a O(n log(n)) on average, but O(n^2) in worst cases. We won't study this algorithm here since unterstanding its behavior requires to know what a binary tree is, what is beyond our present goals.
fr: TreeSort construit un arbre binaire équilibré des données pour les trier. Cela lui permet d'être en O(nlog n) en moyenne (mais O(n^2) dans le pire cas). Nous n'étudierons pas cet algorithme ici puisque comprendre son fonctionnement demande de savoir ce qu'est un arbre binaire, ce qui est au dela de nos objectifs présents.

source: There is other variations over the insertion sort, such as PatienceSort which builds piles of values and sort each pile afterward. This algorithm presents a 0(n log(n)) timing worst case and a 0(n) space complexity. LibrarySort (proposed in 2004) also trades a bit space in exchange for time since it provide a time complexity of O(n log(n)) but needs to store some more data.
fr: Il existe d'autres variantes du tri par insertion, comme PatienceSorting, qui fait des paquets des valeurs et trie ensuite chaque paquet. Cet algorithme présente un pire cas en O(nlog n), et une complexité spatiale en O(n). LibrarySort (proposé en 2004) échange également un peu d'espace pour du temps puisqu'il présente une complexité moyenne en O(n log n), mais nécessite de stoquer des données supplémentaires.

source: Wikipedia provides a detailled description of all these algorithms we cannot present here because of time constraints.
fr: Wikipedia (en anglais) propose une description détaillée de tous ces algorithmes que nous n'avons pas le temps de détailler ici.

source: This algorithm is named after its author, Donald Shell, who published it in 1959. It can be seen as an application of the CombSort idea (let elements having a long path to travel take shortcuts) to the insertion sort (CombSort is a variation of BubbleSort). Instead of comparing adjacent values during the insertion sort, it compares values separated by a bigger gap. The bigger the gap, the faster the elements are moved to their final destination, but also the less precise is this move. It is thus mandatory to apply the algorithm with a serie of decreasing gaps. At the last step, when the gap is 1, InsertionSort is used, but onto an array which is almost already sorted by previous steps.
fr: Cet algorithme porte le nom de son auteur, Donald Shell, qui l'a publié en 1959. Son principe peut être vu comme une application de l'idée du CombSort (faire prendre des raccourcis aux éléments ayant beaucoup de chemin à faire) au tri par insertion (le CombSort est une variante du tri à bulle). Au lieu de comparer les valeurs ajacentes lors du tri par insertion, on compare des valeurs séparées par un <i>gap</i> (écartement) plus grand. Plus le gap est grand et plus les éléments sont déplacés rapidement vers leur position finale, mais aussi plus le déplacement est imprécis. Il faut donc appliquer l'algorithme avec une séquence de gaps décroissante vers 1. Ainsi, à la dernière étape quand le gap vaut 1, on applique l'algorithme de tri par insertion de base, mais sur un tableau déjà presque trié par les étapes précédentes.

source: Donald Shell propose <code>len/2</code> as initial value of the gap, and then to divide it by 2 at each step. The pseudo-code is thus the following:
fr: Donald Shell propose d'utiliser <code>lgr/2</code> comme première valeur du gap, puis de le diviser par deux à chaque étape. Le pseudo-code est donc le suivant:

source: gap=len/2 while gap>0: apply InsertionSort, comparing i-gap and i, then i-2gap and i-gap, then i-3gap and i-2gap, etc.
fr: gap=lgr/2 tant que gap>0: appliquer l'algorithme de tri par insertion en comparant i-gap et i, puis i-2gap et i-gap, puis i-3gap et i-2gap, etc.

source: Just like in CombSort, the sequence of values taken by the gap is crucial for Shell sort performance. In some rare pathological cases, the sequence we used above can lead to a O(n^2) performance. Other sequences were proposed: the Hibbard's increments of 2k − 1 lead to a complexity of O(n^(3/2)) in worst cases. Pratt's increments 2^i3^j lead to a O(nlog(n)log(n) performance in worst cases. The existance of a sequence leading to a O(n log(n)) was precluded by Poonen, Plaxton, and Suel. Thanks to this performance, ShellSort is a valid candidate for array of several hundred thousands when correctly implemented.
fr: Comme dans le cas du CombSort, la séquence des valeurs prises par le gap se révèle être d'une importance capitale pour les performances du tri de Shell. Il existe des cas pathologiques qui font que la séquence que nous avons utilisée ici présente une complexité en O(n^2) dans le pire des cas. D'autres séquences ont été proposé: la séquence des incréments de Hibbard (2^k − 1) permet une complexité dans le pire des cas de O(n^(3/2)), les incréments de Pratt (2^i*3^j) permettent un pire cas en O(n log(n)log(n)). Ces résultats font du tri de Shell un candidat tout à fait valide pour des instances de tableau de quelques centaines de milliers d'éléments quand il est correctement implémenté.

source: In our case, the array are ways too small to benefit of these optimizations. If you ever need to do so, take as initial gap the biggest value of the targeted serie still smaller than the array size, and then use decreasing values of the serie.
fr: Dans notre cas, les instances de tableaux que nous utilisons sont trop petites pour que ces optimisations présentent un réel avantage. Si on voulait le faire, il faudrait prendre en valeur initiale du gap la plus grande valeur de la suite utilisée, puis prendre les valeurs successives en descendant ensuite.

source: Interesingly enough, determining the best gap sequence for shell sort turns into a contemporary research issue in computer science. For example, an article of 2001 introduces the following sequence, which seems to be optimal in practice for arrays of size up to 10^5: {1, 4, 10, 23, 57, 132, 301, 701, 1750} (Marcin Ciura, Best Increments for the Average Case of Shellsort, 13th International Symposium on Fundamentals of Computation Theory, LNCS 2001; Vol. 2138).
fr: De façon intéressante, déterminer la meilleure séquence de gap pour le shell sort s'avère être un problème de recherche actuel en informatique. Par exemple, un article publié en 2001 propose la suite suivante, qui semble optimale en pratique pour des tailles de tableau allant jusqu'à 10^5: {1, 4, 10, 23, 57, 132, 301, 701, 1750} (Marcin Ciura, Best Increments for the Average Case of Shellsort, 13th International Symposium on Fundamentals of Computation Theory, LNCS 2001; Vol. 2138).

source: Selection Sort
fr: Tri par selection

source: In this exercise we will implement another classical algorithm: selection sort.
fr: Cet exercice est l'occasion d'implémenter un autre algorithme très classique : le tri par sélection.

source: The idea is simply to select for each cell of the array the smallest value from the part not already sorted. Thus for the first cell, it takes the smallest value over the whole array. For the second one, it takes the second smallest value, which is the smallest value from the cell not already sorted.
fr: Son principe est simplement de sélectioner pour chaque case du tableau la plus petite valeur de la partie pas encore triée. Ainsi, pour la premiere case, je prend la plus petite valeur du tableau. Pour la seconde, je prend la seconde plus petite valeur, qui se trouve être la plus petite des cases n'étant pas encore triées.

source: More generally, for the cell N, it looks the cell M in [n;len] containing the smallest possible value of the interval. Then, it swaps the content of cell N with the one of cell M.
fr: Plus généralement, pour la case N, je cherche la case M de [n;lgr] contenant la plus petite valeur possible. Ensuite, j'inverse le contenu de la case N et celui de la case M.

source: Existing variations
fr: Variantes possibles

source: Another classical algorithm which idea is based on the selection of good elements is HeapSort, but it uses a heap data structure which we did not see yet. Simply remember that HeapSort provides a O(n log n) performance in worst case, which is why it is a very interesting algorithm in practice.
fr: Un autre algorithme classique dont le principe repose sur la sélection des bons éléments est le tri par tas, mais il utilise une structure de données en tas, que nous n'avons pas encore introduite. Sachez simplement que ce tri présente un coût en O(n log n) dans le pire des cas, ce qui en fait un algorithme très intéressant en pratique.

source: Miscellaneous sorting
fr: Tris divers
